Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <module name="AES" id="6149" version="W">
               <instance name="AES">
                  <register-group address-space="base"
                                  name="AES"
                                  name-in-module="AES"
                                  offset="0x4006C000"/>
                  <parameters>
                     <param name="DMAC_ID_TX" value="37"/>
                     <param name="DMAC_ID_RX" value="38"/>
                     <param name="INSTANCE_ID" value="56"/>
                     <param name="CLOCK_ID" value="56"/>
                  </parameters>
               </instance>
            </module>
            <module name="AFEC" id="11147" version="S">
               <instance name="AFEC0">
                  <register-group address-space="base"
                                  name="AFEC0"
                                  name-in-module="AFEC"
                                  offset="0x4003C000"/>
                  <signals>
                     <signal pad="PA8" function="B" group="ADTRG"/>
                     <signal pad="PD30" function="X1" group="AD" index="0"/>
                     <signal pad="PA21" function="X1" group="AD" index="1"/>
                     <signal pad="PB3" function="X1" group="AD" index="2"/>
                     <signal pad="PB2" function="X1" group="AD" index="5"/>
                     <signal pad="PA17" function="X1" group="AD" index="6"/>
                     <signal pad="PA18" function="X1" group="AD" index="7"/>
                     <signal pad="PA19" function="X1" group="AD" index="8"/>
                     <signal pad="PA20" function="X1" group="AD" index="9"/>
                     <signal pad="PB0" function="X1" group="AD" index="10"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="35"/>
                     <param name="INSTANCE_ID" value="29"/>
                     <param name="CLOCK_ID" value="29"/>
                     <param caption="External ADC Trigger Input (AFE0_ADTRG pin)"
                            name="TRGSEL_AFEC_TRIG0"
                            value="0x0"/>
                     <param caption="TC0 Channel 0 Output (TIOA0)"
                            name="TRGSEL_AFEC_TRIG1"
                            value="0x1"/>
                     <param caption="TC0 Channel 1 Output (TIOA1)"
                            name="TRGSEL_AFEC_TRIG2"
                            value="0x2"/>
                     <param caption="TC0 Channel 2 Output (TIOA2)"
                            name="TRGSEL_AFEC_TRIG3"
                            value="0x3"/>
                     <param caption="PWM0 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
                     <param caption="PWM0 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
                     <param caption="Analog Comparator Fault Output"
                            name="TRGSEL_AFEC_TRIG6"
                            value="0x6"/>
                  </parameters>
               </instance>
               <instance name="AFEC1">
                  <register-group address-space="base"
                                  name="AFEC1"
                                  name-in-module="AFEC"
                                  offset="0x40064000"/>
                  <signals>
                     <signal pad="PD9" function="C" group="ADTRG"/>
                     <signal pad="PB1" function="X1" group="AD" index="0"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="36"/>
                     <param name="INSTANCE_ID" value="40"/>
                     <param name="CLOCK_ID" value="40"/>
                     <param caption="External ADC Trigger Input (AFE1_ADTRG Pin)"
                            name="TRGSEL_AFEC_TRIG0"
                            value="0x0"/>
                     <param caption="TC1 Channel 0 Output (TIOA3)"
                            name="TRGSEL_AFEC_TRIG1"
                            value="0x1"/>
                     <param caption="TC1 Channel 1 Output (TIOA4)"
                            name="TRGSEL_AFEC_TRIG2"
                            value="0x2"/>
                     <param caption="TC1 Channel 2 Output (TIOA5)"
                            name="TRGSEL_AFEC_TRIG3"
                            value="0x3"/>
                     <param caption="PWM1 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
                     <param caption="PWM1 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
                     <param caption="Analog Comparator Fault Output"
                            name="TRGSEL_AFEC_TRIG6"
                            value="0x6"/>
                  </parameters>
               </instance>
            </module>
            <module name="CHIPID" id="6417" version="ZK">
               <instance name="CHIPID">
                  <register-group address-space="base"
                                  name="CHIPID"
                                  name-in-module="CHIPID"
                                  offset="0x400E0940"/>
               </instance>
            </module>
            <module name="DACC" id="11246" version="E">
               <instance name="DACC">
                  <register-group address-space="base"
                                  name="DACC"
                                  name-in-module="DACC"
                                  offset="0x40040000"/>
                  <signals>
                     <signal pad="PB13" function="X1" group="DAC" index="0"/>
                     <signal pad="PD0" function="X1" group="DAC" index="1"/>
                     <signal pad="PA2" function="C" group="DATRG"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_CH0_TX" value="30"/>
                     <param name="DMAC_ID_CH1_TX" value="31"/>
                     <param name="INSTANCE_ID" value="30"/>
                     <param name="CLOCK_ID" value="30"/>
                  </parameters>
               </instance>
            </module>
            <module name="EFC" id="6450" version="Y">
               <instance name="EFC">
                  <register-group address-space="base"
                                  name="EFC"
                                  name-in-module="EFC"
                                  offset="0x400E0C00"/>
                  <signals>
                     <signal pad="PB12" function="X1" group="ERASE"/>
                  </signals>
                  <parameters>
                     <param name="FLASH_SIZE" value="524288"/>
                     <param name="PAGE_SIZE" value="512"/>
                     <param name="INSTANCE_ID" value="6"/>
                     <param name="PAGES_PR_REGION" value="32"/>
                  </parameters>
               </instance>
            </module>
            <module name="GPBR" id="6378" version="J">
               <instance name="GPBR">
                  <register-group address-space="base"
                                  name="GPBR"
                                  name-in-module="GPBR"
                                  offset="0x400E1890"/>
               </instance>
            </module>
            <module name="HSMCI" id="6449" version="R">
               <instance name="HSMCI">
                  <register-group address-space="base"
                                  name="HSMCI"
                                  name-in-module="HSMCI"
                                  offset="0x40000000"/>
                  <signals>
                     <signal pad="PA28" function="C" group="MCCDA"/>
                     <signal pad="PA25" function="D" group="MCCK"/>
                     <signal pad="PA30" function="C" group="MCDA" index="0"/>
                     <signal pad="PA31" function="C" group="MCDA" index="1"/>
                     <signal pad="PA26" function="C" group="MCDA" index="2"/>
                     <signal pad="PA27" function="C" group="MCDA" index="3"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="0"/>
                     <param name="DMAC_ID_TX" value="0"/>
                     <param name="INSTANCE_ID" value="18"/>
                     <param name="CLOCK_ID" value="18"/>
                  </parameters>
               </instance>
            </module>
            <module name="I2SC" id="11241" version="N">
               <instance name="I2SC0">
                  <register-group address-space="base"
                                  name="I2SC0"
                                  name-in-module="I2SC"
                                  offset="0x4008C000"/>
                  <signals>
                     <signal pad="PA1" function="D" group="CK"/>
                     <signal pad="PA16" function="D" group="DI" index="0"/>
                     <signal pad="PA30" function="D" group="DO" index="0"/>
                     <signal pad="PA0" function="D" group="MCK"/>
                     <signal pad="PA15" function="D" group="WS"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="69"/>
                     <param name="CLOCK_ID" value="69"/>
                     <param name="DMAC_ID_TX_LEFT" value="44"/>
                     <param name="DMAC_ID_RX_LEFT" value="45"/>
                     <param name="DMAC_ID_TX_RIGHT" value="48"/>
                     <param name="DMAC_ID_RX_RIGHT" value="49"/>
                  </parameters>
               </instance>
            </module>
            <module name="ICM" id="11105" version="H">
               <instance name="ICM">
                  <register-group address-space="base"
                                  name="ICM"
                                  name-in-module="ICM"
                                  offset="0x40048000"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="32"/>
                     <param name="CLOCK_ID" value="32"/>
                  </parameters>
               </instance>
            </module>
            <module name="ISI" id="6350" version="K">
               <instance name="ISI">
                  <register-group address-space="base"
                                  name="ISI"
                                  name-in-module="ISI"
                                  offset="0x4004C000"/>
                  <signals>
                     <signal pad="PD22" function="D" group="D" index="0"/>
                     <signal pad="PD21" function="D" group="D" index="1"/>
                     <signal pad="PB3" function="D" group="D" index="2"/>
                     <signal pad="PA9" function="B" group="D" index="3"/>
                     <signal pad="PA5" function="B" group="D" index="4"/>
                     <signal pad="PD11" function="D" group="D" index="5"/>
                     <signal pad="PD12" function="D" group="D" index="6"/>
                     <signal pad="PA27" function="D" group="D" index="7"/>
                     <signal pad="PD27" function="D" group="D" index="8"/>
                     <signal pad="PD28" function="D" group="D" index="9"/>
                     <signal pad="PD30" function="D" group="D" index="10"/>
                     <signal pad="PD31" function="D" group="D" index="11"/>
                     <signal pad="PD24" function="D" group="HSYNC"/>
                     <signal pad="PA24" function="D" group="PCK"/>
                     <signal pad="PD25" function="D" group="VSYNC"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="59"/>
                     <param name="CLOCK_ID" value="59"/>
                  </parameters>
               </instance>
            </module>
            <module name="MATRIX" id="11282" version="L">
               <instance name="MATRIX">
                  <register-group address-space="base"
                                  name="MATRIX"
                                  name-in-module="MATRIX"
                                  offset="0x40088000"/>
               </instance>
            </module>
            <module name="MCAN" id="11273" version="N">
               <instance name="MCAN0">
                  <register-group address-space="base"
                                  name="MCAN0"
                                  name-in-module="MCAN"
                                  offset="0x40030000"/>
                  <signals>
                     <signal pad="PB3" function="A" group="CANRX" index="0"/>
                     <signal pad="PB2" function="A" group="CANTX" index="0"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="35"/>
                     <param name="CLOCK_ID" value="35"/>
                  </parameters>
               </instance>
               <instance name="MCAN1">
                  <register-group address-space="base"
                                  name="MCAN1"
                                  name-in-module="MCAN"
                                  offset="0x40034000"/>
                  <signals>
                     <signal pad="PD28" function="B" group="CANRX" index="1"/>
                     <signal pad="PD12" function="B" group="CANTX" index="1"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="37"/>
                     <param name="CLOCK_ID" value="37"/>
                  </parameters>
               </instance>
            </module>
            <module name="MLB" id="11287" version="E">
               <instance name="MLB">
                  <register-group address-space="base"
                                  name="MLB"
                                  name-in-module="MLB"
                                  offset="0x40068000"/>
                  <signals>
                     <signal pad="PB4" function="C" group="MLBCLK"/>
                     <signal pad="PB5" function="C" group="MLBDAT"/>
                     <signal pad="PD10" function="D" group="MLBSIG"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="53"/>
                     <param name="CLOCK_ID" value="53"/>
                  </parameters>
               </instance>
            </module>
            <module name="PIO" id="11004" version="V">
               <instance name="PIOA">
                  <register-group address-space="base"
                                  name="PIOA"
                                  name-in-module="PIO"
                                  offset="0x400E0E00"/>
                  <signals>
                     <signal group="P" index="0" function="default" pad="PA0"/>
                     <signal group="P" index="1" function="default" pad="PA1"/>
                     <signal group="P" index="2" function="default" pad="PA2"/>
                     <signal group="P" index="3" function="default" pad="PA3"/>
                     <signal group="P" index="4" function="default" pad="PA4"/>
                     <signal group="P" index="5" function="default" pad="PA5"/>
                     <signal group="P" index="6" function="default" pad="PA6"/>
                     <signal group="P" index="7" function="default" pad="PA7"/>
                     <signal group="P" index="8" function="default" pad="PA8"/>
                     <signal group="P" index="9" function="default" pad="PA9"/>
                     <signal group="P" index="10" function="default" pad="PA10"/>
                     <signal group="P" index="11" function="default" pad="PA11"/>
                     <signal group="P" index="12" function="default" pad="PA12"/>
                     <signal group="P" index="13" function="default" pad="PA13"/>
                     <signal group="P" index="14" function="default" pad="PA14"/>
                     <signal group="P" index="15" function="default" pad="PA15"/>
                     <signal group="P" index="16" function="default" pad="PA16"/>
                     <signal group="P" index="17" function="default" pad="PA17"/>
                     <signal group="P" index="18" function="default" pad="PA18"/>
                     <signal group="P" index="19" function="default" pad="PA19"/>
                     <signal group="P" index="20" function="default" pad="PA20"/>
                     <signal group="P" index="21" function="default" pad="PA21"/>
                     <signal group="P" index="22" function="default" pad="PA22"/>
                     <signal group="P" index="23" function="default" pad="PA23"/>
                     <signal group="P" index="24" function="default" pad="PA24"/>
                     <signal group="P" index="25" function="default" pad="PA25"/>
                     <signal group="P" index="26" function="default" pad="PA26"/>
                     <signal group="P" index="27" function="default" pad="PA27"/>
                     <signal group="P" index="28" function="default" pad="PA28"/>
                     <signal group="P" index="29" function="default" pad="PA29"/>
                     <signal group="P" index="30" function="default" pad="PA30"/>
                     <signal group="P" index="31" function="default" pad="PA31"/>
                     <signal pad="PA3" function="X1" group="PIODC" index="0"/>
                     <signal pad="PA4" function="X1" group="PIODC" index="1"/>
                     <signal pad="PA5" function="X1" group="PIODC" index="2"/>
                     <signal pad="PA9" function="X1" group="PIODC" index="3"/>
                     <signal pad="PA10" function="X1" group="PIODC" index="4"/>
                     <signal pad="PA11" function="X1" group="PIODC" index="5"/>
                     <signal pad="PA12" function="X1" group="PIODC" index="6"/>
                     <signal pad="PA13" function="X1" group="PIODC" index="7"/>
                     <signal pad="PA14" function="X1" group="PIODCEN" index="1"/>
                     <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
                     <signal pad="PA22" function="X1" group="PIODCCLK"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="34"/>
                     <param name="INSTANCE_ID" value="10"/>
                     <param name="CLOCK_ID" value="10"/>
                  </parameters>
               </instance>
               <instance name="PIOB">
                  <register-group address-space="base"
                                  name="PIOB"
                                  name-in-module="PIO"
                                  offset="0x400E1000"/>
                  <signals>
                     <signal group="P" index="32" function="default" pad="PB0"/>
                     <signal group="P" index="33" function="default" pad="PB1"/>
                     <signal group="P" index="34" function="default" pad="PB2"/>
                     <signal group="P" index="35" function="default" pad="PB3"/>
                     <signal group="P" index="36" function="default" pad="PB4"/>
                     <signal group="P" index="37" function="default" pad="PB5"/>
                     <signal group="P" index="38" function="default" pad="PB6"/>
                     <signal group="P" index="39" function="default" pad="PB7"/>
                     <signal group="P" index="40" function="default" pad="PB8"/>
                     <signal group="P" index="41" function="default" pad="PB9"/>
                     <signal group="P" index="44" function="default" pad="PB12"/>
                     <signal group="P" index="45" function="default" pad="PB13"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="11"/>
                     <param name="CLOCK_ID" value="11"/>
                  </parameters>
               </instance>
               <instance name="PIOD">
                  <register-group address-space="base"
                                  name="PIOD"
                                  name-in-module="PIO"
                                  offset="0x400E1400"/>
                  <signals>
                     <signal group="P" index="96" function="default" pad="PD0"/>
                     <signal group="P" index="97" function="default" pad="PD1"/>
                     <signal group="P" index="98" function="default" pad="PD2"/>
                     <signal group="P" index="99" function="default" pad="PD3"/>
                     <signal group="P" index="100" function="default" pad="PD4"/>
                     <signal group="P" index="101" function="default" pad="PD5"/>
                     <signal group="P" index="102" function="default" pad="PD6"/>
                     <signal group="P" index="103" function="default" pad="PD7"/>
                     <signal group="P" index="104" function="default" pad="PD8"/>
                     <signal group="P" index="105" function="default" pad="PD9"/>
                     <signal group="P" index="106" function="default" pad="PD10"/>
                     <signal group="P" index="107" function="default" pad="PD11"/>
                     <signal group="P" index="108" function="default" pad="PD12"/>
                     <signal group="P" index="109" function="default" pad="PD13"/>
                     <signal group="P" index="110" function="default" pad="PD14"/>
                     <signal group="P" index="111" function="default" pad="PD15"/>
                     <signal group="P" index="112" function="default" pad="PD16"/>
                     <signal group="P" index="113" function="default" pad="PD17"/>
                     <signal group="P" index="114" function="default" pad="PD18"/>
                     <signal group="P" index="115" function="default" pad="PD19"/>
                     <signal group="P" index="116" function="default" pad="PD20"/>
                     <signal group="P" index="117" function="default" pad="PD21"/>
                     <signal group="P" index="118" function="default" pad="PD22"/>
                     <signal group="P" index="119" function="default" pad="PD23"/>
                     <signal group="P" index="120" function="default" pad="PD24"/>
                     <signal group="P" index="121" function="default" pad="PD25"/>
                     <signal group="P" index="122" function="default" pad="PD26"/>
                     <signal group="P" index="123" function="default" pad="PD27"/>
                     <signal group="P" index="124" function="default" pad="PD28"/>
                     <signal group="P" index="125" function="default" pad="PD29"/>
                     <signal group="P" index="126" function="default" pad="PD30"/>
                     <signal group="P" index="127" function="default" pad="PD31"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="16"/>
                     <param name="CLOCK_ID" value="16"/>
                  </parameters>
               </instance>
            </module>
