Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="AES_MR__CFBS">
            <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
            <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
            <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
            <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
            <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
         </value-group>
         <value-group caption="" name="AES_MR__CKEY">
            <value caption="This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0."
                   name="PASSWD"
                   value="0xE"/>
         </value-group>
         <value-group caption="" name="AES_ISR__URAT">
            <value caption="Input Data Register written during the data processing when SMOD = 0x2 mode."
                   name="IDR_WR_PROCESSING"
                   value="0x0"/>
            <value caption="Output Data Register read during the data processing."
                   name="ODR_RD_PROCESSING"
                   value="0x1"/>
            <value caption="Mode Register written during the data processing."
                   name="MR_WR_PROCESSING"
                   value="0x2"/>
            <value caption="Output Data Register read during the sub-keys generation."
                   name="ODR_RD_SUBKGEN"
                   value="0x3"/>
            <value caption="Mode Register written during the sub-keys generation."
                   name="MR_WR_SUBKGEN"
                   value="0x4"/>
            <value caption="Write-only register read access."
                   name="WOR_RD_ACCESS"
                   value="0x5"/>
         </value-group>
      </module>
      <module name="AFEC"
              caption="Analog Front-End Controller"
              id="11147"
              version="S">
         <register-group name="AFEC">
            <register caption="AFEC Control Register"
                      name="AFEC_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
               <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
            </register>
            <register caption="AFEC Mode Register"
                      name="AFEC_MR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Trigger Enable"
                         mask="0x00000001"
                         name="TRGEN"
                         values="AFEC_MR__TRGEN"/>
               <bitfield caption="Trigger Selection"
                         mask="0x0000000E"
                         name="TRGSEL"
                         values="AFEC_MR__TRGSEL"/>
               <bitfield caption="Sleep Mode"
                         mask="0x00000020"
                         name="SLEEP"
                         values="AFEC_MR__SLEEP"/>
               <bitfield caption="Fast Wake-up"
                         mask="0x00000040"
                         name="FWUP"
                         values="AFEC_MR__FWUP"/>
               <bitfield caption="Free Run Mode"
                         mask="0x00000080"
                         name="FREERUN"
                         values="AFEC_MR__FREERUN"/>
               <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
               <bitfield caption="Start-up Time"
                         mask="0x000F0000"
                         name="STARTUP"
                         values="AFEC_MR__STARTUP"/>
               <bitfield caption="One" mask="0x00800000" name="ONE"/>
               <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
               <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
               <bitfield caption="User Sequence Enable"
                         mask="0x80000000"
                         name="USEQ"
                         values="AFEC_MR__USEQ"/>
            </register>
            <register caption="AFEC Extended Mode Register"
                      name="AFEC_EMR"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Comparison Mode"
                         mask="0x00000003"
                         name="CMPMODE"
                         values="AFEC_EMR__CMPMODE"/>
               <bitfield caption="Comparison Selected Channel"
                         mask="0x000000F8"
                         name="CMPSEL"/>
               <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
               <bitfield caption="Compare Event Filtering"
                         mask="0x00003000"
                         name="CMPFILTER"/>
               <bitfield caption="Resolution"
                         mask="0x00070000"
                         name="RES"
                         values="AFEC_EMR__RES"/>
               <bitfield caption="TAG of the AFEC_LDCR" mask="0x01000000" name="TAG"/>
               <bitfield caption="Single Trigger Mode" mask="0x02000000" name="STM"/>
               <bitfield caption="Sign Mode"
                         mask="0x30000000"
                         name="SIGNMODE"
                         values="AFEC_EMR__SIGNMODE"/>
            </register>
            <register caption="AFEC Channel Sequence 1 Register"
                      name="AFEC_SEQ1R"
                      offset="0x0C"
                      rw="RW"
                      size="4">
               <bitfield caption="User Sequence Number 0" mask="0x0000000F" name="USCH0"/>
               <bitfield caption="User Sequence Number 1" mask="0x000000F0" name="USCH1"/>
               <bitfield caption="User Sequence Number 2" mask="0x00000F00" name="USCH2"/>
               <bitfield caption="User Sequence Number 3" mask="0x0000F000" name="USCH3"/>
               <bitfield caption="User Sequence Number 4" mask="0x000F0000" name="USCH4"/>
               <bitfield caption="User Sequence Number 5" mask="0x00F00000" name="USCH5"/>
               <bitfield caption="User Sequence Number 6" mask="0x0F000000" name="USCH6"/>
               <bitfield caption="User Sequence Number 7" mask="0xF0000000" name="USCH7"/>
            </register>
            <register caption="AFEC Channel Sequence 2 Register"
                      name="AFEC_SEQ2R"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="User Sequence Number 8" mask="0x0000000F" name="USCH8"/>
               <bitfield caption="User Sequence Number 9" mask="0x000000F0" name="USCH9"/>
               <bitfield caption="User Sequence Number 10" mask="0x00000F00" name="USCH10"/>
               <bitfield caption="User Sequence Number 11" mask="0x0000F000" name="USCH11"/>
            </register>
            <register caption="AFEC Channel Enable Register"
                      name="AFEC_CHER"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="set:AFEC_CHSR">
               <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
               <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
               <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
               <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
               <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
               <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
               <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
               <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
               <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
               <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
               <bitfield caption="Channel 10 Enable" mask="0x00000400" name="CH10"/>
               <bitfield caption="Channel 11 Enable" mask="0x00000800" name="CH11"/>
            </register>
