Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="AFEC Interrupt Status Register"
                      name="AFEC_ISR"
                      offset="0x30"
                      rw="R"
                      size="4"
                      atomic-op="clear:AFEC_ISR">
               <bitfield caption="End of Conversion 0 (cleared by reading AFEC_CDRx)"
                         mask="0x00000001"
                         name="EOC0"/>
               <bitfield caption="End of Conversion 1 (cleared by reading AFEC_CDRx)"
                         mask="0x00000002"
                         name="EOC1"/>
               <bitfield caption="End of Conversion 2 (cleared by reading AFEC_CDRx)"
                         mask="0x00000004"
                         name="EOC2"/>
               <bitfield caption="End of Conversion 3 (cleared by reading AFEC_CDRx)"
                         mask="0x00000008"
                         name="EOC3"/>
               <bitfield caption="End of Conversion 4 (cleared by reading AFEC_CDRx)"
                         mask="0x00000010"
                         name="EOC4"/>
               <bitfield caption="End of Conversion 5 (cleared by reading AFEC_CDRx)"
                         mask="0x00000020"
                         name="EOC5"/>
               <bitfield caption="End of Conversion 6 (cleared by reading AFEC_CDRx)"
                         mask="0x00000040"
                         name="EOC6"/>
               <bitfield caption="End of Conversion 7 (cleared by reading AFEC_CDRx)"
                         mask="0x00000080"
                         name="EOC7"/>
               <bitfield caption="End of Conversion 8 (cleared by reading AFEC_CDRx)"
                         mask="0x00000100"
                         name="EOC8"/>
               <bitfield caption="End of Conversion 9 (cleared by reading AFEC_CDRx)"
                         mask="0x00000200"
                         name="EOC9"/>
               <bitfield caption="End of Conversion 10 (cleared by reading AFEC_CDRx)"
                         mask="0x00000400"
                         name="EOC10"/>
               <bitfield caption="End of Conversion 11 (cleared by reading AFEC_CDRx)"
                         mask="0x00000800"
                         name="EOC11"/>
               <bitfield caption="Data Ready (cleared by reading AFEC_LCDR)"
                         mask="0x01000000"
                         name="DRDY"/>
               <bitfield caption="General Overrun Error (cleared by reading AFEC_ISR)"
                         mask="0x02000000"
                         name="GOVRE"/>
               <bitfield caption="Comparison Error (cleared by reading AFEC_ISR)"
                         mask="0x04000000"
                         name="COMPE"/>
               <bitfield caption="Temperature Change (cleared on read)"
                         mask="0x40000000"
                         name="TEMPCHG"/>
            </register>
            <register caption="AFEC Overrun Status Register"
                      name="AFEC_OVER"
                      offset="0x4C"
                      rw="R"
                      size="4">
               <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
               <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
               <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
               <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
               <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
               <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
               <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
               <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
               <bitfield caption="Overrun Error 8" mask="0x00000100" name="OVRE8"/>
               <bitfield caption="Overrun Error 9" mask="0x00000200" name="OVRE9"/>
               <bitfield caption="Overrun Error 10" mask="0x00000400" name="OVRE10"/>
               <bitfield caption="Overrun Error 11" mask="0x00000800" name="OVRE11"/>
            </register>
            <register caption="AFEC Compare Window Register"
                      name="AFEC_CWR"
                      offset="0x50"
                      rw="RW"
                      size="4">
               <bitfield caption="Low Threshold" mask="0x0000FFFF" name="LOWTHRES"/>
               <bitfield caption="High Threshold" mask="0xFFFF0000" name="HIGHTHRES"/>
            </register>
            <register caption="AFEC Channel Gain Register"
                      name="AFEC_CGR"
                      offset="0x54"
                      rw="RW"
                      size="4">
               <bitfield caption="Gain for Channel 0" mask="0x00000003" name="GAIN0"/>
               <bitfield caption="Gain for Channel 1" mask="0x0000000C" name="GAIN1"/>
               <bitfield caption="Gain for Channel 2" mask="0x00000030" name="GAIN2"/>
               <bitfield caption="Gain for Channel 3" mask="0x000000C0" name="GAIN3"/>
               <bitfield caption="Gain for Channel 4" mask="0x00000300" name="GAIN4"/>
               <bitfield caption="Gain for Channel 5" mask="0x00000C00" name="GAIN5"/>
               <bitfield caption="Gain for Channel 6" mask="0x00003000" name="GAIN6"/>
               <bitfield caption="Gain for Channel 7" mask="0x0000C000" name="GAIN7"/>
               <bitfield caption="Gain for Channel 8" mask="0x00030000" name="GAIN8"/>
               <bitfield caption="Gain for Channel 9" mask="0x000C0000" name="GAIN9"/>
               <bitfield caption="Gain for Channel 10" mask="0x00300000" name="GAIN10"/>
               <bitfield caption="Gain for Channel 11" mask="0x00C00000" name="GAIN11"/>
            </register>
            <register caption="AFEC Channel Differential Register"
                      name="AFEC_DIFFR"
                      offset="0x60"
                      rw="RW"
                      size="4">
               <bitfield caption="Differential inputs for channel 0"
                         mask="0x00000001"
                         name="DIFF0"/>
               <bitfield caption="Differential inputs for channel 1"
                         mask="0x00000002"
                         name="DIFF1"/>
               <bitfield caption="Differential inputs for channel 2"
                         mask="0x00000004"
                         name="DIFF2"/>
               <bitfield caption="Differential inputs for channel 3"
                         mask="0x00000008"
                         name="DIFF3"/>
               <bitfield caption="Differential inputs for channel 4"
                         mask="0x00000010"
                         name="DIFF4"/>
               <bitfield caption="Differential inputs for channel 5"
                         mask="0x00000020"
                         name="DIFF5"/>
               <bitfield caption="Differential inputs for channel 6"
                         mask="0x00000040"
                         name="DIFF6"/>
               <bitfield caption="Differential inputs for channel 7"
                         mask="0x00000080"
                         name="DIFF7"/>
               <bitfield caption="Differential inputs for channel 8"
                         mask="0x00000100"
                         name="DIFF8"/>
               <bitfield caption="Differential inputs for channel 9"
                         mask="0x00000200"
                         name="DIFF9"/>
               <bitfield caption="Differential inputs for channel 10"
                         mask="0x00000400"
                         name="DIFF10"/>
               <bitfield caption="Differential inputs for channel 11"
                         mask="0x00000800"
                         name="DIFF11"/>
            </register>
            <register caption="AFEC Channel Selection Register"
                      name="AFEC_CSELR"
                      offset="0x64"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel Selection" mask="0x0000000F" name="CSEL"/>
            </register>
            <register caption="AFEC Channel Data Register"
                      name="AFEC_CDR"
                      offset="0x68"
                      rw="R"
                      size="4">
               <bitfield caption="Converted Data" mask="0x0000FFFF" name="DATA"/>
            </register>
