Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="AFEC Channel Offset Compensation Register"
                      name="AFEC_COCR"
                      offset="0x6C"
                      rw="RW"
                      size="4">
               <bitfield caption="Analog Offset" mask="0x000003FF" name="AOFF"/>
            </register>
            <register caption="AFEC Temperature Sensor Mode Register"
                      name="AFEC_TEMPMR"
                      offset="0x70"
                      rw="RW"
                      size="4">
               <bitfield caption="Temperature Sensor RTC Trigger Mode"
                         mask="0x00000001"
                         name="RTCT"/>
               <bitfield caption="Temperature Comparison Mode"
                         mask="0x00000030"
                         name="TEMPCMPMOD"
                         values="AFEC_TEMPMR__TEMPCMPMOD"/>
            </register>
            <register caption="AFEC Temperature Compare Window Register"
                      name="AFEC_TEMPCWR"
                      offset="0x74"
                      rw="RW"
                      size="4">
               <bitfield caption="Temperature Low Threshold"
                         mask="0x0000FFFF"
                         name="TLOWTHRES"/>
               <bitfield caption="Temperature High Threshold"
                         mask="0xFFFF0000"
                         name="THIGHTHRES"/>
            </register>
            <register caption="AFEC Analog Control Register"
                      name="AFEC_ACR"
                      offset="0x94"
                      rw="RW"
                      size="4">
               <bitfield caption="PGA0 Enable" mask="0x00000004" name="PGA0EN"/>
               <bitfield caption="PGA1 Enable" mask="0x00000008" name="PGA1EN"/>
               <bitfield caption="AFE Bias Current Control" mask="0x00000300" name="IBCTL"/>
            </register>
            <register caption="AFEC Sample &amp; Hold Mode Register"
                      name="AFEC_SHMR"
                      offset="0xA0"
                      rw="RW"
                      size="4">
               <bitfield caption="Dual Sample &amp; Hold for channel 0"
                         mask="0x00000001"
                         name="DUAL0"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 1"
                         mask="0x00000002"
                         name="DUAL1"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 2"
                         mask="0x00000004"
                         name="DUAL2"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 3"
                         mask="0x00000008"
                         name="DUAL3"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 4"
                         mask="0x00000010"
                         name="DUAL4"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 5"
                         mask="0x00000020"
                         name="DUAL5"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 6"
                         mask="0x00000040"
                         name="DUAL6"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 7"
                         mask="0x00000080"
                         name="DUAL7"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 8"
                         mask="0x00000100"
                         name="DUAL8"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 9"
                         mask="0x00000200"
                         name="DUAL9"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 10"
                         mask="0x00000400"
                         name="DUAL10"/>
               <bitfield caption="Dual Sample &amp; Hold for channel 11"
                         mask="0x00000800"
                         name="DUAL11"/>
            </register>
            <register caption="AFEC Correction Select Register"
                      name="AFEC_COSR"
                      offset="0xD0"
                      rw="RW"
                      size="4">
               <bitfield caption="Sample &amp; Hold unit Correction Select"
                         mask="0x00000001"
                         name="CSEL"/>
            </register>
            <register caption="AFEC Correction Values Register"
                      name="AFEC_CVR"
                      offset="0xD4"
                      rw="RW"
                      size="4">
               <bitfield caption="Offset Correction" mask="0x0000FFFF" name="OFFSETCORR"/>
               <bitfield caption="Gain Correction" mask="0xFFFF0000" name="GAINCORR"/>
            </register>
            <register caption="AFEC Channel Error Correction Register"
                      name="AFEC_CECR"
                      offset="0xD8"
                      rw="RW"
                      size="4">
               <bitfield caption="Error Correction Enable for channel 0"
                         mask="0x00000001"
                         name="ECORR0"/>
               <bitfield caption="Error Correction Enable for channel 1"
                         mask="0x00000002"
                         name="ECORR1"/>
               <bitfield caption="Error Correction Enable for channel 2"
                         mask="0x00000004"
                         name="ECORR2"/>
               <bitfield caption="Error Correction Enable for channel 3"
                         mask="0x00000008"
                         name="ECORR3"/>
               <bitfield caption="Error Correction Enable for channel 4"
                         mask="0x00000010"
                         name="ECORR4"/>
               <bitfield caption="Error Correction Enable for channel 5"
                         mask="0x00000020"
                         name="ECORR5"/>
               <bitfield caption="Error Correction Enable for channel 6"
                         mask="0x00000040"
                         name="ECORR6"/>
               <bitfield caption="Error Correction Enable for channel 7"
                         mask="0x00000080"
                         name="ECORR7"/>
               <bitfield caption="Error Correction Enable for channel 8"
                         mask="0x00000100"
                         name="ECORR8"/>
               <bitfield caption="Error Correction Enable for channel 9"
                         mask="0x00000200"
                         name="ECORR9"/>
               <bitfield caption="Error Correction Enable for channel 10"
                         mask="0x00000400"
                         name="ECORR10"/>
               <bitfield caption="Error Correction Enable for channel 11"
                         mask="0x00000800"
                         name="ECORR11"/>
            </register>
