Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Channel Disable Register"
                      name="DACC_CHDR"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="clear:DACC_CHSR">
               <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
               <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
            </register>
            <register caption="Channel Status Register"
                      name="DACC_CHSR"
                      offset="0x18"
                      rw="R"
                      size="4">
               <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
               <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
               <bitfield caption="DAC Ready Flag" mask="0x00000100" name="DACRDY0"/>
               <bitfield caption="DAC Ready Flag" mask="0x00000200" name="DACRDY1"/>
            </register>
            <register caption="Conversion Data Register 0"
                      name="DACC_CDR"
                      offset="0x1C"
                      rw="W"
                      size="4"
                      count="2">
               <bitfield caption="Data to Convert for channel 0"
                         mask="0x0000FFFF"
                         name="DATA0"/>
               <bitfield caption="Data to Convert for channel 1"
                         mask="0xFFFF0000"
                         name="DATA1"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="DACC_IER"
                      offset="0x24"
                      rw="W"
                      size="4"
                      atomic-op="set:DACC_IMR">
               <bitfield caption="Transmit Ready Interrupt Enable of channel 0"
                         mask="0x00000001"
                         name="TXRDY0"/>
               <bitfield caption="Transmit Ready Interrupt Enable of channel 1"
                         mask="0x00000002"
                         name="TXRDY1"/>
               <bitfield caption="End of Conversion Interrupt Enable of channel 0"
                         mask="0x00000010"
                         name="EOC0"/>
               <bitfield caption="End of Conversion Interrupt Enable of channel 1"
                         mask="0x00000020"
                         name="EOC1"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="DACC_IDR"
                      offset="0x28"
                      rw="W"
                      size="4"
                      atomic-op="clear:DACC_IMR">
               <bitfield caption="Transmit Ready Interrupt Disable of channel 0"
                         mask="0x00000001"
                         name="TXRDY0"/>
               <bitfield caption="Transmit Ready Interrupt Disable of channel 1"
                         mask="0x00000002"
                         name="TXRDY1"/>
               <bitfield caption="End of Conversion Interrupt Disable of channel 0"
                         mask="0x00000010"
                         name="EOC0"/>
               <bitfield caption="End of Conversion Interrupt Disable of channel 1"
                         mask="0x00000020"
                         name="EOC1"/>
            </register>
            <register caption="Interrupt Mask Register"
                      name="DACC_IMR"
                      offset="0x2C"
                      rw="R"
                      size="4"
                      atomic-op="read:DACC_IMR">
               <bitfield caption="Transmit Ready Interrupt Mask of channel 0"
                         mask="0x00000001"
                         name="TXRDY0"/>
               <bitfield caption="Transmit Ready Interrupt Mask of channel 1"
                         mask="0x00000002"
                         name="TXRDY1"/>
               <bitfield caption="End of Conversion Interrupt Mask of channel 0"
                         mask="0x00000010"
                         name="EOC0"/>
               <bitfield caption="End of Conversion Interrupt Mask of channel 1"
                         mask="0x00000020"
                         name="EOC1"/>
            </register>
            <register caption="Interrupt Status Register"
                      name="DACC_ISR"
                      offset="0x30"
                      rw="R"
                      size="4"
                      atomic-op="clear:DACC_ISR">
               <bitfield caption="Transmit Ready Interrupt Flag of channel 0"
                         mask="0x00000001"
                         name="TXRDY0"/>
               <bitfield caption="Transmit Ready Interrupt Flag of channel 1"
                         mask="0x00000002"
                         name="TXRDY1"/>
               <bitfield caption="End of Conversion Interrupt Flag of channel 0"
                         mask="0x00000010"
                         name="EOC0"/>
               <bitfield caption="End of Conversion Interrupt Flag of channel 1"
                         mask="0x00000020"
                         name="EOC1"/>
            </register>
            <register caption="Analog Current Register"
                      name="DACC_ACR"
                      offset="0x94"
                      rw="RW"
                      size="4">
               <bitfield caption="Analog Output Current Control"
                         mask="0x00000003"
                         name="IBCTLCH0"/>
               <bitfield caption="Analog Output Current Control"
                         mask="0x0000000C"
                         name="IBCTLCH1"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="DACC_WPMR"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protect Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="DACC_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="DACC_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0x0000FF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
         <value-group caption="" name="DACC_MR__MAXS0">
            <value caption="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)"
                   name="TRIG_EVENT"
                   value="0"/>
            <value caption="Max speed mode enabled." name="MAXIMUM" value="1"/>
         </value-group>
