Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="ISI Color Space Conversion RGB To YCrCb Set 0 Register"
                      name="ISI_R2Y_SET0"
                      offset="0x18"
                      rw="RW"
                      size="4">
               <bitfield caption="Color Space Conversion Matrix Coefficient C0"
                         mask="0x0000007F"
                         name="C0"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C1"
                         mask="0x00007F00"
                         name="C1"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C2"
                         mask="0x007F0000"
                         name="C2"/>
               <bitfield caption="Color Space Conversion Red Component Offset"
                         mask="0x01000000"
                         name="Roff"/>
            </register>
            <register caption="ISI Color Space Conversion RGB To YCrCb Set 1 Register"
                      name="ISI_R2Y_SET1"
                      offset="0x1C"
                      rw="RW"
                      size="4">
               <bitfield caption="Color Space Conversion Matrix Coefficient C3"
                         mask="0x0000007F"
                         name="C3"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C4"
                         mask="0x00007F00"
                         name="C4"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C5"
                         mask="0x007F0000"
                         name="C5"/>
               <bitfield caption="Color Space Conversion Green Component Offset"
                         mask="0x01000000"
                         name="Goff"/>
            </register>
            <register caption="ISI Color Space Conversion RGB To YCrCb Set 2 Register"
                      name="ISI_R2Y_SET2"
                      offset="0x20"
                      rw="RW"
                      size="4">
               <bitfield caption="Color Space Conversion Matrix Coefficient C6"
                         mask="0x0000007F"
                         name="C6"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C7"
                         mask="0x00007F00"
                         name="C7"/>
               <bitfield caption="Color Space Conversion Matrix Coefficient C8"
                         mask="0x007F0000"
                         name="C8"/>
               <bitfield caption="Color Space Conversion Blue Component Offset"
                         mask="0x01000000"
                         name="Boff"/>
            </register>
            <register caption="ISI Control Register"
                      name="ISI_CR"
                      offset="0x24"
                      rw="W"
                      size="4">
               <bitfield caption="ISI Module Enable Request" mask="0x00000001" name="ISI_EN"/>
               <bitfield caption="ISI Module Disable Request"
                         mask="0x00000002"
                         name="ISI_DIS"/>
               <bitfield caption="ISI Software Reset Request"
                         mask="0x00000004"
                         name="ISI_SRST"/>
               <bitfield caption="ISI Codec Request" mask="0x00000100" name="ISI_CDC"/>
            </register>
            <register caption="ISI Status Register"
                      name="ISI_SR"
                      offset="0x28"
                      rw="R"
                      size="4">
               <bitfield caption="Module Enable" mask="0x00000001" name="ENABLE"/>
               <bitfield caption="Module Disable Request has Terminated (cleared on read)"
                         mask="0x00000002"
                         name="DIS_DONE"/>
               <bitfield caption="Module Software Reset Request has Terminated (cleared on read)"
                         mask="0x00000004"
                         name="SRST"/>
               <bitfield caption="Pending Codec Request" mask="0x00000100" name="CDC_PND"/>
               <bitfield caption="Vertical Synchronization (cleared on read)"
                         mask="0x00000400"
                         name="VSYNC"/>
               <bitfield caption="Preview DMA Transfer has Terminated (cleared on read)"
                         mask="0x00010000"
                         name="PXFR_DONE"/>
               <bitfield caption="Codec DMA Transfer has Terminated (cleared on read)"
                         mask="0x00020000"
                         name="CXFR_DONE"/>
               <bitfield caption="Synchronization in Progress" mask="0x00080000" name="SIP"/>
               <bitfield caption="Preview Datapath Overflow (cleared on read)"
                         mask="0x01000000"
                         name="P_OVR"/>
               <bitfield caption="Codec Datapath Overflow (cleared on read)"
                         mask="0x02000000"
                         name="C_OVR"/>
               <bitfield caption="CRC Synchronization Error (cleared on read)"
                         mask="0x04000000"
                         name="CRC_ERR"/>
               <bitfield caption="Frame Rate Overrun (cleared on read)"
                         mask="0x08000000"
                         name="FR_OVR"/>
            </register>
            <register caption="ISI Interrupt Enable Register"
                      name="ISI_IER"
                      offset="0x2C"
                      rw="W"
                      size="4"
                      atomic-op="set:ISI_IMR">
               <bitfield caption="Disable Done Interrupt Enable"
                         mask="0x00000002"
                         name="DIS_DONE"/>
               <bitfield caption="Software Reset Interrupt Enable"
                         mask="0x00000004"
                         name="SRST"/>
               <bitfield caption="Vertical Synchronization Interrupt Enable"
                         mask="0x00000400"
                         name="VSYNC"/>
               <bitfield caption="Preview DMA Transfer Done Interrupt Enable"
                         mask="0x00010000"
                         name="PXFR_DONE"/>
               <bitfield caption="Codec DMA Transfer Done Interrupt Enable"
                         mask="0x00020000"
                         name="CXFR_DONE"/>
               <bitfield caption="Preview Datapath Overflow Interrupt Enable"
                         mask="0x01000000"
                         name="P_OVR"/>
               <bitfield caption="Codec Datapath Overflow Interrupt Enable"
                         mask="0x02000000"
                         name="C_OVR"/>
               <bitfield caption="Embedded Synchronization CRC Error Interrupt Enable"
                         mask="0x04000000"
                         name="CRC_ERR"/>
               <bitfield caption="Frame Rate Overflow Interrupt Enable"
                         mask="0x08000000"
                         name="FR_OVR"/>
            </register>
