Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="ISI Interrupt Disable Register"
                      name="ISI_IDR"
                      offset="0x30"
                      rw="W"
                      size="4"
                      atomic-op="clear:ISI_IMR">
               <bitfield caption="Disable Done Interrupt Disable"
                         mask="0x00000002"
                         name="DIS_DONE"/>
               <bitfield caption="Software Reset Interrupt Disable"
                         mask="0x00000004"
                         name="SRST"/>
               <bitfield caption="Vertical Synchronization Interrupt Disable"
                         mask="0x00000400"
                         name="VSYNC"/>
               <bitfield caption="Preview DMA Transfer Done Interrupt Disable"
                         mask="0x00010000"
                         name="PXFR_DONE"/>
               <bitfield caption="Codec DMA Transfer Done Interrupt Disable"
                         mask="0x00020000"
                         name="CXFR_DONE"/>
               <bitfield caption="Preview Datapath Overflow Interrupt Disable"
                         mask="0x01000000"
                         name="P_OVR"/>
               <bitfield caption="Codec Datapath Overflow Interrupt Disable"
                         mask="0x02000000"
                         name="C_OVR"/>
               <bitfield caption="Embedded Synchronization CRC Error Interrupt Disable"
                         mask="0x04000000"
                         name="CRC_ERR"/>
               <bitfield caption="Frame Rate Overflow Interrupt Disable"
                         mask="0x08000000"
                         name="FR_OVR"/>
            </register>
            <register caption="ISI Interrupt Mask Register"
                      name="ISI_IMR"
                      offset="0x34"
                      rw="R"
                      size="4"
                      atomic-op="read:ISI_IMR">
               <bitfield caption="Module Disable Operation Completed"
                         mask="0x00000002"
                         name="DIS_DONE"/>
               <bitfield caption="Software Reset Completed" mask="0x00000004" name="SRST"/>
               <bitfield caption="Vertical Synchronization" mask="0x00000400" name="VSYNC"/>
               <bitfield caption="Preview DMA Transfer Completed"
                         mask="0x00010000"
                         name="PXFR_DONE"/>
               <bitfield caption="Codec DMA Transfer Completed"
                         mask="0x00020000"
                         name="CXFR_DONE"/>
               <bitfield caption="Preview FIFO Overflow" mask="0x01000000" name="P_OVR"/>
               <bitfield caption="Codec FIFO Overflow" mask="0x02000000" name="C_OVR"/>
               <bitfield caption="CRC Synchronization Error"
                         mask="0x04000000"
                         name="CRC_ERR"/>
               <bitfield caption="Frame Rate Overrun" mask="0x08000000" name="FR_OVR"/>
            </register>
            <register caption="DMA Channel Enable Register"
                      name="ISI_DMA_CHER"
                      offset="0x38"
                      rw="W"
                      size="4"
                      atomic-op="set:ISI_DMA_CHSR">
               <bitfield caption="Preview Channel Enable" mask="0x00000001" name="P_CH_EN"/>
               <bitfield caption="Codec Channel Enable" mask="0x00000002" name="C_CH_EN"/>
            </register>
            <register caption="DMA Channel Disable Register"
                      name="ISI_DMA_CHDR"
                      offset="0x3C"
                      rw="W"
                      size="4"
                      atomic-op="clear:ISI_DMA_CHSR">
               <bitfield caption="Preview Channel Disable Request"
                         mask="0x00000001"
                         name="P_CH_DIS"/>
               <bitfield caption="Codec Channel Disable Request"
                         mask="0x00000002"
                         name="C_CH_DIS"/>
            </register>
            <register caption="DMA Channel Status Register"
                      name="ISI_DMA_CHSR"
                      offset="0x40"
                      rw="R"
                      size="4">
               <bitfield caption="Preview DMA Channel Status"
                         mask="0x00000001"
                         name="P_CH_S"/>
               <bitfield caption="Code DMA Channel Status" mask="0x00000002" name="C_CH_S"/>
            </register>
            <register caption="DMA Preview Base Address Register"
                      name="ISI_DMA_P_ADDR"
                      offset="0x44"
                      rw="RW"
                      size="4">
               <bitfield caption="Preview Image Base Address"
                         mask="0xFFFFFFFC"
                         name="P_ADDR"/>
            </register>
            <register caption="DMA Preview Control Register"
                      name="ISI_DMA_P_CTRL"
                      offset="0x48"
                      rw="RW"
                      size="4">
               <bitfield caption="Descriptor Fetch Control Bit"
                         mask="0x00000001"
                         name="P_FETCH"/>
               <bitfield caption="Descriptor Writeback Control Bit"
                         mask="0x00000002"
                         name="P_WB"/>
               <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="P_IEN"/>
               <bitfield caption="Preview Transfer Done" mask="0x00000008" name="P_DONE"/>
            </register>
            <register caption="DMA Preview Descriptor Address Register"
                      name="ISI_DMA_P_DSCR"
                      offset="0x4C"
                      rw="RW"
                      size="4">
               <bitfield caption="Preview Descriptor Base Address"
                         mask="0xFFFFFFFC"
                         name="P_DSCR"/>
            </register>
            <register caption="DMA Codec Base Address Register"
                      name="ISI_DMA_C_ADDR"
                      offset="0x50"
                      rw="RW"
                      size="4">
               <bitfield caption="Codec Image Base Address" mask="0xFFFFFFFC" name="C_ADDR"/>
            </register>
            <register caption="DMA Codec Control Register"
                      name="ISI_DMA_C_CTRL"
                      offset="0x54"
                      rw="RW"
                      size="4">
               <bitfield caption="Descriptor Fetch Control Bit"
                         mask="0x00000001"
                         name="C_FETCH"/>
               <bitfield caption="Descriptor Writeback Control Bit"
                         mask="0x00000002"
                         name="C_WB"/>
               <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="C_IEN"/>
               <bitfield caption="Codec Transfer Done" mask="0x00000008" name="C_DONE"/>
            </register>
            <register caption="DMA Codec Descriptor Address Register"
                      name="ISI_DMA_C_DSCR"
                      offset="0x58"
                      rw="RW"
                      size="4">
               <bitfield caption="Codec Descriptor Base Address"
                         mask="0xFFFFFFFC"
                         name="C_DSCR"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="ISI_WPMR"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protection Key Password"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="ISI_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="ISI_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0x00FFFF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
         <value-group caption="" name="ISI_CFG1__THMASK">
            <value caption="Only 4 beats AHB burst allowed" name="BEATS_4" value="0x0"/>
            <value caption="Only 4 and 8 beats AHB burst allowed"
                   name="BEATS_8"
                   value="0x1"/>
            <value caption="4, 8 and 16 beats AHB burst allowed"
                   name="BEATS_16"
                   value="0x2"/>
         </value-group>
