Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="ISI_CFG2__YCC_SWAP">
            <value caption="Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)"
                   name="DEFAULT"
                   value="0x0"/>
            <value caption="Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)"
                   name="MODE1"
                   value="0x1"/>
            <value caption="Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)"
                   name="MODE2"
                   value="0x2"/>
            <value caption="Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)"
                   name="MODE3"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="ISI_CFG2__RGB_CFG">
            <value caption="Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B"
                   name="DEFAULT"
                   value="0x0"/>
            <value caption="Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R"
                   name="MODE1"
                   value="0x1"/>
            <value caption="Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)"
                   name="MODE2"
                   value="0x2"/>
            <value caption="Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)"
                   name="MODE3"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="ISI_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0."
                   name="PASSWD"
                   value="0x495349"/>
         </value-group>
      </module>
      <module name="MATRIX" caption="AHB Bus Matrix" id="11282" version="L">
         <register-group name="MATRIX_PR" size="8">
            <register caption="Priority Register A for Slave 0"
                      name="MATRIX_PRAS"
                      offset="0x00"
                      rw="RW"
                      size="4">
               <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
               <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
               <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
               <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
               <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
               <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
               <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
               <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
            </register>
            <register caption="Priority Register B for Slave 0"
                      name="MATRIX_PRBS"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
               <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
               <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
               <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
            </register>
         </register-group>
         <register-group name="MATRIX">
            <register caption="Master Configuration Register 0"
                      name="MATRIX_MCFG"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      count="13">
               <bitfield caption="Undefined Length Burst Type"
                         mask="0x00000007"
                         name="ULBT"
                         values="MATRIX_MCFG__ULBT"/>
            </register>
            <register caption="Slave Configuration Register 0"
                      name="MATRIX_SCFG"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      count="9">
               <bitfield caption="Maximum Bus Grant Duration for Masters"
                         mask="0x000001FF"
                         name="SLOT_CYCLE"/>
               <bitfield caption="Default Master Type"
                         mask="0x00030000"
                         name="DEFMSTR_TYPE"
                         values="MATRIX_SCFG__DEFMSTR_TYPE"/>
               <bitfield caption="Fixed Default Master"
                         mask="0x003C0000"
                         name="FIXED_DEFMSTR"/>
            </register>
            <register-group caption="Priority Register A for Slave 0"
                            offset="0x0080"
                            name="MATRIX_PR"
                            size="8"
                            count="9"
                            name-in-module="MATRIX_PR"/>
            <register caption="Master Remap Control Register"
                      name="MATRIX_MRCR"
                      offset="0x0100"
                      rw="RW"
                      size="4">
               <bitfield caption="Remap Command Bit for Master 0"
                         mask="0x00000001"
                         name="RCB0"/>
               <bitfield caption="Remap Command Bit for Master 1"
                         mask="0x00000002"
                         name="RCB1"/>
               <bitfield caption="Remap Command Bit for Master 2"
                         mask="0x00000004"
                         name="RCB2"/>
               <bitfield caption="Remap Command Bit for Master 3"
                         mask="0x00000008"
                         name="RCB3"/>
               <bitfield caption="Remap Command Bit for Master 4"
                         mask="0x00000010"
                         name="RCB4"/>
               <bitfield caption="Remap Command Bit for Master 5"
                         mask="0x00000020"
                         name="RCB5"/>
               <bitfield caption="Remap Command Bit for Master 6"
                         mask="0x00000040"
                         name="RCB6"/>
               <bitfield caption="Remap Command Bit for Master 7"
                         mask="0x00000080"
                         name="RCB7"/>
               <bitfield caption="Remap Command Bit for Master 8"
                         mask="0x00000100"
                         name="RCB8"/>
               <bitfield caption="Remap Command Bit for Master 10"
                         mask="0x00000400"
                         name="RCB10"/>
               <bitfield caption="Remap Command Bit for Master 11"
                         mask="0x00000800"
                         name="RCB11"/>
               <bitfield caption="Remap Command Bit for Master 12"
                         mask="0x00001000"
                         name="RCB12"/>
            </register>
            <register caption="CAN0 Configuration Register"
                      name="CCFG_CAN0"
                      offset="0x0110"
                      rw="RW"
                      size="4">
               <bitfield caption="CAN0 DMA Base Address" mask="0xFFFF0000" name="CAN0DMABA"/>
            </register>
