Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="System I/O and CAN1 Configuration Register"
                      name="CCFG_SYSIO"
                      offset="0x0114"
                      rw="RW"
                      size="4">
               <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
               <bitfield caption="PB5 or TDO/TRACESWO Assignment"
                         mask="0x00000020"
                         name="SYSIO5"/>
               <bitfield caption="PB6 or TMS/SWDIO Assignment"
                         mask="0x00000040"
                         name="SYSIO6"/>
               <bitfield caption="PB7 or TCK/SWCLK Assignment"
                         mask="0x00000080"
                         name="SYSIO7"/>
               <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
               <bitfield caption="CAN1 DMA Base Address" mask="0xFFFF0000" name="CAN1DMABA"/>
            </register>
            <register caption="Peripheral Clock Configuration Register"
                      name="CCFG_PCCR"
                      offset="0x0118"
                      rw="RW"
                      size="4">
               <bitfield caption="TC0 Clock Configuration" mask="0x00100000" name="TC0CC"/>
               <bitfield caption="I2SC0 Clock Configuration"
                         mask="0x00200000"
                         name="I2SC0CC"/>
               <bitfield caption="I2SC1 Clock Configuration"
                         mask="0x00400000"
                         name="I2SC1CC"/>
            </register>
            <register caption="Dynamic Clock Gating Register"
                      name="CCFG_DYNCKG"
                      offset="0x011C"
                      rw="RW"
                      size="4">
               <bitfield caption="MATRIX Dynamic Clock Gating"
                         mask="0x00000001"
                         name="MATCKG"/>
               <bitfield caption="Bridge Dynamic Clock Gating Enable"
                         mask="0x00000002"
                         name="BRIDCKG"/>
               <bitfield caption="EFC Dynamic Clock Gating Enable"
                         mask="0x00000004"
                         name="EFCCKG"/>
            </register>
            <register caption="SMC NAND Flash Chip Select Configuration Register"
                      name="CCFG_SMCNFCS"
                      offset="0x0124"
                      rw="RW"
                      size="4">
               <bitfield caption="SMC NAND Flash Chip Select 0 Assignment"
                         mask="0x00000001"
                         name="SMC_NFCS0"/>
               <bitfield caption="SMC NAND Flash Chip Select 1 Assignment"
                         mask="0x00000002"
                         name="SMC_NFCS1"/>
               <bitfield caption="SMC NAND Flash Chip Select 2 Assignment"
                         mask="0x00000004"
                         name="SMC_NFCS2"/>
               <bitfield caption="SMC NAND Flash Chip Select 3 Assignment"
                         mask="0x00000008"
                         name="SMC_NFCS3"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="MATRIX_WPMR"
                      offset="0x01E4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="MATRIX_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="MATRIX_WPSR"
                      offset="0x01E8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0x00FFFF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
         <value-group caption="" name="MATRIX_MCFG__ULBT">
            <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave."
                   name="UNLTD_LENGTH"
                   value="0x0"/>
            <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence."
                   name="SINGLE_ACCESS"
                   value="0x1"/>
            <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats."
                   name="_4BEAT_BURST"
                   value="0x2"/>
            <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats."
                   name="_8BEAT_BURST"
                   value="0x3"/>
            <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats."
                   name="_16BEAT_BURST"
                   value="0x4"/>
            <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats."
                   name="_32BEAT_BURST"
                   value="0x5"/>
            <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats."
                   name="_64BEAT_BURST"
                   value="0x6"/>
            <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats."
                   name="_128BEAT_BURST"
                   value="0x7"/>
         </value-group>
         <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
            <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access."
                   name="NONE"
                   value="0x0"/>
            <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again."
                   name="LAST"
                   value="0x1"/>
            <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again."
                   name="FIXED"
                   value="0x2"/>
         </value-group>
         <value-group caption="" name="MATRIX_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0."
                   name="PASSWD"
                   value="0x4D4154"/>
         </value-group>
      </module>
