Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
      <module name="MCAN"
              caption="Controller Area Network"
              id="11273"
              version="N">
         <register-group name="MCAN">
            <register caption="Core Release Register"
                      name="MCAN_CREL"
                      offset="0x00"
                      rw="R"
                      size="4">
               <bitfield caption="Timestamp Day" mask="0x000000FF" name="DAY"/>
               <bitfield caption="Timestamp Month" mask="0x0000FF00" name="MON"/>
               <bitfield caption="Timestamp Year" mask="0x000F0000" name="YEAR"/>
               <bitfield caption="Sub-step of Core Release" mask="0x00F00000" name="SUBSTEP"/>
               <bitfield caption="Step of Core Release" mask="0x0F000000" name="STEP"/>
               <bitfield caption="Core Release" mask="0xF0000000" name="REL"/>
            </register>
            <register caption="Endian Register"
                      name="MCAN_ENDN"
                      offset="0x04"
                      rw="R"
                      size="4">
               <bitfield caption="Endianness Test Value" mask="0xFFFFFFFF" name="ETV"/>
            </register>
            <register caption="Customer Register"
                      name="MCAN_CUST"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Customer-specific Value" mask="0xFFFFFFFF" name="CSV"/>
            </register>
            <register caption="Data Bit Timing and Prescaler Register"
                      name="MCAN_DBTP"
                      offset="0x0C"
                      rw="RW"
                      size="4">
               <bitfield caption="Data (Re) Synchronization Jump Width"
                         mask="0x00000007"
                         name="DSJW"/>
               <bitfield caption="Data Time Segment After Sample Point"
                         mask="0x000000F0"
                         name="DTSEG2"/>
               <bitfield caption="Data Time Segment Before Sample Point"
                         mask="0x00001F00"
                         name="DTSEG1"/>
               <bitfield caption="Data Bit Rate Prescaler" mask="0x001F0000" name="DBRP"/>
               <bitfield caption="Transmitter Delay Compensation"
                         mask="0x00800000"
                         name="TDC"
                         values="MCAN_DBTP__TDC"/>
            </register>
            <register caption="Test Register"
                      name="MCAN_TEST"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="Loop Back Mode (read/write)"
                         mask="0x00000010"
                         name="LBCK"
                         values="MCAN_TEST__LBCK"/>
               <bitfield caption="Control of Transmit Pin (read/write)"
                         mask="0x00000060"
                         name="TX"
                         values="MCAN_TEST__TX"/>
               <bitfield caption="Receive Pin (read-only)" mask="0x00000080" name="RX"/>
            </register>
            <register caption="RAM Watchdog Register"
                      name="MCAN_RWD"
                      offset="0x14"
                      rw="RW"
                      size="4">
               <bitfield caption="Watchdog Configuration (read/write)"
                         mask="0x000000FF"
                         name="WDC"/>
               <bitfield caption="Watchdog Value (read-only)" mask="0x0000FF00" name="WDV"/>
            </register>
            <register caption="CC Control Register"
                      name="MCAN_CCCR"
                      offset="0x18"
                      rw="RW"
                      size="4">
               <bitfield caption="Initialization (read/write)"
                         mask="0x00000001"
                         name="INIT"
                         values="MCAN_CCCR__INIT"/>
               <bitfield caption="Configuration Change Enable (read/write, write protection)"
                         mask="0x00000002"
                         name="CCE"
                         values="MCAN_CCCR__CCE"/>
               <bitfield caption="Restricted Operation Mode (read/write, write protection against '1')"
                         mask="0x00000004"
                         name="ASM"
                         values="MCAN_CCCR__ASM"/>
               <bitfield caption="Clock Stop Acknowledge (read-only)"
                         mask="0x00000008"
                         name="CSA"/>
               <bitfield caption="Clock Stop Request (read/write)"
                         mask="0x00000010"
                         name="CSR"
                         values="MCAN_CCCR__CSR"/>
               <bitfield caption="Bus Monitoring Mode (read/write, write protection against '1')"
                         mask="0x00000020"
                         name="MON"
                         values="MCAN_CCCR__MON"/>
               <bitfield caption="Disable Automatic Retransmission (read/write, write protection)"
                         mask="0x00000040"
                         name="DAR"
                         values="MCAN_CCCR__DAR"/>
               <bitfield caption="Test Mode Enable (read/write, write protection against '1')"
                         mask="0x00000080"
                         name="TEST"
                         values="MCAN_CCCR__TEST"/>
               <bitfield caption="CAN FD Operation Enable (read/write, write protection)"
                         mask="0x00000100"
                         name="FDOE"
                         values="MCAN_CCCR__FDOE"/>
               <bitfield caption="Bit Rate Switching Enable (read/write, write protection)"
                         mask="0x00000200"
                         name="BRSE"
                         values="MCAN_CCCR__BRSE"/>
               <bitfield caption="Protocol Exception Event Handling (read/write, write protection)"
                         mask="0x00001000"
                         name="PXHD"/>
               <bitfield caption="Edge Filtering during Bus Integration (read/write, write protection)"
                         mask="0x00002000"
                         name="EFBI"/>
               <bitfield caption="Transmit Pause (read/write, write protection)"
                         mask="0x00004000"
                         name="TXP"/>
               <bitfield caption="Non-ISO Operation" mask="0x00008000" name="NISO"/>
            </register>
            <register caption="Nominal Bit Timing and Prescaler Register"
                      name="MCAN_NBTP"
                      offset="0x1C"
                      rw="RW"
                      size="4">
               <bitfield caption="Nominal Time Segment After Sample Point"
                         mask="0x0000007F"
                         name="NTSEG2"/>
               <bitfield caption="Nominal Time Segment Before Sample Point"
                         mask="0x0000FF00"
                         name="NTSEG1"/>
               <bitfield caption="Nominal Bit Rate Prescaler" mask="0x01FF0000" name="NBRP"/>
               <bitfield caption="Nominal (Re) Synchronization Jump Width"
                         mask="0xFE000000"
                         name="NSJW"/>
            </register>
            <register caption="Timestamp Counter Configuration Register"
                      name="MCAN_TSCC"
                      offset="0x20"
                      rw="RW"
                      size="4">
               <bitfield caption="Timestamp Select"
                         mask="0x00000003"
                         name="TSS"
                         values="MCAN_TSCC__TSS"/>
               <bitfield caption="Timestamp Counter Prescaler" mask="0x000F0000" name="TCP"/>
            </register>
            <register caption="Timestamp Counter Value Register"
                      name="MCAN_TSCV"
                      offset="0x24"
                      rw="RW"
                      size="4">
               <bitfield caption="Timestamp Counter (cleared on write)"
                         mask="0x0000FFFF"
                         name="TSC"/>
            </register>
            <register caption="Timeout Counter Configuration Register"
                      name="MCAN_TOCC"
                      offset="0x28"
                      rw="RW"
                      size="4">
               <bitfield caption="Enable Timeout Counter"
                         mask="0x00000001"
                         name="ETOC"
                         values="MCAN_TOCC__ETOC"/>
               <bitfield caption="Timeout Select"
                         mask="0x00000006"
                         name="TOS"
                         values="MCAN_TOCC__TOS"/>
               <bitfield caption="Timeout Period" mask="0xFFFF0000" name="TOP"/>
            </register>
            <register caption="Timeout Counter Value Register"
                      name="MCAN_TOCV"
                      offset="0x2C"
                      rw="RW"
                      size="4">
               <bitfield caption="Timeout Counter (cleared on write)"
                         mask="0x0000FFFF"
                         name="TOC"/>
            </register>
            <register caption="Error Counter Register"
                      name="MCAN_ECR"
                      offset="0x40"
                      rw="R"
                      size="4">
               <bitfield caption="Transmit Error Counter" mask="0x000000FF" name="TEC"/>
               <bitfield caption="Receive Error Counter" mask="0x00007F00" name="REC"/>
               <bitfield caption="Receive Error Passive" mask="0x00008000" name="RP"/>
               <bitfield caption="CAN Error Logging (cleared on read)"
                         mask="0x00FF0000"
                         name="CEL"/>
            </register>
            <register caption="Protocol Status Register"
                      name="MCAN_PSR"
                      offset="0x44"
                      rw="R"
                      size="4">
               <bitfield caption="Last Error Code (set to 111 on read)"
                         mask="0x00000007"
                         name="LEC"
                         values="MCAN_PSR__LEC"/>
               <bitfield caption="Activity"
                         mask="0x00000018"
                         name="ACT"
                         values="MCAN_PSR__ACT"/>
               <bitfield caption="Error Passive" mask="0x00000020" name="EP"/>
               <bitfield caption="Warning Status" mask="0x00000040" name="EW"/>
               <bitfield caption="Bus_Off Status" mask="0x00000080" name="BO"/>
               <bitfield caption="Data Phase Last Error Code (set to 111 on read)"
                         mask="0x00000700"
                         name="DLEC"/>
               <bitfield caption="ESI Flag of Last Received CAN FD Message (cleared on read)"
                         mask="0x00000800"
                         name="RESI"/>
               <bitfield caption="BRS Flag of Last Received CAN FD Message (cleared on read)"
                         mask="0x00001000"
                         name="RBRS"/>
               <bitfield caption="Received a CAN FD Message (cleared on read)"
                         mask="0x00002000"
                         name="RFDF"/>
               <bitfield caption="Protocol Exception Event (cleared on read)"
                         mask="0x00004000"
                         name="PXE"/>
               <bitfield caption="Transmitter Delay Compensation Value"
                         mask="0x007F0000"
                         name="TDCV"/>
            </register>
            <register caption="Transmit Delay Compensation Register"
                      name="MCAN_TDCR"
                      offset="0x48"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmitter Delay Compensation Filter"
                         mask="0x0000007F"
                         name="TDCF"/>
               <bitfield caption="Transmitter Delay Compensation Offset"
                         mask="0x00007F00"
                         name="TDCO"/>
            </register>
