Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Receive Rx Buffer Configuration Register"
                      name="MCAN_RXBC"
                      offset="0xAC"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive Buffer Start Address"
                         mask="0x0000FFFC"
                         name="RBSA"/>
            </register>
            <register caption="Receive FIFO 1 Configuration Register"
                      name="MCAN_RXF1C"
                      offset="0xB0"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 1 Start Address"
                         mask="0x0000FFFC"
                         name="F1SA"/>
               <bitfield caption="Receive FIFO 1 Start Address" mask="0x007F0000" name="F1S"/>
               <bitfield caption="Receive FIFO 1 Watermark" mask="0x7F000000" name="F1WM"/>
               <bitfield caption="FIFO 1 Operation Mode" mask="0x80000000" name="F1OM"/>
            </register>
            <register caption="Receive FIFO 1 Status Register"
                      name="MCAN_RXF1S"
                      offset="0xB4"
                      rw="R"
                      size="4">
               <bitfield caption="Receive FIFO 1 Fill Level" mask="0x0000007F" name="F1FL"/>
               <bitfield caption="Receive FIFO 1 Get Index" mask="0x00003F00" name="F1GI"/>
               <bitfield caption="Receive FIFO 1 Put Index" mask="0x003F0000" name="F1PI"/>
               <bitfield caption="Receive FIFO 1 Fill Level" mask="0x01000000" name="F1F"/>
               <bitfield caption="Receive FIFO 1 Message Lost" mask="0x02000000" name="RF1L"/>
               <bitfield caption="Debug Message Status"
                         mask="0xC0000000"
                         name="DMS"
                         values="MCAN_RXF1S__DMS"/>
            </register>
            <register caption="Receive FIFO 1 Acknowledge Register"
                      name="MCAN_RXF1A"
                      offset="0xB8"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 1 Acknowledge Index"
                         mask="0x0000003F"
                         name="F1AI"/>
            </register>
            <register caption="Receive Buffer / FIFO Element Size Configuration Register"
                      name="MCAN_RXESC"
                      offset="0xBC"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 0 Data Field Size"
                         mask="0x00000007"
                         name="F0DS"
                         values="MCAN_RXESC__F0DS"/>
               <bitfield caption="Receive FIFO 1 Data Field Size"
                         mask="0x00000070"
                         name="F1DS"
                         values="MCAN_RXESC__F1DS"/>
               <bitfield caption="Receive Buffer Data Field Size"
                         mask="0x00000700"
                         name="RBDS"
                         values="MCAN_RXESC__RBDS"/>
            </register>
            <register caption="Transmit Buffer Configuration Register"
                      name="MCAN_TXBC"
                      offset="0xC0"
                      rw="RW"
                      size="4">
               <bitfield caption="Tx Buffers Start Address" mask="0x0000FFFC" name="TBSA"/>
               <bitfield caption="Number of Dedicated Transmit Buffers"
                         mask="0x003F0000"
                         name="NDTB"/>
               <bitfield caption="Transmit FIFO/Queue Size" mask="0x3F000000" name="TFQS"/>
               <bitfield caption="Tx FIFO/Queue Mode" mask="0x40000000" name="TFQM"/>
            </register>
            <register caption="Transmit FIFO/Queue Status Register"
                      name="MCAN_TXFQS"
                      offset="0xC4"
                      rw="R"
                      size="4">
               <bitfield caption="Tx FIFO Free Level" mask="0x0000003F" name="TFFL"/>
               <bitfield caption="Tx FIFO Get Index" mask="0x00001F00" name="TFGI"/>
               <bitfield caption="Tx FIFO/Queue Put Index" mask="0x001F0000" name="TFQPI"/>
               <bitfield caption="Tx FIFO/Queue Full" mask="0x00200000" name="TFQF"/>
            </register>
            <register caption="Transmit Buffer Element Size Configuration Register"
                      name="MCAN_TXESC"
                      offset="0xC8"
                      rw="RW"
                      size="4">
               <bitfield caption="Tx Buffer Data Field Size"
                         mask="0x00000007"
                         name="TBDS"
                         values="MCAN_TXESC__TBDS"/>
            </register>
            <register caption="Transmit Buffer Request Pending Register"
                      name="MCAN_TXBRP"
                      offset="0xCC"
                      rw="R"
                      size="4">
               <bitfield caption="Transmission Request Pending for Buffer 0"
                         mask="0x00000001"
                         name="TRP0"/>
               <bitfield caption="Transmission Request Pending for Buffer 1"
                         mask="0x00000002"
                         name="TRP1"/>
               <bitfield caption="Transmission Request Pending for Buffer 2"
                         mask="0x00000004"
                         name="TRP2"/>
               <bitfield caption="Transmission Request Pending for Buffer 3"
                         mask="0x00000008"
                         name="TRP3"/>
               <bitfield caption="Transmission Request Pending for Buffer 4"
                         mask="0x00000010"
                         name="TRP4"/>
               <bitfield caption="Transmission Request Pending for Buffer 5"
                         mask="0x00000020"
                         name="TRP5"/>
               <bitfield caption="Transmission Request Pending for Buffer 6"
                         mask="0x00000040"
                         name="TRP6"/>
               <bitfield caption="Transmission Request Pending for Buffer 7"
                         mask="0x00000080"
                         name="TRP7"/>
               <bitfield caption="Transmission Request Pending for Buffer 8"
                         mask="0x00000100"
                         name="TRP8"/>
               <bitfield caption="Transmission Request Pending for Buffer 9"
                         mask="0x00000200"
                         name="TRP9"/>
               <bitfield caption="Transmission Request Pending for Buffer 10"
                         mask="0x00000400"
                         name="TRP10"/>
               <bitfield caption="Transmission Request Pending for Buffer 11"
                         mask="0x00000800"
                         name="TRP11"/>
               <bitfield caption="Transmission Request Pending for Buffer 12"
                         mask="0x00001000"
                         name="TRP12"/>
               <bitfield caption="Transmission Request Pending for Buffer 13"
                         mask="0x00002000"
                         name="TRP13"/>
               <bitfield caption="Transmission Request Pending for Buffer 14"
                         mask="0x00004000"
                         name="TRP14"/>
               <bitfield caption="Transmission Request Pending for Buffer 15"
                         mask="0x00008000"
                         name="TRP15"/>
               <bitfield caption="Transmission Request Pending for Buffer 16"
                         mask="0x00010000"
                         name="TRP16"/>
               <bitfield caption="Transmission Request Pending for Buffer 17"
                         mask="0x00020000"
                         name="TRP17"/>
               <bitfield caption="Transmission Request Pending for Buffer 18"
                         mask="0x00040000"
                         name="TRP18"/>
               <bitfield caption="Transmission Request Pending for Buffer 19"
                         mask="0x00080000"
                         name="TRP19"/>
               <bitfield caption="Transmission Request Pending for Buffer 20"
                         mask="0x00100000"
                         name="TRP20"/>
               <bitfield caption="Transmission Request Pending for Buffer 21"
                         mask="0x00200000"
                         name="TRP21"/>
               <bitfield caption="Transmission Request Pending for Buffer 22"
                         mask="0x00400000"
                         name="TRP22"/>
               <bitfield caption="Transmission Request Pending for Buffer 23"
                         mask="0x00800000"
                         name="TRP23"/>
               <bitfield caption="Transmission Request Pending for Buffer 24"
                         mask="0x01000000"
                         name="TRP24"/>
               <bitfield caption="Transmission Request Pending for Buffer 25"
                         mask="0x02000000"
                         name="TRP25"/>
               <bitfield caption="Transmission Request Pending for Buffer 26"
                         mask="0x04000000"
                         name="TRP26"/>
               <bitfield caption="Transmission Request Pending for Buffer 27"
                         mask="0x08000000"
                         name="TRP27"/>
               <bitfield caption="Transmission Request Pending for Buffer 28"
                         mask="0x10000000"
                         name="TRP28"/>
               <bitfield caption="Transmission Request Pending for Buffer 29"
                         mask="0x20000000"
                         name="TRP29"/>
               <bitfield caption="Transmission Request Pending for Buffer 30"
                         mask="0x40000000"
                         name="TRP30"/>
               <bitfield caption="Transmission Request Pending for Buffer 31"
                         mask="0x80000000"
                         name="TRP31"/>
            </register>
            <register caption="Transmit Buffer Add Request Register"
                      name="MCAN_TXBAR"
                      offset="0xD0"
                      rw="RW"
                      size="4">
               <bitfield caption="Add Request for Transmit Buffer 0"
                         mask="0x00000001"
                         name="AR0"/>
               <bitfield caption="Add Request for Transmit Buffer 1"
                         mask="0x00000002"
                         name="AR1"/>
               <bitfield caption="Add Request for Transmit Buffer 2"
                         mask="0x00000004"
                         name="AR2"/>
               <bitfield caption="Add Request for Transmit Buffer 3"
                         mask="0x00000008"
                         name="AR3"/>
               <bitfield caption="Add Request for Transmit Buffer 4"
                         mask="0x00000010"
                         name="AR4"/>
               <bitfield caption="Add Request for Transmit Buffer 5"
                         mask="0x00000020"
                         name="AR5"/>
               <bitfield caption="Add Request for Transmit Buffer 6"
                         mask="0x00000040"
                         name="AR6"/>
               <bitfield caption="Add Request for Transmit Buffer 7"
                         mask="0x00000080"
                         name="AR7"/>
               <bitfield caption="Add Request for Transmit Buffer 8"
                         mask="0x00000100"
                         name="AR8"/>
               <bitfield caption="Add Request for Transmit Buffer 9"
                         mask="0x00000200"
                         name="AR9"/>
               <bitfield caption="Add Request for Transmit Buffer 10"
                         mask="0x00000400"
                         name="AR10"/>
               <bitfield caption="Add Request for Transmit Buffer 11"
                         mask="0x00000800"
                         name="AR11"/>
               <bitfield caption="Add Request for Transmit Buffer 12"
                         mask="0x00001000"
                         name="AR12"/>
               <bitfield caption="Add Request for Transmit Buffer 13"
                         mask="0x00002000"
                         name="AR13"/>
               <bitfield caption="Add Request for Transmit Buffer 14"
                         mask="0x00004000"
                         name="AR14"/>
               <bitfield caption="Add Request for Transmit Buffer 15"
                         mask="0x00008000"
                         name="AR15"/>
               <bitfield caption="Add Request for Transmit Buffer 16"
                         mask="0x00010000"
                         name="AR16"/>
               <bitfield caption="Add Request for Transmit Buffer 17"
                         mask="0x00020000"
                         name="AR17"/>
               <bitfield caption="Add Request for Transmit Buffer 18"
                         mask="0x00040000"
                         name="AR18"/>
               <bitfield caption="Add Request for Transmit Buffer 19"
                         mask="0x00080000"
                         name="AR19"/>
               <bitfield caption="Add Request for Transmit Buffer 20"
                         mask="0x00100000"
                         name="AR20"/>
               <bitfield caption="Add Request for Transmit Buffer 21"
                         mask="0x00200000"
                         name="AR21"/>
               <bitfield caption="Add Request for Transmit Buffer 22"
                         mask="0x00400000"
                         name="AR22"/>
               <bitfield caption="Add Request for Transmit Buffer 23"
                         mask="0x00800000"
                         name="AR23"/>
               <bitfield caption="Add Request for Transmit Buffer 24"
                         mask="0x01000000"
                         name="AR24"/>
               <bitfield caption="Add Request for Transmit Buffer 25"
                         mask="0x02000000"
                         name="AR25"/>
               <bitfield caption="Add Request for Transmit Buffer 26"
                         mask="0x04000000"
                         name="AR26"/>
               <bitfield caption="Add Request for Transmit Buffer 27"
                         mask="0x08000000"
                         name="AR27"/>
               <bitfield caption="Add Request for Transmit Buffer 28"
                         mask="0x10000000"
                         name="AR28"/>
               <bitfield caption="Add Request for Transmit Buffer 29"
                         mask="0x20000000"
                         name="AR29"/>
               <bitfield caption="Add Request for Transmit Buffer 30"
                         mask="0x40000000"
                         name="AR30"/>
               <bitfield caption="Add Request for Transmit Buffer 31"
                         mask="0x80000000"
                         name="AR31"/>
            </register>
            <register caption="Transmit Buffer Cancellation Request Register"
                      name="MCAN_TXBCR"
                      offset="0xD4"
                      rw="RW"
                      size="4">
               <bitfield caption="Cancellation Request for Transmit Buffer 0"
                         mask="0x00000001"
                         name="CR0"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 1"
                         mask="0x00000002"
                         name="CR1"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 2"
                         mask="0x00000004"
                         name="CR2"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 3"
                         mask="0x00000008"
                         name="CR3"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 4"
                         mask="0x00000010"
                         name="CR4"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 5"
                         mask="0x00000020"
                         name="CR5"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 6"
                         mask="0x00000040"
                         name="CR6"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 7"
                         mask="0x00000080"
                         name="CR7"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 8"
                         mask="0x00000100"
                         name="CR8"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 9"
                         mask="0x00000200"
                         name="CR9"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 10"
                         mask="0x00000400"
                         name="CR10"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 11"
                         mask="0x00000800"
                         name="CR11"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 12"
                         mask="0x00001000"
                         name="CR12"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 13"
                         mask="0x00002000"
                         name="CR13"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 14"
                         mask="0x00004000"
                         name="CR14"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 15"
                         mask="0x00008000"
                         name="CR15"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 16"
                         mask="0x00010000"
                         name="CR16"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 17"
                         mask="0x00020000"
                         name="CR17"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 18"
                         mask="0x00040000"
                         name="CR18"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 19"
                         mask="0x00080000"
                         name="CR19"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 20"
                         mask="0x00100000"
                         name="CR20"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 21"
                         mask="0x00200000"
                         name="CR21"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 22"
                         mask="0x00400000"
                         name="CR22"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 23"
                         mask="0x00800000"
                         name="CR23"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 24"
                         mask="0x01000000"
                         name="CR24"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 25"
                         mask="0x02000000"
                         name="CR25"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 26"
                         mask="0x04000000"
                         name="CR26"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 27"
                         mask="0x08000000"
                         name="CR27"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 28"
                         mask="0x10000000"
                         name="CR28"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 29"
                         mask="0x20000000"
                         name="CR29"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 30"
                         mask="0x40000000"
                         name="CR30"/>
               <bitfield caption="Cancellation Request for Transmit Buffer 31"
                         mask="0x80000000"
                         name="CR31"/>
            </register>
