Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Transmit Buffer Transmission Occurred Register"
                      name="MCAN_TXBTO"
                      offset="0xD8"
                      rw="R"
                      size="4">
               <bitfield caption="Transmission Occurred for Buffer 0"
                         mask="0x00000001"
                         name="TO0"/>
               <bitfield caption="Transmission Occurred for Buffer 1"
                         mask="0x00000002"
                         name="TO1"/>
               <bitfield caption="Transmission Occurred for Buffer 2"
                         mask="0x00000004"
                         name="TO2"/>
               <bitfield caption="Transmission Occurred for Buffer 3"
                         mask="0x00000008"
                         name="TO3"/>
               <bitfield caption="Transmission Occurred for Buffer 4"
                         mask="0x00000010"
                         name="TO4"/>
               <bitfield caption="Transmission Occurred for Buffer 5"
                         mask="0x00000020"
                         name="TO5"/>
               <bitfield caption="Transmission Occurred for Buffer 6"
                         mask="0x00000040"
                         name="TO6"/>
               <bitfield caption="Transmission Occurred for Buffer 7"
                         mask="0x00000080"
                         name="TO7"/>
               <bitfield caption="Transmission Occurred for Buffer 8"
                         mask="0x00000100"
                         name="TO8"/>
               <bitfield caption="Transmission Occurred for Buffer 9"
                         mask="0x00000200"
                         name="TO9"/>
               <bitfield caption="Transmission Occurred for Buffer 10"
                         mask="0x00000400"
                         name="TO10"/>
               <bitfield caption="Transmission Occurred for Buffer 11"
                         mask="0x00000800"
                         name="TO11"/>
               <bitfield caption="Transmission Occurred for Buffer 12"
                         mask="0x00001000"
                         name="TO12"/>
               <bitfield caption="Transmission Occurred for Buffer 13"
                         mask="0x00002000"
                         name="TO13"/>
               <bitfield caption="Transmission Occurred for Buffer 14"
                         mask="0x00004000"
                         name="TO14"/>
               <bitfield caption="Transmission Occurred for Buffer 15"
                         mask="0x00008000"
                         name="TO15"/>
               <bitfield caption="Transmission Occurred for Buffer 16"
                         mask="0x00010000"
                         name="TO16"/>
               <bitfield caption="Transmission Occurred for Buffer 17"
                         mask="0x00020000"
                         name="TO17"/>
               <bitfield caption="Transmission Occurred for Buffer 18"
                         mask="0x00040000"
                         name="TO18"/>
               <bitfield caption="Transmission Occurred for Buffer 19"
                         mask="0x00080000"
                         name="TO19"/>
               <bitfield caption="Transmission Occurred for Buffer 20"
                         mask="0x00100000"
                         name="TO20"/>
               <bitfield caption="Transmission Occurred for Buffer 21"
                         mask="0x00200000"
                         name="TO21"/>
               <bitfield caption="Transmission Occurred for Buffer 22"
                         mask="0x00400000"
                         name="TO22"/>
               <bitfield caption="Transmission Occurred for Buffer 23"
                         mask="0x00800000"
                         name="TO23"/>
               <bitfield caption="Transmission Occurred for Buffer 24"
                         mask="0x01000000"
                         name="TO24"/>
               <bitfield caption="Transmission Occurred for Buffer 25"
                         mask="0x02000000"
                         name="TO25"/>
               <bitfield caption="Transmission Occurred for Buffer 26"
                         mask="0x04000000"
                         name="TO26"/>
               <bitfield caption="Transmission Occurred for Buffer 27"
                         mask="0x08000000"
                         name="TO27"/>
               <bitfield caption="Transmission Occurred for Buffer 28"
                         mask="0x10000000"
                         name="TO28"/>
               <bitfield caption="Transmission Occurred for Buffer 29"
                         mask="0x20000000"
                         name="TO29"/>
               <bitfield caption="Transmission Occurred for Buffer 30"
                         mask="0x40000000"
                         name="TO30"/>
               <bitfield caption="Transmission Occurred for Buffer 31"
                         mask="0x80000000"
                         name="TO31"/>
            </register>
            <register caption="Transmit Buffer Cancellation Finished Register"
                      name="MCAN_TXBCF"
                      offset="0xDC"
                      rw="R"
                      size="4">
               <bitfield caption="Cancellation Finished for Transmit Buffer 0"
                         mask="0x00000001"
                         name="CF0"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 1"
                         mask="0x00000002"
                         name="CF1"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 2"
                         mask="0x00000004"
                         name="CF2"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 3"
                         mask="0x00000008"
                         name="CF3"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 4"
                         mask="0x00000010"
                         name="CF4"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 5"
                         mask="0x00000020"
                         name="CF5"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 6"
                         mask="0x00000040"
                         name="CF6"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 7"
                         mask="0x00000080"
                         name="CF7"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 8"
                         mask="0x00000100"
                         name="CF8"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 9"
                         mask="0x00000200"
                         name="CF9"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 10"
                         mask="0x00000400"
                         name="CF10"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 11"
                         mask="0x00000800"
                         name="CF11"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 12"
                         mask="0x00001000"
                         name="CF12"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 13"
                         mask="0x00002000"
                         name="CF13"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 14"
                         mask="0x00004000"
                         name="CF14"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 15"
                         mask="0x00008000"
                         name="CF15"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 16"
                         mask="0x00010000"
                         name="CF16"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 17"
                         mask="0x00020000"
                         name="CF17"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 18"
                         mask="0x00040000"
                         name="CF18"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 19"
                         mask="0x00080000"
                         name="CF19"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 20"
                         mask="0x00100000"
                         name="CF20"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 21"
                         mask="0x00200000"
                         name="CF21"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 22"
                         mask="0x00400000"
                         name="CF22"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 23"
                         mask="0x00800000"
                         name="CF23"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 24"
                         mask="0x01000000"
                         name="CF24"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 25"
                         mask="0x02000000"
                         name="CF25"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 26"
                         mask="0x04000000"
                         name="CF26"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 27"
                         mask="0x08000000"
                         name="CF27"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 28"
                         mask="0x10000000"
                         name="CF28"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 29"
                         mask="0x20000000"
                         name="CF29"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 30"
                         mask="0x40000000"
                         name="CF30"/>
               <bitfield caption="Cancellation Finished for Transmit Buffer 31"
                         mask="0x80000000"
                         name="CF31"/>
            </register>
            <register caption="Transmit Buffer Transmission Interrupt Enable Register"
                      name="MCAN_TXBTIE"
                      offset="0xE0"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmission Interrupt Enable for Buffer 0"
                         mask="0x00000001"
                         name="TIE0"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 1"
                         mask="0x00000002"
                         name="TIE1"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 2"
                         mask="0x00000004"
                         name="TIE2"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 3"
                         mask="0x00000008"
                         name="TIE3"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 4"
                         mask="0x00000010"
                         name="TIE4"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 5"
                         mask="0x00000020"
                         name="TIE5"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 6"
                         mask="0x00000040"
                         name="TIE6"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 7"
                         mask="0x00000080"
                         name="TIE7"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 8"
                         mask="0x00000100"
                         name="TIE8"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 9"
                         mask="0x00000200"
                         name="TIE9"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 10"
                         mask="0x00000400"
                         name="TIE10"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 11"
                         mask="0x00000800"
                         name="TIE11"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 12"
                         mask="0x00001000"
                         name="TIE12"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 13"
                         mask="0x00002000"
                         name="TIE13"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 14"
                         mask="0x00004000"
                         name="TIE14"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 15"
                         mask="0x00008000"
                         name="TIE15"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 16"
                         mask="0x00010000"
                         name="TIE16"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 17"
                         mask="0x00020000"
                         name="TIE17"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 18"
                         mask="0x00040000"
                         name="TIE18"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 19"
                         mask="0x00080000"
                         name="TIE19"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 20"
                         mask="0x00100000"
                         name="TIE20"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 21"
                         mask="0x00200000"
                         name="TIE21"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 22"
                         mask="0x00400000"
                         name="TIE22"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 23"
                         mask="0x00800000"
                         name="TIE23"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 24"
                         mask="0x01000000"
                         name="TIE24"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 25"
                         mask="0x02000000"
                         name="TIE25"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 26"
                         mask="0x04000000"
                         name="TIE26"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 27"
                         mask="0x08000000"
                         name="TIE27"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 28"
                         mask="0x10000000"
                         name="TIE28"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 29"
                         mask="0x20000000"
                         name="TIE29"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 30"
                         mask="0x40000000"
                         name="TIE30"/>
               <bitfield caption="Transmission Interrupt Enable for Buffer 31"
                         mask="0x80000000"
                         name="TIE31"/>
            </register>
