Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="MediaLB Interrupt Enable Register"
                      name="MLB_MIEN"
                      offset="0x02C"
                      rw="RW"
                      size="4">
               <bitfield caption="Isochronous Rx Protocol Error Enable"
                         mask="0x00000001"
                         name="ISOC_PE"/>
               <bitfield caption="Isochronous Rx Buffer Overflow Enable"
                         mask="0x00000002"
                         name="ISOC_BUFO"/>
               <bitfield caption="Synchronous Protocol Error Enable"
                         mask="0x00010000"
                         name="SYNC_PE"/>
               <bitfield caption="Asynchronous Rx Done Enable"
                         mask="0x00020000"
                         name="ARX_DONE"/>
               <bitfield caption="Asynchronous Rx Protocol Error Enable"
                         mask="0x00040000"
                         name="ARX_PE"/>
               <bitfield caption="Asynchronous Rx Break Enable"
                         mask="0x00080000"
                         name="ARX_BREAK"/>
               <bitfield caption="Asynchronous Tx Packet Done Enable"
                         mask="0x00100000"
                         name="ATX_DONE"/>
               <bitfield caption="Asynchronous Tx Protocol Error Enable"
                         mask="0x00200000"
                         name="ATX_PE"/>
               <bitfield caption="Asynchronous Tx Break Enable"
                         mask="0x00400000"
                         name="ATX_BREAK"/>
               <bitfield caption="Control Rx Packet Done Enable"
                         mask="0x01000000"
                         name="CRX_DONE"/>
               <bitfield caption="Control Rx Protocol Error Enable"
                         mask="0x02000000"
                         name="CRX_PE"/>
               <bitfield caption="Control Rx Break Enable"
                         mask="0x04000000"
                         name="CRX_BREAK"/>
               <bitfield caption="Control Tx Packet Done Enable"
                         mask="0x08000000"
                         name="CTX_DONE"/>
               <bitfield caption="Control Tx Protocol Error Enable"
                         mask="0x10000000"
                         name="CTX_PE"/>
               <bitfield caption="Control Tx Break Enable"
                         mask="0x20000000"
                         name="CTX_BREAK"/>
            </register>
            <register caption="MediaLB Control 1 Register"
                      name="MLB_MLBC1"
                      offset="0x03C"
                      rw="RW"
                      size="4">
               <bitfield caption="MediaLB Lock Error Status (cleared by writing a 0)"
                         mask="0x00000040"
                         name="LOCK"/>
               <bitfield caption="MediaLB Clock Missing Status (cleared by writing a 0)"
                         mask="0x00000080"
                         name="CLKM"/>
               <bitfield caption="Node Device Address" mask="0x0000FF00" name="NDA"/>
            </register>
            <register caption="HBI Control Register"
                      name="MLB_HCTL"
                      offset="0x080"
                      rw="RW"
                      size="4">
               <bitfield caption="Address Generation Unit 0 Software Reset"
                         mask="0x00000001"
                         name="RST0"/>
               <bitfield caption="Address Generation Unit 1 Software Reset"
                         mask="0x00000002"
                         name="RST1"/>
               <bitfield caption="HBI Enable" mask="0x00008000" name="EN"/>
            </register>
            <register caption="HBI Channel Mask 0 Register 0"
                      name="MLB_HCMR"
                      offset="0x88"
                      rw="RW"
                      size="4"
                      count="2">
               <bitfield caption="Bitwise Channel Mask Bit [31:0]"
                         mask="0xFFFFFFFF"
                         name="CHM"/>
            </register>
            <register caption="HBI Channel Error 0 Register 0"
                      name="MLB_HCER"
                      offset="0x90"
                      rw="R"
                      size="4"
                      count="2">
               <bitfield caption="Bitwise Channel Error Bit [31:0]"
                         mask="0xFFFFFFFF"
                         name="CERR"/>
            </register>
            <register caption="HBI Channel Busy 0 Register 0"
                      name="MLB_HCBR"
                      offset="0x98"
                      rw="R"
                      size="4"
                      count="2">
               <bitfield caption="Bitwise Channel Busy Bit [31:0]"
                         mask="0xFFFFFFFF"
                         name="CHB"/>
            </register>
            <register caption="MIF Data 0 Register 0"
                      name="MLB_MDAT"
                      offset="0xC0"
                      rw="RW"
                      size="4"
                      count="4">
               <bitfield caption="CRT or DBR Data" mask="0xFFFFFFFF" name="DATA"/>
            </register>
            <register caption="MIF Data Write Enable 0 Register 0"
                      name="MLB_MDWE"
                      offset="0xD0"
                      rw="RW"
                      size="4"
                      count="4">
               <bitfield caption="Bitwise Write Enable for CTR Data - bits[31:0]"
                         mask="0xFFFFFFFF"
                         name="MASK"/>
            </register>
            <register caption="MIF Control Register"
                      name="MLB_MCTL"
                      offset="0x0E0"
                      rw="RW"
                      size="4">
               <bitfield caption="Transfer Complete (Write 0 to Clear)"
                         mask="0x00000001"
                         name="XCMP"/>
            </register>
