Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="PIO Disable Register"
                      name="PIO_PDR"
                      offset="0x0004"
                      rw="W"
                      size="4"
                      atomic-op="clear:PIO_PSR">
               <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
               <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
               <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
               <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
               <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
               <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
               <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
               <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
               <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
               <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
               <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
               <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
               <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
               <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
               <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
               <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
               <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
               <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
               <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
               <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
               <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
               <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
               <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
               <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
               <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
               <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
               <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
               <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
               <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
               <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
               <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
               <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
            </register>
            <register caption="PIO Status Register"
                      name="PIO_PSR"
                      offset="0x0008"
                      rw="R"
                      size="4">
               <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
               <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
               <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
               <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
               <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
               <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
               <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
               <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
               <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
               <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
               <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
               <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
               <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
               <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
               <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
               <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
               <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
               <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
               <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
               <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
               <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
               <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
               <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
               <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
               <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
               <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
               <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
               <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
               <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
               <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
               <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
               <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Output Enable Register"
                      name="PIO_OER"
                      offset="0x0010"
                      rw="W"
                      size="4"
                      atomic-op="set:PIO_OSR">
               <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
               <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
               <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
               <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
               <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
               <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
               <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
               <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
               <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
               <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
               <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
               <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
               <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
               <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
               <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
               <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
               <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
               <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
               <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
               <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
               <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
               <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
               <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
               <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
               <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
               <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
               <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
               <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
               <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
               <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
               <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
               <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Output Disable Register"
                      name="PIO_ODR"
                      offset="0x0014"
                      rw="W"
                      size="4"
                      atomic-op="clear:PIO_OSR">
               <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
               <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
               <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
               <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
               <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
               <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
               <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
               <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
               <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
               <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
               <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
               <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
               <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
               <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
               <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
               <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
               <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
               <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
               <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
               <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
               <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
               <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
               <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
               <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
               <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
               <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
               <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
               <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
               <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
               <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
               <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
               <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Output Status Register"
                      name="PIO_OSR"
                      offset="0x0018"
                      rw="R"
                      size="4">
               <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
               <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
               <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
               <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
               <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
               <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
               <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
               <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
               <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
               <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
               <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
               <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
               <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
               <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
               <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
               <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
               <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
               <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
               <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
               <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
               <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
               <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
               <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
               <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
               <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
               <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
               <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
               <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
               <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
               <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
               <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
               <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Glitch Input Filter Enable Register"
                      name="PIO_IFER"
                      offset="0x0020"
                      rw="W"
                      size="4"
                      atomic-op="set:PIO_IFSR">
               <bitfield caption="Input Filter Enable" mask="0x00000001" name="P0"/>
               <bitfield caption="Input Filter Enable" mask="0x00000002" name="P1"/>
               <bitfield caption="Input Filter Enable" mask="0x00000004" name="P2"/>
               <bitfield caption="Input Filter Enable" mask="0x00000008" name="P3"/>
               <bitfield caption="Input Filter Enable" mask="0x00000010" name="P4"/>
               <bitfield caption="Input Filter Enable" mask="0x00000020" name="P5"/>
               <bitfield caption="Input Filter Enable" mask="0x00000040" name="P6"/>
               <bitfield caption="Input Filter Enable" mask="0x00000080" name="P7"/>
               <bitfield caption="Input Filter Enable" mask="0x00000100" name="P8"/>
               <bitfield caption="Input Filter Enable" mask="0x00000200" name="P9"/>
               <bitfield caption="Input Filter Enable" mask="0x00000400" name="P10"/>
               <bitfield caption="Input Filter Enable" mask="0x00000800" name="P11"/>
               <bitfield caption="Input Filter Enable" mask="0x00001000" name="P12"/>
               <bitfield caption="Input Filter Enable" mask="0x00002000" name="P13"/>
               <bitfield caption="Input Filter Enable" mask="0x00004000" name="P14"/>
               <bitfield caption="Input Filter Enable" mask="0x00008000" name="P15"/>
               <bitfield caption="Input Filter Enable" mask="0x00010000" name="P16"/>
               <bitfield caption="Input Filter Enable" mask="0x00020000" name="P17"/>
               <bitfield caption="Input Filter Enable" mask="0x00040000" name="P18"/>
               <bitfield caption="Input Filter Enable" mask="0x00080000" name="P19"/>
               <bitfield caption="Input Filter Enable" mask="0x00100000" name="P20"/>
               <bitfield caption="Input Filter Enable" mask="0x00200000" name="P21"/>
               <bitfield caption="Input Filter Enable" mask="0x00400000" name="P22"/>
               <bitfield caption="Input Filter Enable" mask="0x00800000" name="P23"/>
               <bitfield caption="Input Filter Enable" mask="0x01000000" name="P24"/>
               <bitfield caption="Input Filter Enable" mask="0x02000000" name="P25"/>
               <bitfield caption="Input Filter Enable" mask="0x04000000" name="P26"/>
               <bitfield caption="Input Filter Enable" mask="0x08000000" name="P27"/>
               <bitfield caption="Input Filter Enable" mask="0x10000000" name="P28"/>
               <bitfield caption="Input Filter Enable" mask="0x20000000" name="P29"/>
               <bitfield caption="Input Filter Enable" mask="0x40000000" name="P30"/>
               <bitfield caption="Input Filter Enable" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Glitch Input Filter Disable Register"
                      name="PIO_IFDR"
                      offset="0x0024"
                      rw="W"
                      size="4"
                      atomic-op="clear:PIO_IFSR">
               <bitfield caption="Input Filter Disable" mask="0x00000001" name="P0"/>
               <bitfield caption="Input Filter Disable" mask="0x00000002" name="P1"/>
               <bitfield caption="Input Filter Disable" mask="0x00000004" name="P2"/>
               <bitfield caption="Input Filter Disable" mask="0x00000008" name="P3"/>
               <bitfield caption="Input Filter Disable" mask="0x00000010" name="P4"/>
               <bitfield caption="Input Filter Disable" mask="0x00000020" name="P5"/>
               <bitfield caption="Input Filter Disable" mask="0x00000040" name="P6"/>
               <bitfield caption="Input Filter Disable" mask="0x00000080" name="P7"/>
               <bitfield caption="Input Filter Disable" mask="0x00000100" name="P8"/>
               <bitfield caption="Input Filter Disable" mask="0x00000200" name="P9"/>
               <bitfield caption="Input Filter Disable" mask="0x00000400" name="P10"/>
               <bitfield caption="Input Filter Disable" mask="0x00000800" name="P11"/>
               <bitfield caption="Input Filter Disable" mask="0x00001000" name="P12"/>
               <bitfield caption="Input Filter Disable" mask="0x00002000" name="P13"/>
               <bitfield caption="Input Filter Disable" mask="0x00004000" name="P14"/>
               <bitfield caption="Input Filter Disable" mask="0x00008000" name="P15"/>
               <bitfield caption="Input Filter Disable" mask="0x00010000" name="P16"/>
               <bitfield caption="Input Filter Disable" mask="0x00020000" name="P17"/>
               <bitfield caption="Input Filter Disable" mask="0x00040000" name="P18"/>
               <bitfield caption="Input Filter Disable" mask="0x00080000" name="P19"/>
               <bitfield caption="Input Filter Disable" mask="0x00100000" name="P20"/>
               <bitfield caption="Input Filter Disable" mask="0x00200000" name="P21"/>
               <bitfield caption="Input Filter Disable" mask="0x00400000" name="P22"/>
               <bitfield caption="Input Filter Disable" mask="0x00800000" name="P23"/>
               <bitfield caption="Input Filter Disable" mask="0x01000000" name="P24"/>
               <bitfield caption="Input Filter Disable" mask="0x02000000" name="P25"/>
               <bitfield caption="Input Filter Disable" mask="0x04000000" name="P26"/>
               <bitfield caption="Input Filter Disable" mask="0x08000000" name="P27"/>
               <bitfield caption="Input Filter Disable" mask="0x10000000" name="P28"/>
               <bitfield caption="Input Filter Disable" mask="0x20000000" name="P29"/>
               <bitfield caption="Input Filter Disable" mask="0x40000000" name="P30"/>
               <bitfield caption="Input Filter Disable" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Glitch Input Filter Status Register"
                      name="PIO_IFSR"
                      offset="0x0028"
                      rw="R"
                      size="4">
               <bitfield caption="Input Filter Status" mask="0x00000001" name="P0"/>
               <bitfield caption="Input Filter Status" mask="0x00000002" name="P1"/>
               <bitfield caption="Input Filter Status" mask="0x00000004" name="P2"/>
               <bitfield caption="Input Filter Status" mask="0x00000008" name="P3"/>
               <bitfield caption="Input Filter Status" mask="0x00000010" name="P4"/>
               <bitfield caption="Input Filter Status" mask="0x00000020" name="P5"/>
               <bitfield caption="Input Filter Status" mask="0x00000040" name="P6"/>
               <bitfield caption="Input Filter Status" mask="0x00000080" name="P7"/>
               <bitfield caption="Input Filter Status" mask="0x00000100" name="P8"/>
               <bitfield caption="Input Filter Status" mask="0x00000200" name="P9"/>
               <bitfield caption="Input Filter Status" mask="0x00000400" name="P10"/>
               <bitfield caption="Input Filter Status" mask="0x00000800" name="P11"/>
               <bitfield caption="Input Filter Status" mask="0x00001000" name="P12"/>
               <bitfield caption="Input Filter Status" mask="0x00002000" name="P13"/>
               <bitfield caption="Input Filter Status" mask="0x00004000" name="P14"/>
               <bitfield caption="Input Filter Status" mask="0x00008000" name="P15"/>
               <bitfield caption="Input Filter Status" mask="0x00010000" name="P16"/>
               <bitfield caption="Input Filter Status" mask="0x00020000" name="P17"/>
               <bitfield caption="Input Filter Status" mask="0x00040000" name="P18"/>
               <bitfield caption="Input Filter Status" mask="0x00080000" name="P19"/>
               <bitfield caption="Input Filter Status" mask="0x00100000" name="P20"/>
               <bitfield caption="Input Filter Status" mask="0x00200000" name="P21"/>
               <bitfield caption="Input Filter Status" mask="0x00400000" name="P22"/>
               <bitfield caption="Input Filter Status" mask="0x00800000" name="P23"/>
               <bitfield caption="Input Filter Status" mask="0x01000000" name="P24"/>
               <bitfield caption="Input Filter Status" mask="0x02000000" name="P25"/>
               <bitfield caption="Input Filter Status" mask="0x04000000" name="P26"/>
               <bitfield caption="Input Filter Status" mask="0x08000000" name="P27"/>
               <bitfield caption="Input Filter Status" mask="0x10000000" name="P28"/>
               <bitfield caption="Input Filter Status" mask="0x20000000" name="P29"/>
               <bitfield caption="Input Filter Status" mask="0x40000000" name="P30"/>
               <bitfield caption="Input Filter Status" mask="0x80000000" name="P31"/>
            </register>
