Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Edge/Level Status Register"
                      name="PIO_ELSR"
                      offset="0x00C8"
                      rw="R"
                      size="4">
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000001"
                         name="P0"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000002"
                         name="P1"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000004"
                         name="P2"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000008"
                         name="P3"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000010"
                         name="P4"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000020"
                         name="P5"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000040"
                         name="P6"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000080"
                         name="P7"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000100"
                         name="P8"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000200"
                         name="P9"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Edge/Level Interrupt Source Selection"
                         mask="0x80000000"
                         name="P31"/>
            </register>
            <register caption="Falling Edge/Low-Level Select Register"
                      name="PIO_FELLSR"
                      offset="0x00D0"
                      rw="W"
                      size="4"
                      atomic-op="clear:PIO_FRLHSR">
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000001"
                         name="P0"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000002"
                         name="P1"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000004"
                         name="P2"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000008"
                         name="P3"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000010"
                         name="P4"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000020"
                         name="P5"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000040"
                         name="P6"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000080"
                         name="P7"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000100"
                         name="P8"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000200"
                         name="P9"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Falling Edge/Low-Level Interrupt Selection"
                         mask="0x80000000"
                         name="P31"/>
            </register>
            <register caption="Rising Edge/High-Level Select Register"
                      name="PIO_REHLSR"
                      offset="0x00D4"
                      rw="W"
                      size="4"
                      atomic-op="set:PIO_FRLHSR">
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000001"
                         name="P0"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000002"
                         name="P1"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000004"
                         name="P2"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000008"
                         name="P3"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000010"
                         name="P4"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000020"
                         name="P5"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000040"
                         name="P6"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000080"
                         name="P7"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000100"
                         name="P8"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000200"
                         name="P9"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Rising Edge/High-Level Interrupt Selection"
                         mask="0x80000000"
                         name="P31"/>
            </register>
