Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="PIO_DRIVER__LINE7">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE8">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE9">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE10">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE11">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE12">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE13">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE14">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE15">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE16">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE17">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE18">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE19">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE20">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE21">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE22">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE23">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE24">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE25">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE26">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE27">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE28">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE29">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE30">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE31">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_PCMR__DSIZE">
            <value caption="The reception data in the PIO_PCRHR is a byte (8-bit)"
                   name="BYTE"
                   value="0x0"/>
            <value caption="The reception data in the PIO_PCRHR is a half-word (16-bit)"
                   name="HALFWORD"
                   value="0x1"/>
            <value caption="The reception data in the PIO_PCRHR is a word (32-bit)"
                   name="WORD"
                   value="0x2"/>
         </value-group>
      </module>
