Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
      <module name="PMC"
              caption="Power Management Controller"
              id="44006"
              version="P">
         <register-group name="PMC">
            <register caption="System Clock Enable Register"
                      name="PMC_SCER"
                      offset="0x0000"
                      rw="W"
                      size="4"
                      atomic-op="set:PMC_SCSR">
               <bitfield caption="Enable USB FS Clock" mask="0x00000020" name="USBCLK"/>
               <bitfield caption="Programmable Clock 0 Output Enable"
                         mask="0x00000100"
                         name="PCK0"/>
               <bitfield caption="Programmable Clock 1 Output Enable"
                         mask="0x00000200"
                         name="PCK1"/>
               <bitfield caption="Programmable Clock 2 Output Enable"
                         mask="0x00000400"
                         name="PCK2"/>
               <bitfield caption="Programmable Clock 3 Output Enable"
                         mask="0x00000800"
                         name="PCK3"/>
               <bitfield caption="Programmable Clock 4 Output Enable"
                         mask="0x00001000"
                         name="PCK4"/>
               <bitfield caption="Programmable Clock 5 Output Enable"
                         mask="0x00002000"
                         name="PCK5"/>
               <bitfield caption="Programmable Clock 6 Output Enable"
                         mask="0x00004000"
                         name="PCK6"/>
               <bitfield caption="Programmable Clock 7 Output Enable"
                         mask="0x00008000"
                         name="PCK7"/>
            </register>
            <register caption="System Clock Disable Register"
                      name="PMC_SCDR"
                      offset="0x0004"
                      rw="W"
                      size="4"
                      atomic-op="clear:PMC_SCSR">
               <bitfield caption="Disable USB FS Clock" mask="0x00000020" name="USBCLK"/>
               <bitfield caption="Programmable Clock 0 Output Disable"
                         mask="0x00000100"
                         name="PCK0"/>
               <bitfield caption="Programmable Clock 1 Output Disable"
                         mask="0x00000200"
                         name="PCK1"/>
               <bitfield caption="Programmable Clock 2 Output Disable"
                         mask="0x00000400"
                         name="PCK2"/>
               <bitfield caption="Programmable Clock 3 Output Disable"
                         mask="0x00000800"
                         name="PCK3"/>
               <bitfield caption="Programmable Clock 4 Output Disable"
                         mask="0x00001000"
                         name="PCK4"/>
               <bitfield caption="Programmable Clock 5 Output Disable"
                         mask="0x00002000"
                         name="PCK5"/>
               <bitfield caption="Programmable Clock 6 Output Disable"
                         mask="0x00004000"
                         name="PCK6"/>
               <bitfield caption="Programmable Clock 7 Output Disable"
                         mask="0x00008000"
                         name="PCK7"/>
            </register>
            <register caption="System Clock Status Register"
                      name="PMC_SCSR"
                      offset="0x0008"
                      rw="R"
                      size="4">
               <bitfield caption="HCLK Status" mask="0x00000001" name="HCLKS"/>
               <bitfield caption="USB FS Clock Status" mask="0x00000020" name="USBCLK"/>
               <bitfield caption="Programmable Clock 0 Output Status"
                         mask="0x00000100"
                         name="PCK0"/>
               <bitfield caption="Programmable Clock 1 Output Status"
                         mask="0x00000200"
                         name="PCK1"/>
               <bitfield caption="Programmable Clock 2 Output Status"
                         mask="0x00000400"
                         name="PCK2"/>
               <bitfield caption="Programmable Clock 3 Output Status"
                         mask="0x00000800"
                         name="PCK3"/>
               <bitfield caption="Programmable Clock 4 Output Status"
                         mask="0x00001000"
                         name="PCK4"/>
               <bitfield caption="Programmable Clock 5 Output Status"
                         mask="0x00002000"
                         name="PCK5"/>
               <bitfield caption="Programmable Clock 6 Output Status"
                         mask="0x00004000"
                         name="PCK6"/>
               <bitfield caption="Programmable Clock 7 Output Status"
                         mask="0x00008000"
                         name="PCK7"/>
            </register>
            <register caption="Peripheral Clock Enable Register 0"
                      name="PMC_PCER0"
                      offset="0x0010"
                      rw="W"
                      size="4"
                      atomic-op="set:PMC_PCSR0">
               <bitfield caption="Peripheral Clock 7 Enable" mask="0x00000080" name="PID7"/>
               <bitfield caption="Peripheral Clock 8 Enable" mask="0x00000100" name="PID8"/>
               <bitfield caption="Peripheral Clock 10 Enable" mask="0x00000400" name="PID10"/>
               <bitfield caption="Peripheral Clock 11 Enable" mask="0x00000800" name="PID11"/>
               <bitfield caption="Peripheral Clock 13 Enable" mask="0x00002000" name="PID13"/>
               <bitfield caption="Peripheral Clock 14 Enable" mask="0x00004000" name="PID14"/>
               <bitfield caption="Peripheral Clock 15 Enable" mask="0x00008000" name="PID15"/>
               <bitfield caption="Peripheral Clock 16 Enable" mask="0x00010000" name="PID16"/>
               <bitfield caption="Peripheral Clock 18 Enable" mask="0x00040000" name="PID18"/>
               <bitfield caption="Peripheral Clock 19 Enable" mask="0x00080000" name="PID19"/>
               <bitfield caption="Peripheral Clock 20 Enable" mask="0x00100000" name="PID20"/>
               <bitfield caption="Peripheral Clock 21 Enable" mask="0x00200000" name="PID21"/>
               <bitfield caption="Peripheral Clock 22 Enable" mask="0x00400000" name="PID22"/>
               <bitfield caption="Peripheral Clock 23 Enable" mask="0x00800000" name="PID23"/>
               <bitfield caption="Peripheral Clock 24 Enable" mask="0x01000000" name="PID24"/>
               <bitfield caption="Peripheral Clock 25 Enable" mask="0x02000000" name="PID25"/>
               <bitfield caption="Peripheral Clock 26 Enable" mask="0x04000000" name="PID26"/>
               <bitfield caption="Peripheral Clock 27 Enable" mask="0x08000000" name="PID27"/>
               <bitfield caption="Peripheral Clock 28 Enable" mask="0x10000000" name="PID28"/>
               <bitfield caption="Peripheral Clock 29 Enable" mask="0x20000000" name="PID29"/>
               <bitfield caption="Peripheral Clock 30 Enable" mask="0x40000000" name="PID30"/>
               <bitfield caption="Peripheral Clock 31 Enable" mask="0x80000000" name="PID31"/>
            </register>
