Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="PWM Status Register"
                      name="PWM_SR"
                      offset="0x0C"
                      rw="R"
                      size="4">
               <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
               <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
               <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
               <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
            </register>
            <register caption="PWM Interrupt Enable Register 1"
                      name="PWM_IER1"
                      offset="0x10"
                      rw="W"
                      size="4"
                      atomic-op="set:PWM_IMR1">
               <bitfield caption="Counter Event on Channel 0 Interrupt Enable"
                         mask="0x00000001"
                         name="CHID0"/>
               <bitfield caption="Counter Event on Channel 1 Interrupt Enable"
                         mask="0x00000002"
                         name="CHID1"/>
               <bitfield caption="Counter Event on Channel 2 Interrupt Enable"
                         mask="0x00000004"
                         name="CHID2"/>
               <bitfield caption="Counter Event on Channel 3 Interrupt Enable"
                         mask="0x00000008"
                         name="CHID3"/>
               <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable"
                         mask="0x00010000"
                         name="FCHID0"/>
               <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable"
                         mask="0x00020000"
                         name="FCHID1"/>
               <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable"
                         mask="0x00040000"
                         name="FCHID2"/>
               <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable"
                         mask="0x00080000"
                         name="FCHID3"/>
            </register>
            <register caption="PWM Interrupt Disable Register 1"
                      name="PWM_IDR1"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="clear:PWM_IMR1">
               <bitfield caption="Counter Event on Channel 0 Interrupt Disable"
                         mask="0x00000001"
                         name="CHID0"/>
               <bitfield caption="Counter Event on Channel 1 Interrupt Disable"
                         mask="0x00000002"
                         name="CHID1"/>
               <bitfield caption="Counter Event on Channel 2 Interrupt Disable"
                         mask="0x00000004"
                         name="CHID2"/>
               <bitfield caption="Counter Event on Channel 3 Interrupt Disable"
                         mask="0x00000008"
                         name="CHID3"/>
               <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable"
                         mask="0x00010000"
                         name="FCHID0"/>
               <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable"
                         mask="0x00020000"
                         name="FCHID1"/>
               <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable"
                         mask="0x00040000"
                         name="FCHID2"/>
               <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Disable"
                         mask="0x00080000"
                         name="FCHID3"/>
            </register>
            <register caption="PWM Interrupt Mask Register 1"
                      name="PWM_IMR1"
                      offset="0x18"
                      rw="R"
                      size="4"
                      atomic-op="read:PWM_IMR1">
               <bitfield caption="Counter Event on Channel 0 Interrupt Mask"
                         mask="0x00000001"
                         name="CHID0"/>
               <bitfield caption="Counter Event on Channel 1 Interrupt Mask"
                         mask="0x00000002"
                         name="CHID1"/>
               <bitfield caption="Counter Event on Channel 2 Interrupt Mask"
                         mask="0x00000004"
                         name="CHID2"/>
               <bitfield caption="Counter Event on Channel 3 Interrupt Mask"
                         mask="0x00000008"
                         name="CHID3"/>
               <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask"
                         mask="0x00010000"
                         name="FCHID0"/>
               <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask"
                         mask="0x00020000"
                         name="FCHID1"/>
               <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask"
                         mask="0x00040000"
                         name="FCHID2"/>
               <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Mask"
                         mask="0x00080000"
                         name="FCHID3"/>
            </register>
            <register caption="PWM Interrupt Status Register 1"
                      name="PWM_ISR1"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      atomic-op="clear:PWM_ISR1">
               <bitfield caption="Counter Event on Channel 0" mask="0x00000001" name="CHID0"/>
               <bitfield caption="Counter Event on Channel 1" mask="0x00000002" name="CHID1"/>
               <bitfield caption="Counter Event on Channel 2" mask="0x00000004" name="CHID2"/>
               <bitfield caption="Counter Event on Channel 3" mask="0x00000008" name="CHID3"/>
               <bitfield caption="Fault Protection Trigger on Channel 0"
                         mask="0x00010000"
                         name="FCHID0"/>
               <bitfield caption="Fault Protection Trigger on Channel 1"
                         mask="0x00020000"
                         name="FCHID1"/>
               <bitfield caption="Fault Protection Trigger on Channel 2"
                         mask="0x00040000"
                         name="FCHID2"/>
               <bitfield caption="Fault Protection Trigger on Channel 3"
                         mask="0x00080000"
                         name="FCHID3"/>
            </register>
            <register caption="PWM Sync Channels Mode Register"
                      name="PWM_SCM"
                      offset="0x20"
                      rw="RW"
                      size="4">
               <bitfield caption="Synchronous Channel 0" mask="0x00000001" name="SYNC0"/>
               <bitfield caption="Synchronous Channel 1" mask="0x00000002" name="SYNC1"/>
               <bitfield caption="Synchronous Channel 2" mask="0x00000004" name="SYNC2"/>
               <bitfield caption="Synchronous Channel 3" mask="0x00000008" name="SYNC3"/>
               <bitfield caption="Synchronous Channels Update Mode"
                         mask="0x00030000"
                         name="UPDM"
                         values="PWM_SCM__UPDM"/>
               <bitfield caption="DMA Controller Transfer Request Mode"
                         mask="0x00100000"
                         name="PTRM"/>
               <bitfield caption="DMA Controller Transfer Request Comparison Selection"
                         mask="0x00E00000"
                         name="PTRCS"/>
            </register>
            <register caption="PWM DMA Register"
                      name="PWM_DMAR"
                      offset="0x24"
                      rw="W"
                      size="4">
               <bitfield caption="Duty-Cycle Holding Register for DMA Access"
                         mask="0x00FFFFFF"
                         name="DMADUTY"/>
            </register>
