Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="PWM Sync Channels Update Control Register"
                      name="PWM_SCUC"
                      offset="0x28"
                      rw="RW"
                      size="4">
               <bitfield caption="Synchronous Channels Update Unlock"
                         mask="0x00000001"
                         name="UPDULOCK"/>
            </register>
            <register caption="PWM Sync Channels Update Period Register"
                      name="PWM_SCUP"
                      offset="0x2C"
                      rw="RW"
                      size="4">
               <bitfield caption="Update Period" mask="0x0000000F" name="UPR"/>
               <bitfield caption="Update Period Counter" mask="0x000000F0" name="UPRCNT"/>
            </register>
            <register caption="PWM Sync Channels Update Period Update Register"
                      name="PWM_SCUPUPD"
                      offset="0x30"
                      rw="W"
                      size="4">
               <bitfield caption="Update Period Update" mask="0x0000000F" name="UPRUPD"/>
            </register>
            <register caption="PWM Interrupt Enable Register 2"
                      name="PWM_IER2"
                      offset="0x34"
                      rw="W"
                      size="4"
                      atomic-op="set:PWM_IMR2">
               <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Enable"
                         mask="0x00000001"
                         name="WRDY"/>
               <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Enable"
                         mask="0x00000008"
                         name="UNRE"/>
               <bitfield caption="Comparison 0 Match Interrupt Enable"
                         mask="0x00000100"
                         name="CMPM0"/>
               <bitfield caption="Comparison 1 Match Interrupt Enable"
                         mask="0x00000200"
                         name="CMPM1"/>
               <bitfield caption="Comparison 2 Match Interrupt Enable"
                         mask="0x00000400"
                         name="CMPM2"/>
               <bitfield caption="Comparison 3 Match Interrupt Enable"
                         mask="0x00000800"
                         name="CMPM3"/>
               <bitfield caption="Comparison 4 Match Interrupt Enable"
                         mask="0x00001000"
                         name="CMPM4"/>
               <bitfield caption="Comparison 5 Match Interrupt Enable"
                         mask="0x00002000"
                         name="CMPM5"/>
               <bitfield caption="Comparison 6 Match Interrupt Enable"
                         mask="0x00004000"
                         name="CMPM6"/>
               <bitfield caption="Comparison 7 Match Interrupt Enable"
                         mask="0x00008000"
                         name="CMPM7"/>
               <bitfield caption="Comparison 0 Update Interrupt Enable"
                         mask="0x00010000"
                         name="CMPU0"/>
               <bitfield caption="Comparison 1 Update Interrupt Enable"
                         mask="0x00020000"
                         name="CMPU1"/>
               <bitfield caption="Comparison 2 Update Interrupt Enable"
                         mask="0x00040000"
                         name="CMPU2"/>
               <bitfield caption="Comparison 3 Update Interrupt Enable"
                         mask="0x00080000"
                         name="CMPU3"/>
               <bitfield caption="Comparison 4 Update Interrupt Enable"
                         mask="0x00100000"
                         name="CMPU4"/>
               <bitfield caption="Comparison 5 Update Interrupt Enable"
                         mask="0x00200000"
                         name="CMPU5"/>
               <bitfield caption="Comparison 6 Update Interrupt Enable"
                         mask="0x00400000"
                         name="CMPU6"/>
               <bitfield caption="Comparison 7 Update Interrupt Enable"
                         mask="0x00800000"
                         name="CMPU7"/>
            </register>
            <register caption="PWM Interrupt Disable Register 2"
                      name="PWM_IDR2"
                      offset="0x38"
                      rw="W"
                      size="4"
                      atomic-op="clear:PWM_IMR2">
               <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Disable"
                         mask="0x00000001"
                         name="WRDY"/>
               <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Disable"
                         mask="0x00000008"
                         name="UNRE"/>
               <bitfield caption="Comparison 0 Match Interrupt Disable"
                         mask="0x00000100"
                         name="CMPM0"/>
               <bitfield caption="Comparison 1 Match Interrupt Disable"
                         mask="0x00000200"
                         name="CMPM1"/>
               <bitfield caption="Comparison 2 Match Interrupt Disable"
                         mask="0x00000400"
                         name="CMPM2"/>
               <bitfield caption="Comparison 3 Match Interrupt Disable"
                         mask="0x00000800"
                         name="CMPM3"/>
               <bitfield caption="Comparison 4 Match Interrupt Disable"
                         mask="0x00001000"
                         name="CMPM4"/>
               <bitfield caption="Comparison 5 Match Interrupt Disable"
                         mask="0x00002000"
                         name="CMPM5"/>
               <bitfield caption="Comparison 6 Match Interrupt Disable"
                         mask="0x00004000"
                         name="CMPM6"/>
               <bitfield caption="Comparison 7 Match Interrupt Disable"
                         mask="0x00008000"
                         name="CMPM7"/>
               <bitfield caption="Comparison 0 Update Interrupt Disable"
                         mask="0x00010000"
                         name="CMPU0"/>
               <bitfield caption="Comparison 1 Update Interrupt Disable"
                         mask="0x00020000"
                         name="CMPU1"/>
               <bitfield caption="Comparison 2 Update Interrupt Disable"
                         mask="0x00040000"
                         name="CMPU2"/>
               <bitfield caption="Comparison 3 Update Interrupt Disable"
                         mask="0x00080000"
                         name="CMPU3"/>
               <bitfield caption="Comparison 4 Update Interrupt Disable"
                         mask="0x00100000"
                         name="CMPU4"/>
               <bitfield caption="Comparison 5 Update Interrupt Disable"
                         mask="0x00200000"
                         name="CMPU5"/>
               <bitfield caption="Comparison 6 Update Interrupt Disable"
                         mask="0x00400000"
                         name="CMPU6"/>
               <bitfield caption="Comparison 7 Update Interrupt Disable"
                         mask="0x00800000"
                         name="CMPU7"/>
            </register>
            <register caption="PWM Interrupt Mask Register 2"
                      name="PWM_IMR2"
                      offset="0x3C"
                      rw="R"
                      size="4"
                      atomic-op="read:PWM_IMR2">
               <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Mask"
                         mask="0x00000001"
                         name="WRDY"/>
               <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Mask"
                         mask="0x00000008"
                         name="UNRE"/>
               <bitfield caption="Comparison 0 Match Interrupt Mask"
                         mask="0x00000100"
                         name="CMPM0"/>
               <bitfield caption="Comparison 1 Match Interrupt Mask"
                         mask="0x00000200"
                         name="CMPM1"/>
               <bitfield caption="Comparison 2 Match Interrupt Mask"
                         mask="0x00000400"
                         name="CMPM2"/>
               <bitfield caption="Comparison 3 Match Interrupt Mask"
                         mask="0x00000800"
                         name="CMPM3"/>
               <bitfield caption="Comparison 4 Match Interrupt Mask"
                         mask="0x00001000"
                         name="CMPM4"/>
               <bitfield caption="Comparison 5 Match Interrupt Mask"
                         mask="0x00002000"
                         name="CMPM5"/>
               <bitfield caption="Comparison 6 Match Interrupt Mask"
                         mask="0x00004000"
                         name="CMPM6"/>
               <bitfield caption="Comparison 7 Match Interrupt Mask"
                         mask="0x00008000"
                         name="CMPM7"/>
               <bitfield caption="Comparison 0 Update Interrupt Mask"
                         mask="0x00010000"
                         name="CMPU0"/>
               <bitfield caption="Comparison 1 Update Interrupt Mask"
                         mask="0x00020000"
                         name="CMPU1"/>
               <bitfield caption="Comparison 2 Update Interrupt Mask"
                         mask="0x00040000"
                         name="CMPU2"/>
               <bitfield caption="Comparison 3 Update Interrupt Mask"
                         mask="0x00080000"
                         name="CMPU3"/>
               <bitfield caption="Comparison 4 Update Interrupt Mask"
                         mask="0x00100000"
                         name="CMPU4"/>
               <bitfield caption="Comparison 5 Update Interrupt Mask"
                         mask="0x00200000"
                         name="CMPU5"/>
               <bitfield caption="Comparison 6 Update Interrupt Mask"
                         mask="0x00400000"
                         name="CMPU6"/>
               <bitfield caption="Comparison 7 Update Interrupt Mask"
                         mask="0x00800000"
                         name="CMPU7"/>
            </register>
