Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Transmit Holding Register"
                      name="SSC_THR"
                      offset="0x24"
                      rw="W"
                      size="4">
               <bitfield caption="Transmit Data" mask="0xFFFFFFFF" name="TDAT"/>
            </register>
            <register caption="Receive Sync. Holding Register"
                      name="SSC_RSHR"
                      offset="0x30"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Synchronization Data"
                         mask="0x0000FFFF"
                         name="RSDAT"/>
            </register>
            <register caption="Transmit Sync. Holding Register"
                      name="SSC_TSHR"
                      offset="0x34"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmit Synchronization Data"
                         mask="0x0000FFFF"
                         name="TSDAT"/>
            </register>
            <register caption="Receive Compare 0 Register"
                      name="SSC_RC0R"
                      offset="0x38"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive Compare Data 0" mask="0x0000FFFF" name="CP0"/>
            </register>
            <register caption="Receive Compare 1 Register"
                      name="SSC_RC1R"
                      offset="0x3C"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive Compare Data 1" mask="0x0000FFFF" name="CP1"/>
            </register>
            <register caption="Status Register"
                      name="SSC_SR"
                      offset="0x40"
                      rw="R"
                      size="4">
               <bitfield caption="Transmit Ready" mask="0x00000001" name="TXRDY"/>
               <bitfield caption="Transmit Empty" mask="0x00000002" name="TXEMPTY"/>
               <bitfield caption="Receive Ready" mask="0x00000010" name="RXRDY"/>
               <bitfield caption="Receive Overrun" mask="0x00000020" name="OVRUN"/>
               <bitfield caption="Compare 0" mask="0x00000100" name="CP0"/>
               <bitfield caption="Compare 1" mask="0x00000200" name="CP1"/>
               <bitfield caption="Transmit Sync" mask="0x00000400" name="TXSYN"/>
               <bitfield caption="Receive Sync" mask="0x00000800" name="RXSYN"/>
               <bitfield caption="Transmit Enable" mask="0x00010000" name="TXEN"/>
               <bitfield caption="Receive Enable" mask="0x00020000" name="RXEN"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="SSC_IER"
                      offset="0x44"
                      rw="W"
                      size="4"
                      atomic-op="set:SSC_IMR">
               <bitfield caption="Transmit Ready Interrupt Enable"
                         mask="0x00000001"
                         name="TXRDY"/>
               <bitfield caption="Transmit Empty Interrupt Enable"
                         mask="0x00000002"
                         name="TXEMPTY"/>
               <bitfield caption="Receive Ready Interrupt Enable"
                         mask="0x00000010"
                         name="RXRDY"/>
               <bitfield caption="Receive Overrun Interrupt Enable"
                         mask="0x00000020"
                         name="OVRUN"/>
               <bitfield caption="Compare 0 Interrupt Enable" mask="0x00000100" name="CP0"/>
               <bitfield caption="Compare 1 Interrupt Enable" mask="0x00000200" name="CP1"/>
               <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
               <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="SSC_IDR"
                      offset="0x48"
                      rw="W"
                      size="4"
                      atomic-op="clear:SSC_IMR">
               <bitfield caption="Transmit Ready Interrupt Disable"
                         mask="0x00000001"
                         name="TXRDY"/>
               <bitfield caption="Transmit Empty Interrupt Disable"
                         mask="0x00000002"
                         name="TXEMPTY"/>
               <bitfield caption="Receive Ready Interrupt Disable"
                         mask="0x00000010"
                         name="RXRDY"/>
               <bitfield caption="Receive Overrun Interrupt Disable"
                         mask="0x00000020"
                         name="OVRUN"/>
               <bitfield caption="Compare 0 Interrupt Disable" mask="0x00000100" name="CP0"/>
               <bitfield caption="Compare 1 Interrupt Disable" mask="0x00000200" name="CP1"/>
               <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
               <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
            </register>
            <register caption="Interrupt Mask Register"
                      name="SSC_IMR"
                      offset="0x4C"
                      rw="R"
                      size="4"
                      atomic-op="read:SSC_IMR">
               <bitfield caption="Transmit Ready Interrupt Mask"
                         mask="0x00000001"
                         name="TXRDY"/>
               <bitfield caption="Transmit Empty Interrupt Mask"
                         mask="0x00000002"
                         name="TXEMPTY"/>
               <bitfield caption="Receive Ready Interrupt Mask"
                         mask="0x00000010"
                         name="RXRDY"/>
               <bitfield caption="Receive Overrun Interrupt Mask"
                         mask="0x00000020"
                         name="OVRUN"/>
               <bitfield caption="Compare 0 Interrupt Mask" mask="0x00000100" name="CP0"/>
               <bitfield caption="Compare 1 Interrupt Mask" mask="0x00000200" name="CP1"/>
               <bitfield caption="Tx Sync Interrupt Mask" mask="0x00000400" name="TXSYN"/>
               <bitfield caption="Rx Sync Interrupt Mask" mask="0x00000800" name="RXSYN"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="SSC_WPMR"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="SSC_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="SSC_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protect Violation Source"
                         mask="0x00FFFF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
