Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="SUPC_SR__WKUPIS8">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPIS9">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPIS10">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPIS11">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPIS12">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPIS13">
            <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event."
                   name="DIS"
                   value="0"/>
            <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR."
                   name="EN"
                   value="1"/>
         </value-group>
         <value-group caption="Write Protection Key" name="SYSC_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0."
                   name="PASSWD"
                   value="0x525443"/>
         </value-group>
      </module>
      <module name="TC" caption="Timer Counter" id="6082" version="ZL">
         <register-group name="TC_CHANNEL" size="64">
            <register caption="Channel Control Register (channel = 0)"
                      name="TC_CCR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Counter Clock Enable Command"
                         mask="0x00000001"
                         name="CLKEN"/>
               <bitfield caption="Counter Clock Disable Command"
                         mask="0x00000002"
                         name="CLKDIS"/>
               <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
            </register>
            <register caption="Channel Mode Register (channel = 0)"
                      name="TC_CMR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <mode name="CAPTURE"
                     qualifier="TC_CMR.WAVE"
                     value="0x0"
                     caption="Capture"/>
               <mode name="WAVEFORM"
                     qualifier="TC_CMR.WAVE"
                     value="0x1"
                     caption="Waveform"/>
               <bitfield caption="Clock Selection"
                         mask="0x00000007"
                         name="TCCLKS"
                         values="TC_CMR0__TCCLKS"/>
               <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
               <bitfield caption="Burst Signal Selection"
                         mask="0x00000030"
                         name="BURST"
                         values="TC_CMR0__BURST"/>
               <bitfield modes="CAPTURE"
                         caption="Counter Clock Stopped with RB Loading"
                         mask="0x00000040"
                         name="LDBSTOP"/>
               <bitfield modes="WAVEFORM"
                         caption="Counter Clock Stopped with RC Compare"
                         mask="0x00000040"
                         name="CPCSTOP"/>
               <bitfield modes="CAPTURE"
                         caption="Counter Clock Disable with RB Loading"
                         mask="0x00000080"
                         name="LDBDIS"/>
               <bitfield modes="WAVEFORM"
                         caption="Counter Clock Disable with RC Loading"
                         mask="0x00000080"
                         name="CPCDIS"/>
               <bitfield modes="CAPTURE"
                         caption="External Trigger Edge Selection"
                         mask="0x00000300"
                         name="ETRGEDG"
                         values="TC_CMR0__ETRGEDG"/>
               <bitfield modes="WAVEFORM"
                         caption="External Event Edge Selection"
                         mask="0x00000300"
                         name="EEVTEDG"
                         values="TC_CMR0__EEVTEDG"/>
               <bitfield modes="CAPTURE"
                         caption="TIOAx or TIOBx External Trigger Selection"
                         mask="0x00000400"
                         name="ABETRG"/>
               <bitfield modes="WAVEFORM"
                         caption="External Event Selection"
                         mask="0x00000C00"
                         name="EEVT"
                         values="TC_CMR0__EEVT"/>
               <bitfield modes="WAVEFORM"
                         caption="External Event Trigger Enable"
                         mask="0x00001000"
                         name="ENETRG"/>
               <bitfield modes="WAVEFORM"
                         caption="Waveform Selection"
                         mask="0x00006000"
                         name="WAVSEL"
                         values="TC_CMR0__WAVSEL"/>
               <bitfield modes="CAPTURE"
                         caption="RC Compare Trigger Enable"
                         mask="0x00004000"
                         name="CPCTRG"/>
               <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
               <bitfield modes="CAPTURE"
                         caption="RA Loading Edge Selection"
                         mask="0x00030000"
                         name="LDRA"
                         values="TC_CMR0__LDRA"/>
               <bitfield modes="WAVEFORM"
                         caption="RA Compare Effect on TIOAx"
                         mask="0x00030000"
                         name="ACPA"
                         values="TC_CMR0__ACPA"/>
               <bitfield modes="CAPTURE"
                         caption="RB Loading Edge Selection"
                         mask="0x000C0000"
                         name="LDRB"
                         values="TC_CMR0__LDRB"/>
               <bitfield modes="WAVEFORM"
                         caption="RC Compare Effect on TIOAx"
                         mask="0x000C0000"
                         name="ACPC"
                         values="TC_CMR0__ACPC"/>
               <bitfield modes="CAPTURE"
                         caption="Loading Edge Subsampling Ratio"
                         mask="0x00700000"
                         name="SBSMPLR"
                         values="TC_CMR0__SBSMPLR"/>
               <bitfield modes="WAVEFORM"
                         caption="External Event Effect on TIOAx"
                         mask="0x00300000"
                         name="AEEVT"
                         values="TC_CMR0__AEEVT"/>
               <bitfield modes="WAVEFORM"
                         caption="Software Trigger Effect on TIOAx"
                         mask="0x00C00000"
                         name="ASWTRG"
                         values="TC_CMR0__ASWTRG"/>
               <bitfield modes="WAVEFORM"
                         caption="RB Compare Effect on TIOBx"
                         mask="0x03000000"
                         name="BCPB"
                         values="TC_CMR0__BCPB"/>
               <bitfield modes="WAVEFORM"
                         caption="RC Compare Effect on TIOBx"
                         mask="0x0C000000"
                         name="BCPC"
                         values="TC_CMR0__BCPC"/>
               <bitfield modes="WAVEFORM"
                         caption="External Event Effect on TIOBx"
                         mask="0x30000000"
                         name="BEEVT"
                         values="TC_CMR0__BEEVT"/>
               <bitfield modes="WAVEFORM"
                         caption="Software Trigger Effect on TIOBx"
                         mask="0xC0000000"
                         name="BSWTRG"
                         values="TC_CMR0__BSWTRG"/>
            </register>
