Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Stepper Motor Mode Register (channel = 0)"
                      name="TC_SMMR"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
               <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
            </register>
            <register caption="Register AB (channel = 0)"
                      name="TC_RAB"
                      offset="0x0C"
                      rw="R"
                      size="4">
               <bitfield caption="Register A or Register B" mask="0xFFFFFFFF" name="RAB"/>
            </register>
            <register caption="Counter Value (channel = 0)"
                      name="TC_CV"
                      offset="0x10"
                      rw="R"
                      size="4">
               <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
            </register>
            <register caption="Register A (channel = 0)"
                      name="TC_RA"
                      offset="0x14"
                      rw="RW"
                      size="4">
               <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
            </register>
            <register caption="Register B (channel = 0)"
                      name="TC_RB"
                      offset="0x18"
                      rw="RW"
                      size="4">
               <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
            </register>
            <register caption="Register C (channel = 0)"
                      name="TC_RC"
                      offset="0x1C"
                      rw="RW"
                      size="4">
               <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
            </register>
            <register caption="Status Register (channel = 0)"
                      name="TC_SR"
                      offset="0x20"
                      rw="R"
                      size="4">
               <bitfield caption="Counter Overflow Status (cleared on read)"
                         mask="0x00000001"
                         name="COVFS"/>
               <bitfield caption="Load Overrun Status (cleared on read)"
                         mask="0x00000002"
                         name="LOVRS"/>
               <bitfield caption="RA Compare Status (cleared on read)"
                         mask="0x00000004"
                         name="CPAS"/>
               <bitfield caption="RB Compare Status (cleared on read)"
                         mask="0x00000008"
                         name="CPBS"/>
               <bitfield caption="RC Compare Status (cleared on read)"
                         mask="0x00000010"
                         name="CPCS"/>
               <bitfield caption="RA Loading Status (cleared on read)"
                         mask="0x00000020"
                         name="LDRAS"/>
               <bitfield caption="RB Loading Status (cleared on read)"
                         mask="0x00000040"
                         name="LDRBS"/>
               <bitfield caption="External Trigger Status (cleared on read)"
                         mask="0x00000080"
                         name="ETRGS"/>
               <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
               <bitfield caption="TIOAx Mirror" mask="0x00020000" name="MTIOA"/>
               <bitfield caption="TIOBx Mirror" mask="0x00040000" name="MTIOB"/>
            </register>
            <register caption="Interrupt Enable Register (channel = 0)"
                      name="TC_IER"
                      offset="0x24"
                      rw="W"
                      size="4"
                      atomic-op="set:TC_IMR">
               <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
               <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
               <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
               <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
               <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
               <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
               <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
               <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
            </register>
            <register caption="Interrupt Disable Register (channel = 0)"
                      name="TC_IDR"
                      offset="0x28"
                      rw="W"
                      size="4"
                      atomic-op="clear:TC_IMR">
               <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
               <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
               <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
               <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
               <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
               <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
               <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
               <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
            </register>
            <register caption="Interrupt Mask Register (channel = 0)"
                      name="TC_IMR"
                      offset="0x2C"
                      rw="R"
                      size="4"
                      atomic-op="read:TC_IMR">
               <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
               <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
               <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
               <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
               <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
               <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
               <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
               <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
            </register>
            <register caption="Extended Mode Register (channel = 0)"
                      name="TC_EMR"
                      offset="0x30"
                      rw="RW"
                      size="4">
               <bitfield caption="Trigger Source for Input A"
                         mask="0x00000003"
                         name="TRIGSRCA"
                         values="TC_EMR0__TRIGSRCA"/>
               <bitfield caption="Trigger Source for Input B"
                         mask="0x00000030"
                         name="TRIGSRCB"
                         values="TC_EMR0__TRIGSRCB"/>
               <bitfield caption="No Divided Clock" mask="0x00000100" name="NODIVCLK"/>
            </register>
         </register-group>
