Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Interrupt Mask Register"
                      name="US_IMR"
                      offset="0x0010"
                      rw="R"
                      size="4"
                      atomic-op="read:US_IMR">
               <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
               <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
               <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
               <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
               <bitfield modes="USART"
                         caption="RXRDY Interrupt Mask"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="USART"
                         caption="TXRDY Interrupt Mask"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="USART"
                         caption="Receiver Break Interrupt Mask"
                         mask="0x00000004"
                         name="RXBRK"/>
               <bitfield modes="USART"
                         caption="Overrun Error Interrupt Mask"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="USART"
                         caption="Framing Error Interrupt Mask"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="USART"
                         caption="Parity Error Interrupt Mask"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="USART"
                         caption="Timeout Interrupt Mask"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="USART"
                         caption="TXEMPTY Interrupt Mask"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="USART"
                         caption="Max Number of Repetitions Reached Interrupt Mask"
                         mask="0x00000400"
                         name="ITER"/>
               <bitfield modes="USART"
                         caption="Non Acknowledge Interrupt Mask"
                         mask="0x00002000"
                         name="NACK"/>
               <bitfield modes="USART"
                         caption="Ring Indicator Input Change Mask"
                         mask="0x00010000"
                         name="RIIC"/>
               <bitfield modes="USART"
                         caption="Data Set Ready Input Change Mask"
                         mask="0x00020000"
                         name="DSRIC"/>
               <bitfield modes="USART"
                         caption="Data Carrier Detect Input Change Interrupt Mask"
                         mask="0x00040000"
                         name="DCDIC"/>
               <bitfield modes="USART"
                         caption="Clear to Send Input Change Interrupt Mask"
                         mask="0x00080000"
                         name="CTSIC"/>
               <bitfield modes="USART"
                         caption="Manchester Error Interrupt Mask"
                         mask="0x01000000"
                         name="MANE"/>
               <bitfield modes="SPI"
                         caption="RXRDY Interrupt Mask"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="SPI"
                         caption="TXRDY Interrupt Mask"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="SPI"
                         caption="Overrun Error Interrupt Mask"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="SPI"
                         caption="SPI Underrun Error Interrupt Mask"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="SPI"
                         caption="TXEMPTY Interrupt Mask"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="SPI"
                         caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"
                         mask="0x00080000"
                         name="NSSE"/>
               <bitfield modes="LIN"
                         caption="RXRDY Interrupt Mask"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LIN"
                         caption="TXRDY Interrupt Mask"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LIN"
                         caption="Overrun Error Interrupt Mask"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LIN"
                         caption="Framing Error Interrupt Mask"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="LIN"
                         caption="Parity Error Interrupt Mask"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="LIN"
                         caption="Timeout Interrupt Mask"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="LIN"
                         caption="TXEMPTY Interrupt Mask"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LIN"
                         caption="LIN Break Sent or LIN Break Received Interrupt Mask"
                         mask="0x00002000"
                         name="LINBK"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Sent or LIN Identifier Received Interrupt Mask"
                         mask="0x00004000"
                         name="LINID"/>
               <bitfield modes="LIN"
                         caption="LIN Transfer Completed Interrupt Mask"
                         mask="0x00008000"
                         name="LINTC"/>
               <bitfield modes="LIN"
                         caption="LIN Bus Error Interrupt Mask"
                         mask="0x02000000"
                         name="LINBE"/>
               <bitfield modes="LIN"
                         caption="LIN Inconsistent Synch Field Error Interrupt Mask"
                         mask="0x04000000"
                         name="LINISFE"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Parity Interrupt Mask"
                         mask="0x08000000"
                         name="LINIPE"/>
               <bitfield modes="LIN"
                         caption="LIN Checksum Error Interrupt Mask"
                         mask="0x10000000"
                         name="LINCE"/>
               <bitfield modes="LIN"
                         caption="LIN Slave Not Responding Error Interrupt Mask"
                         mask="0x20000000"
                         name="LINSNRE"/>
               <bitfield modes="LIN"
                         caption="LIN Synch Tolerance Error Interrupt Mask"
                         mask="0x40000000"
                         name="LINSTE"/>
               <bitfield modes="LIN"
                         caption="LIN Header Timeout Error Interrupt Mask"
                         mask="0x80000000"
                         name="LINHTE"/>
               <bitfield modes="LON"
                         caption="RXRDY Interrupt Mask"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LON"
                         caption="TXRDY Interrupt Mask"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LON"
                         caption="Overrun Error Interrupt Mask"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LON"
                         caption="LON Short Frame Error Interrupt Mask"
                         mask="0x00000040"
                         name="LSFE"/>
               <bitfield modes="LON"
                         caption="LON CRC Error Interrupt Mask"
                         mask="0x00000080"
                         name="LCRCE"/>
               <bitfield modes="LON"
                         caption="TXEMPTY Interrupt Mask"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LON"
                         caption="SPI Underrun Error Interrupt Mask"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="LON"
                         caption="LON Transmission Done Interrupt Mask"
                         mask="0x01000000"
                         name="LTXD"/>
               <bitfield modes="LON"
                         caption="LON Collision Interrupt Mask"
                         mask="0x02000000"
                         name="LCOL"/>
               <bitfield modes="LON"
                         caption="LON Frame Early Termination Interrupt Mask"
                         mask="0x04000000"
                         name="LFET"/>
               <bitfield modes="LON"
                         caption="LON Reception Done Interrupt Mask"
                         mask="0x08000000"
                         name="LRXD"/>
               <bitfield modes="LON"
                         caption="LON Backlog Overflow Error Interrupt Mask"
                         mask="0x10000000"
                         name="LBLOVFE"/>
            </register>
            <register caption="Channel Status Register"
                      name="US_CSR"
                      offset="0x0014"
                      rw="R"
                      size="4">
               <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
               <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
               <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
               <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
               <bitfield modes="USART"
                         caption="Receiver Ready (cleared by reading US_RHR)"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="USART"
                         caption="Transmitter Ready (cleared by writing US_THR)"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="USART"
                         caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000004"
                         name="RXBRK"/>
               <bitfield modes="USART"
                         caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="USART"
                         caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="USART"
                         caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="USART"
                         caption="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="USART"
                         caption="Transmitter Empty (cleared by writing US_THR)"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="USART"
                         caption="Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)"
                         mask="0x00000400"
                         name="ITER"/>
               <bitfield modes="USART"
                         caption="Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)"
                         mask="0x00002000"
                         name="NACK"/>
               <bitfield modes="USART"
                         caption="Ring Indicator Input Change Flag (cleared on read)"
                         mask="0x00010000"
                         name="RIIC"/>
               <bitfield modes="USART"
                         caption="Data Set Ready Input Change Flag (cleared on read)"
                         mask="0x00020000"
                         name="DSRIC"/>
               <bitfield modes="USART"
                         caption="Data Carrier Detect Input Change Flag (cleared on read)"
                         mask="0x00040000"
                         name="DCDIC"/>
               <bitfield modes="USART"
                         caption="Clear to Send Input Change Flag (cleared on read)"
                         mask="0x00080000"
                         name="CTSIC"/>
               <bitfield modes="USART"
                         caption="Image of RI Input"
                         mask="0x00100000"
                         name="RI"/>
               <bitfield modes="USART"
                         caption="Image of DSR Input"
                         mask="0x00200000"
                         name="DSR"/>
               <bitfield modes="USART"
                         caption="Image of DCD Input"
                         mask="0x00400000"
                         name="DCD"/>
               <bitfield modes="USART"
                         caption="Image of CTS Input"
                         mask="0x00800000"
                         name="CTS"/>
               <bitfield modes="USART"
                         caption="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)"
                         mask="0x01000000"
                         name="MANERR"/>
               <bitfield modes="SPI"
                         caption="Receiver Ready (cleared by reading US_RHR)"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="SPI"
                         caption="Transmitter Ready (cleared by writing US_THR)"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="SPI"
                         caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="SPI"
                         caption="Transmitter Empty (cleared by writing US_THR)"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="SPI"
                         caption="SPI Underrun Error"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="SPI"
                         caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"
                         mask="0x00080000"
                         name="NSSE"/>
               <bitfield modes="SPI"
                         caption="Image of NSS Line"
                         mask="0x00800000"
                         name="NSS"/>
               <bitfield modes="LIN"
                         caption="Receiver Ready (cleared by reading US_RHR)"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LIN"
                         caption="Transmitter Ready (cleared by writing US_THR)"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LIN"
                         caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LIN"
                         caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="LIN"
                         caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="LIN"
                         caption="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="LIN"
                         caption="Transmitter Empty (cleared by writing US_THR)"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LIN"
                         caption="LIN Break Sent or LIN Break Received"
                         mask="0x00002000"
                         name="LINBK"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Sent or LIN Identifier Received"
                         mask="0x00004000"
                         name="LINID"/>
               <bitfield modes="LIN"
                         caption="LIN Transfer Completed"
                         mask="0x00008000"
                         name="LINTC"/>
               <bitfield modes="LIN"
                         caption="LIN Bus Line Status"
                         mask="0x00800000"
                         name="LINBLS"/>
               <bitfield modes="LIN"
                         caption="LIN Bus Error"
                         mask="0x02000000"
                         name="LINBE"/>
               <bitfield modes="LIN"
                         caption="LIN Inconsistent Synch Field Error"
                         mask="0x04000000"
                         name="LINISFE"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Parity Error"
                         mask="0x08000000"
                         name="LINIPE"/>
               <bitfield modes="LIN"
                         caption="LIN Checksum Error"
                         mask="0x10000000"
                         name="LINCE"/>
               <bitfield modes="LIN"
                         caption="LIN Slave Not Responding Error Interrupt Mask"
                         mask="0x20000000"
                         name="LINSNRE"/>
               <bitfield modes="LIN"
                         caption="LIN Synch Tolerance Error"
                         mask="0x40000000"
                         name="LINSTE"/>
               <bitfield modes="LIN"
                         caption="LIN Header Timeout Error"
                         mask="0x80000000"
                         name="LINHTE"/>
               <bitfield modes="LON"
                         caption="Receiver Ready (cleared by reading US_RHR)"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LON"
                         caption="Transmitter Ready (cleared by writing US_THR)"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LON"
                         caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LON"
                         caption="LON Short Frame Error"
                         mask="0x00000040"
                         name="LSFE"/>
               <bitfield modes="LON"
                         caption="LON CRC Error"
                         mask="0x00000080"
                         name="LCRCE"/>
               <bitfield modes="LON"
                         caption="Transmitter Empty (cleared by writing US_THR)"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LON"
                         caption="Underrun Error"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="LON"
                         caption="LON Transmission End Flag"
                         mask="0x01000000"
                         name="LTXD"/>
               <bitfield modes="LON"
                         caption="LON Collision Detected Flag"
                         mask="0x02000000"
                         name="LCOL"/>
               <bitfield modes="LON"
                         caption="LON Frame Early Termination"
                         mask="0x04000000"
                         name="LFET"/>
               <bitfield modes="LON"
                         caption="LON Reception End Flag"
                         mask="0x08000000"
                         name="LRXD"/>
               <bitfield modes="LON"
                         caption="LON Backlog Overflow Error"
                         mask="0x10000000"
                         name="LBLOVFE"/>
            </register>
            <register caption="Receive Holding Register"
                      name="US_RHR"
                      offset="0x0018"
                      rw="R"
                      size="4">
               <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
               <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
            </register>
