Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="LON Preamble Register"
                      name="US_LONPR"
                      offset="0x0064"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Preamble Length" mask="0x00003FFF" name="LONPL"/>
            </register>
            <register caption="LON Data Length Register"
                      name="US_LONDL"
                      offset="0x0068"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Data Length" mask="0x000000FF" name="LONDL"/>
            </register>
            <register caption="LON L2HDR Register"
                      name="US_LONL2HDR"
                      offset="0x006C"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Backlog Increment" mask="0x0000003F" name="BLI"/>
               <bitfield caption="LON Alternate Path Bit" mask="0x00000040" name="ALTP"/>
               <bitfield caption="LON Priority Bit" mask="0x00000080" name="PB"/>
            </register>
            <register caption="LON Backlog Register"
                      name="US_LONBL"
                      offset="0x0070"
                      rw="R"
                      size="4">
               <bitfield caption="LON Node Backlog Value" mask="0x0000003F" name="LONBL"/>
            </register>
            <register caption="LON Beta1 Tx Register"
                      name="US_LONB1TX"
                      offset="0x0074"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Beta1 Length after Transmission"
                         mask="0x00FFFFFF"
                         name="BETA1TX"/>
            </register>
            <register caption="LON Beta1 Rx Register"
                      name="US_LONB1RX"
                      offset="0x0078"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Beta1 Length after Reception"
                         mask="0x00FFFFFF"
                         name="BETA1RX"/>
            </register>
            <register caption="LON Priority Register"
                      name="US_LONPRIO"
                      offset="0x007C"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Priority Slot Number" mask="0x0000007F" name="PSNB"/>
               <bitfield caption="LON Node Priority Slot" mask="0x00007F00" name="NPS"/>
            </register>
            <register caption="LON IDT Tx Register"
                      name="US_IDTTX"
                      offset="0x0080"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Indeterminate Time after Transmission (comm_type = 1 mode only)"
                         mask="0x00FFFFFF"
                         name="IDTTX"/>
            </register>
            <register caption="LON IDT Rx Register"
                      name="US_IDTRX"
                      offset="0x0084"
                      rw="RW"
                      size="4">
               <bitfield caption="LON Indeterminate Time after Reception (comm_type = 1 mode only)"
                         mask="0x00FFFFFF"
                         name="IDTRX"/>
            </register>
            <register caption="IC DIFF Register"
                      name="US_ICDIFF"
                      offset="0x0088"
                      rw="RW"
                      size="4">
               <bitfield caption="IC Differentiator Number" mask="0x0000000F" name="ICDIFF"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="US_WPMR"
                      offset="0x00E4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="US_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="US_WPSR"
                      offset="0x00E8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0x00FFFF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
         <value-group caption="" name="US_MR__USART_MODE">
            <value caption="Normal mode" name="NORMAL" value="0x0"/>
            <value caption="RS485" name="RS485" value="0x1"/>
            <value caption="Hardware handshaking" name="HW_HANDSHAKING" value="0x2"/>
            <value caption="Modem" name="MODEM" value="0x3"/>
            <value caption="IS07816 Protocol: T = 0" name="IS07816_T_0" value="0x4"/>
            <value caption="IS07816 Protocol: T = 1" name="IS07816_T_1" value="0x6"/>
            <value caption="IrDA" name="IRDA" value="0x8"/>
            <value caption="LON" name="LON" value="0x9"/>
            <value caption="LIN Master mode" name="LIN_MASTER" value="0xA"/>
            <value caption="LIN Slave mode" name="LIN_SLAVE" value="0xB"/>
            <value caption="SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)"
                   name="SPI_MASTER"
                   value="0xE"/>
            <value caption="SPI Slave mode" name="SPI_SLAVE" value="0xF"/>
         </value-group>
         <value-group caption="" name="US_MR__USCLKS">
            <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
            <value caption="Peripheral clock divided (DIV = 8) is selected"
                   name="DIV"
                   value="0x1"/>
            <value caption="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1."
                   name="PCK"
                   value="0x2"/>
            <value caption="Serial clock (SCK) is selected" name="SCK" value="0x3"/>
         </value-group>
