Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Device Frame Number Register"
                      name="USBHS_DEVFNUM"
                      offset="0x0020"
                      rw="R"
                      size="4">
               <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
               <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
               <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
            </register>
            <register caption="Device Endpoint Configuration Register"
                      name="USBHS_DEVEPTCFG"
                      offset="0x100"
                      rw="RW"
                      size="4"
                      count="10">
               <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
               <bitfield caption="Endpoint Banks"
                         mask="0x0000000C"
                         name="EPBK"
                         values="USBHS_DEVEPTCFG__EPBK"/>
               <bitfield caption="Endpoint Size"
                         mask="0x00000070"
                         name="EPSIZE"
                         values="USBHS_DEVEPTCFG__EPSIZE"/>
               <bitfield caption="Endpoint Direction"
                         mask="0x00000100"
                         name="EPDIR"
                         values="USBHS_DEVEPTCFG__EPDIR"/>
               <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
               <bitfield caption="Endpoint Type"
                         mask="0x00001800"
                         name="EPTYPE"
                         values="USBHS_DEVEPTCFG__EPTYPE"/>
               <bitfield caption="Number of transactions per microframe for isochronous endpoint"
                         mask="0x00006000"
                         name="NBTRANS"
                         values="USBHS_DEVEPTCFG__NBTRANS"/>
            </register>
            <register caption="Device Endpoint Interrupt Status Register"
                      name="USBHS_DEVEPTISR"
                      offset="0x130"
                      rw="R"
                      size="4"
                      count="10">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Data Interrupt"
                         mask="0x00000001"
                         name="TXINI"/>
               <bitfield caption="Received OUT Data Interrupt"
                         mask="0x00000002"
                         name="RXOUTI"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt"
                         mask="0x00000004"
                         name="RXSTPI"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt"
                         mask="0x00000004"
                         name="UNDERFI"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt"
                         mask="0x00000008"
                         name="NAKOUTI"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt"
                         mask="0x00000008"
                         name="HBISOINERRI"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt"
                         mask="0x00000010"
                         name="NAKINI"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt"
                         mask="0x00000010"
                         name="HBISOFLUSHI"/>
               <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt"
                         mask="0x00000040"
                         name="STALLEDI"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt"
                         mask="0x00000040"
                         name="CRCERRI"/>
               <bitfield caption="Short Packet Interrupt"
                         mask="0x00000080"
                         name="SHORTPACKET"/>
               <bitfield caption="Data Toggle Sequence"
                         mask="0x00000300"
                         name="DTSEQ"
                         values="USBHS_DEVEPTISR__DTSEQ"/>
               <bitfield modes="ISO"
                         caption="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"
                         mask="0x00000400"
                         name="ERRORTRANS"/>
               <bitfield caption="Number of Busy Banks"
                         mask="0x00003000"
                         name="NBUSYBK"
                         values="USBHS_DEVEPTISR__NBUSYBK"/>
               <bitfield caption="Current Bank"
                         mask="0x0000C000"
                         name="CURRBK"
                         values="USBHS_DEVEPTISR__CURRBK"/>
               <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Control Direction"
                         mask="0x00020000"
                         name="CTRLDIR"/>
               <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
               <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
            </register>
