Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Device Endpoint Interrupt Clear Register"
                      name="USBHS_DEVEPTICR"
                      offset="0x160"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="clear:USBHS_DEVEPTISR">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Data Interrupt Clear"
                         mask="0x00000001"
                         name="TXINIC"/>
               <bitfield caption="Received OUT Data Interrupt Clear"
                         mask="0x00000002"
                         name="RXOUTIC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt Clear"
                         mask="0x00000004"
                         name="RXSTPIC"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt Clear"
                         mask="0x00000004"
                         name="UNDERFIC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt Clear"
                         mask="0x00000008"
                         name="NAKOUTIC"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"
                         mask="0x00000008"
                         name="HBISOINERRIC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt Clear"
                         mask="0x00000010"
                         name="NAKINIC"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt Clear"
                         mask="0x00000010"
                         name="HBISOFLUSHIC"/>
               <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt Clear"
                         mask="0x00000040"
                         name="STALLEDIC"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Clear"
                         mask="0x00000040"
                         name="CRCERRIC"/>
               <bitfield caption="Short Packet Interrupt Clear"
                         mask="0x00000080"
                         name="SHORTPACKETC"/>
            </register>
            <register caption="Device Endpoint Interrupt Set Register"
                      name="USBHS_DEVEPTIFR"
                      offset="0x190"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="set:USBHS_DEVEPTISR">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Data Interrupt Set"
                         mask="0x00000001"
                         name="TXINIS"/>
               <bitfield caption="Received OUT Data Interrupt Set"
                         mask="0x00000002"
                         name="RXOUTIS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt Set"
                         mask="0x00000004"
                         name="RXSTPIS"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt Set"
                         mask="0x00000004"
                         name="UNDERFIS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt Set"
                         mask="0x00000008"
                         name="NAKOUTIS"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt Set"
                         mask="0x00000008"
                         name="HBISOINERRIS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt Set"
                         mask="0x00000010"
                         name="NAKINIS"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt Set"
                         mask="0x00000010"
                         name="HBISOFLUSHIS"/>
               <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt Set"
                         mask="0x00000040"
                         name="STALLEDIS"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Set"
                         mask="0x00000040"
                         name="CRCERRIS"/>
               <bitfield caption="Short Packet Interrupt Set"
                         mask="0x00000080"
                         name="SHORTPACKETS"/>
               <bitfield caption="Number of Busy Banks Interrupt Set"
                         mask="0x00001000"
                         name="NBUSYBKS"/>
            </register>
            <register caption="Device Endpoint Interrupt Mask Register"
                      name="USBHS_DEVEPTIMR"
                      offset="0x1C0"
                      rw="R"
                      size="4"
                      count="10">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Data Interrupt"
                         mask="0x00000001"
                         name="TXINE"/>
               <bitfield caption="Received OUT Data Interrupt"
                         mask="0x00000002"
                         name="RXOUTE"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt"
                         mask="0x00000004"
                         name="RXSTPE"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt"
                         mask="0x00000004"
                         name="UNDERFE"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt"
                         mask="0x00000008"
                         name="NAKOUTE"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt"
                         mask="0x00000008"
                         name="HBISOINERRE"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt"
                         mask="0x00000010"
                         name="NAKINE"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt"
                         mask="0x00000010"
                         name="HBISOFLUSHE"/>
               <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt"
                         mask="0x00000040"
                         name="STALLEDE"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt"
                         mask="0x00000040"
                         name="CRCERRE"/>
               <bitfield caption="Short Packet Interrupt"
                         mask="0x00000080"
                         name="SHORTPACKETE"/>
               <bitfield modes="ISO"
                         caption="MData Interrupt"
                         mask="0x00000100"
                         name="MDATAE"/>
               <bitfield modes="ISO"
                         caption="DataX Interrupt"
                         mask="0x00000200"
                         name="DATAXE"/>
               <bitfield modes="ISO"
                         caption="Transaction Error Interrupt"
                         mask="0x00000400"
                         name="ERRORTRANSE"/>
               <bitfield caption="Number of Busy Banks Interrupt"
                         mask="0x00001000"
                         name="NBUSYBKE"/>
               <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
               <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
               <bitfield caption="Endpoint Interrupts Disable HDMA Request"
                         mask="0x00010000"
                         name="EPDISHDMA"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NYET Token Disable"
                         mask="0x00020000"
                         name="NYETDIS"/>
               <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALL Request"
                         mask="0x00080000"
                         name="STALLRQ"/>
            </register>
            <register caption="Device Endpoint Interrupt Enable Register"
                      name="USBHS_DEVEPTIER"
                      offset="0x1F0"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="set:USBHS_DEVEPTIMR">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Data Interrupt Enable"
                         mask="0x00000001"
                         name="TXINES"/>
               <bitfield caption="Received OUT Data Interrupt Enable"
                         mask="0x00000002"
                         name="RXOUTES"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt Enable"
                         mask="0x00000004"
                         name="RXSTPES"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt Enable"
                         mask="0x00000004"
                         name="UNDERFES"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt Enable"
                         mask="0x00000008"
                         name="NAKOUTES"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"
                         mask="0x00000008"
                         name="HBISOINERRES"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt Enable"
                         mask="0x00000010"
                         name="NAKINES"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt Enable"
                         mask="0x00000010"
                         name="HBISOFLUSHES"/>
               <bitfield caption="Overflow Interrupt Enable"
                         mask="0x00000020"
                         name="OVERFES"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt Enable"
                         mask="0x00000040"
                         name="STALLEDES"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Enable"
                         mask="0x00000040"
                         name="CRCERRES"/>
               <bitfield caption="Short Packet Interrupt Enable"
                         mask="0x00000080"
                         name="SHORTPACKETES"/>
               <bitfield modes="ISO"
                         caption="MData Interrupt Enable"
                         mask="0x00000100"
                         name="MDATAES"/>
               <bitfield modes="ISO"
                         caption="DataX Interrupt Enable"
                         mask="0x00000200"
                         name="DATAXES"/>
               <bitfield modes="ISO"
                         caption="Transaction Error Interrupt Enable"
                         mask="0x00000400"
                         name="ERRORTRANSES"/>
               <bitfield caption="Number of Busy Banks Interrupt Enable"
                         mask="0x00001000"
                         name="NBUSYBKES"/>
               <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
               <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
               <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable"
                         mask="0x00010000"
                         name="EPDISHDMAS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NYET Token Disable Enable"
                         mask="0x00020000"
                         name="NYETDISS"/>
               <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALL Request Enable"
                         mask="0x00080000"
                         name="STALLRQS"/>
            </register>
            <register caption="Device Endpoint Interrupt Disable Register"
                      name="USBHS_DEVEPTIDR"
                      offset="0x220"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="clear:USBHS_DEVEPTIMR">
               <mode name="CTRL"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_DEVEPTCFG.EPTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Transmitted IN Interrupt Clear"
                         mask="0x00000001"
                         name="TXINEC"/>
               <bitfield caption="Received OUT Data Interrupt Clear"
                         mask="0x00000002"
                         name="RXOUTEC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received SETUP Interrupt Clear"
                         mask="0x00000004"
                         name="RXSTPEC"/>
               <bitfield modes="ISO"
                         caption="Underflow Interrupt Clear"
                         mask="0x00000004"
                         name="UNDERFEC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed OUT Interrupt Clear"
                         mask="0x00000008"
                         name="NAKOUTEC"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"
                         mask="0x00000008"
                         name="HBISOINERREC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NAKed IN Interrupt Clear"
                         mask="0x00000010"
                         name="NAKINEC"/>
               <bitfield modes="ISO"
                         caption="High Bandwidth Isochronous IN Flush Interrupt Clear"
                         mask="0x00000010"
                         name="HBISOFLUSHEC"/>
               <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALLed Interrupt Clear"
                         mask="0x00000040"
                         name="STALLEDEC"/>
               <bitfield caption="Shortpacket Interrupt Clear"
                         mask="0x00000080"
                         name="SHORTPACKETEC"/>
               <bitfield modes="ISO"
                         caption="MData Interrupt Clear"
                         mask="0x00000100"
                         name="MDATAEC"/>
               <bitfield modes="ISO"
                         caption="DataX Interrupt Clear"
                         mask="0x00000200"
                         name="DATAXEC"/>
               <bitfield modes="ISO"
                         caption="Transaction Error Interrupt Clear"
                         mask="0x00000400"
                         name="ERRORTRANSEC"/>
               <bitfield caption="Number of Busy Banks Interrupt Clear"
                         mask="0x00001000"
                         name="NBUSYBKEC"/>
               <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
               <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear"
                         mask="0x00010000"
                         name="EPDISHDMAC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="NYET Token Disable Clear"
                         mask="0x00020000"
                         name="NYETDISC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="STALL Request Clear"
                         mask="0x00080000"
                         name="STALLRQC"/>
            </register>
            <register-group caption="Device DMA Channel Next Descriptor Address Register"
                            offset="0x310"
                            name="USBHS_DEVDMA"
                            size="16"
                            count="7"
                            name-in-module="USBHS_DEVDMA"/>
            <register caption="Host General Control Register"
                      name="USBHS_HSTCTRL"
                      offset="0x0400"
                      rw="RW"
                      size="4">
               <bitfield caption="Start of Frame Generation Enable"
                         mask="0x00000100"
                         name="SOFE"/>
               <bitfield caption="Send USB Reset" mask="0x00000200" name="RESET"/>
               <bitfield caption="Send USB Resume" mask="0x00000400" name="RESUME"/>
               <bitfield caption="Mode Configuration"
                         mask="0x00003000"
                         name="SPDCONF"
                         values="USBHS_HSTCTRL__SPDCONF"/>
            </register>
            <register caption="Host Global Interrupt Status Register"
                      name="USBHS_HSTISR"
                      offset="0x0404"
                      rw="R"
                      size="4">
               <bitfield caption="Device Connection Interrupt"
                         mask="0x00000001"
                         name="DCONNI"/>
               <bitfield caption="Device Disconnection Interrupt"
                         mask="0x00000002"
                         name="DDISCI"/>
               <bitfield caption="USB Reset Sent Interrupt" mask="0x00000004" name="RSTI"/>
               <bitfield caption="Downstream Resume Sent Interrupt"
                         mask="0x00000008"
                         name="RSMEDI"/>
               <bitfield caption="Upstream Resume Received Interrupt"
                         mask="0x00000010"
                         name="RXRSMI"/>
               <bitfield caption="Host Start of Frame Interrupt"
                         mask="0x00000020"
                         name="HSOFI"/>
               <bitfield caption="Host Wake-Up Interrupt" mask="0x00000040" name="HWUPI"/>
               <bitfield caption="Pipe 0 Interrupt" mask="0x00000100" name="PEP_0"/>
               <bitfield caption="Pipe 1 Interrupt" mask="0x00000200" name="PEP_1"/>
               <bitfield caption="Pipe 2 Interrupt" mask="0x00000400" name="PEP_2"/>
               <bitfield caption="Pipe 3 Interrupt" mask="0x00000800" name="PEP_3"/>
               <bitfield caption="Pipe 4 Interrupt" mask="0x00001000" name="PEP_4"/>
               <bitfield caption="Pipe 5 Interrupt" mask="0x00002000" name="PEP_5"/>
               <bitfield caption="Pipe 6 Interrupt" mask="0x00004000" name="PEP_6"/>
               <bitfield caption="Pipe 7 Interrupt" mask="0x00008000" name="PEP_7"/>
               <bitfield caption="Pipe 8 Interrupt" mask="0x00010000" name="PEP_8"/>
               <bitfield caption="Pipe 9 Interrupt" mask="0x00020000" name="PEP_9"/>
               <bitfield caption="DMA Channel 0 Interrupt" mask="0x02000000" name="DMA_1"/>
               <bitfield caption="DMA Channel 1 Interrupt" mask="0x04000000" name="DMA_2"/>
               <bitfield caption="DMA Channel 2 Interrupt" mask="0x08000000" name="DMA_3"/>
               <bitfield caption="DMA Channel 3 Interrupt" mask="0x10000000" name="DMA_4"/>
               <bitfield caption="DMA Channel 4 Interrupt" mask="0x20000000" name="DMA_5"/>
               <bitfield caption="DMA Channel 5 Interrupt" mask="0x40000000" name="DMA_6"/>
               <bitfield caption="DMA Channel 6 Interrupt" mask="0x80000000" name="DMA_7"/>
            </register>
