Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Host Global Interrupt Clear Register"
                      name="USBHS_HSTICR"
                      offset="0x0408"
                      rw="W"
                      size="4"
                      atomic-op="clear:USBHS_HSTISR">
               <bitfield caption="Device Connection Interrupt Clear"
                         mask="0x00000001"
                         name="DCONNIC"/>
               <bitfield caption="Device Disconnection Interrupt Clear"
                         mask="0x00000002"
                         name="DDISCIC"/>
               <bitfield caption="USB Reset Sent Interrupt Clear"
                         mask="0x00000004"
                         name="RSTIC"/>
               <bitfield caption="Downstream Resume Sent Interrupt Clear"
                         mask="0x00000008"
                         name="RSMEDIC"/>
               <bitfield caption="Upstream Resume Received Interrupt Clear"
                         mask="0x00000010"
                         name="RXRSMIC"/>
               <bitfield caption="Host Start of Frame Interrupt Clear"
                         mask="0x00000020"
                         name="HSOFIC"/>
               <bitfield caption="Host Wake-Up Interrupt Clear"
                         mask="0x00000040"
                         name="HWUPIC"/>
            </register>
            <register caption="Host Global Interrupt Set Register"
                      name="USBHS_HSTIFR"
                      offset="0x040C"
                      rw="W"
                      size="4"
                      atomic-op="set:USBHS_HSTISR">
               <bitfield caption="Device Connection Interrupt Set"
                         mask="0x00000001"
                         name="DCONNIS"/>
               <bitfield caption="Device Disconnection Interrupt Set"
                         mask="0x00000002"
                         name="DDISCIS"/>
               <bitfield caption="USB Reset Sent Interrupt Set"
                         mask="0x00000004"
                         name="RSTIS"/>
               <bitfield caption="Downstream Resume Sent Interrupt Set"
                         mask="0x00000008"
                         name="RSMEDIS"/>
               <bitfield caption="Upstream Resume Received Interrupt Set"
                         mask="0x00000010"
                         name="RXRSMIS"/>
               <bitfield caption="Host Start of Frame Interrupt Set"
                         mask="0x00000020"
                         name="HSOFIS"/>
               <bitfield caption="Host Wake-Up Interrupt Set"
                         mask="0x00000040"
                         name="HWUPIS"/>
               <bitfield caption="DMA Channel 0 Interrupt Set"
                         mask="0x02000000"
                         name="DMA_1"/>
               <bitfield caption="DMA Channel 1 Interrupt Set"
                         mask="0x04000000"
                         name="DMA_2"/>
               <bitfield caption="DMA Channel 2 Interrupt Set"
                         mask="0x08000000"
                         name="DMA_3"/>
               <bitfield caption="DMA Channel 3 Interrupt Set"
                         mask="0x10000000"
                         name="DMA_4"/>
               <bitfield caption="DMA Channel 4 Interrupt Set"
                         mask="0x20000000"
                         name="DMA_5"/>
               <bitfield caption="DMA Channel 5 Interrupt Set"
                         mask="0x40000000"
                         name="DMA_6"/>
               <bitfield caption="DMA Channel 6 Interrupt Set"
                         mask="0x80000000"
                         name="DMA_7"/>
            </register>
            <register caption="Host Global Interrupt Mask Register"
                      name="USBHS_HSTIMR"
                      offset="0x0410"
                      rw="R"
                      size="4">
               <bitfield caption="Device Connection Interrupt Enable"
                         mask="0x00000001"
                         name="DCONNIE"/>
               <bitfield caption="Device Disconnection Interrupt Enable"
                         mask="0x00000002"
                         name="DDISCIE"/>
               <bitfield caption="USB Reset Sent Interrupt Enable"
                         mask="0x00000004"
                         name="RSTIE"/>
               <bitfield caption="Downstream Resume Sent Interrupt Enable"
                         mask="0x00000008"
                         name="RSMEDIE"/>
               <bitfield caption="Upstream Resume Received Interrupt Enable"
                         mask="0x00000010"
                         name="RXRSMIE"/>
               <bitfield caption="Host Start of Frame Interrupt Enable"
                         mask="0x00000020"
                         name="HSOFIE"/>
               <bitfield caption="Host Wake-Up Interrupt Enable"
                         mask="0x00000040"
                         name="HWUPIE"/>
               <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
               <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
               <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
               <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
               <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
               <bitfield caption="Pipe 5 Interrupt Enable" mask="0x00002000" name="PEP_5"/>
               <bitfield caption="Pipe 6 Interrupt Enable" mask="0x00004000" name="PEP_6"/>
               <bitfield caption="Pipe 7 Interrupt Enable" mask="0x00008000" name="PEP_7"/>
               <bitfield caption="Pipe 8 Interrupt Enable" mask="0x00010000" name="PEP_8"/>
               <bitfield caption="Pipe 9 Interrupt Enable" mask="0x00020000" name="PEP_9"/>
               <bitfield caption="DMA Channel 0 Interrupt Enable"
                         mask="0x02000000"
                         name="DMA_1"/>
               <bitfield caption="DMA Channel 1 Interrupt Enable"
                         mask="0x04000000"
                         name="DMA_2"/>
               <bitfield caption="DMA Channel 2 Interrupt Enable"
                         mask="0x08000000"
                         name="DMA_3"/>
               <bitfield caption="DMA Channel 3 Interrupt Enable"
                         mask="0x10000000"
                         name="DMA_4"/>
               <bitfield caption="DMA Channel 4 Interrupt Enable"
                         mask="0x20000000"
                         name="DMA_5"/>
               <bitfield caption="DMA Channel 5 Interrupt Enable"
                         mask="0x40000000"
                         name="DMA_6"/>
               <bitfield caption="DMA Channel 6 Interrupt Enable"
                         mask="0x80000000"
                         name="DMA_7"/>
            </register>
            <register caption="Host Global Interrupt Disable Register"
                      name="USBHS_HSTIDR"
                      offset="0x0414"
                      rw="W"
                      size="4"
                      atomic-op="clear:USBHS_HSTIMR">
               <bitfield caption="Device Connection Interrupt Disable"
                         mask="0x00000001"
                         name="DCONNIEC"/>
               <bitfield caption="Device Disconnection Interrupt Disable"
                         mask="0x00000002"
                         name="DDISCIEC"/>
               <bitfield caption="USB Reset Sent Interrupt Disable"
                         mask="0x00000004"
                         name="RSTIEC"/>
               <bitfield caption="Downstream Resume Sent Interrupt Disable"
                         mask="0x00000008"
                         name="RSMEDIEC"/>
               <bitfield caption="Upstream Resume Received Interrupt Disable"
                         mask="0x00000010"
                         name="RXRSMIEC"/>
               <bitfield caption="Host Start of Frame Interrupt Disable"
                         mask="0x00000020"
                         name="HSOFIEC"/>
               <bitfield caption="Host Wake-Up Interrupt Disable"
                         mask="0x00000040"
                         name="HWUPIEC"/>
               <bitfield caption="Pipe 0 Interrupt Disable" mask="0x00000100" name="PEP_0"/>
               <bitfield caption="Pipe 1 Interrupt Disable" mask="0x00000200" name="PEP_1"/>
               <bitfield caption="Pipe 2 Interrupt Disable" mask="0x00000400" name="PEP_2"/>
               <bitfield caption="Pipe 3 Interrupt Disable" mask="0x00000800" name="PEP_3"/>
               <bitfield caption="Pipe 4 Interrupt Disable" mask="0x00001000" name="PEP_4"/>
               <bitfield caption="Pipe 5 Interrupt Disable" mask="0x00002000" name="PEP_5"/>
               <bitfield caption="Pipe 6 Interrupt Disable" mask="0x00004000" name="PEP_6"/>
               <bitfield caption="Pipe 7 Interrupt Disable" mask="0x00008000" name="PEP_7"/>
               <bitfield caption="Pipe 8 Interrupt Disable" mask="0x00010000" name="PEP_8"/>
               <bitfield caption="Pipe 9 Interrupt Disable" mask="0x00020000" name="PEP_9"/>
               <bitfield caption="DMA Channel 0 Interrupt Disable"
                         mask="0x02000000"
                         name="DMA_1"/>
               <bitfield caption="DMA Channel 1 Interrupt Disable"
                         mask="0x04000000"
                         name="DMA_2"/>
               <bitfield caption="DMA Channel 2 Interrupt Disable"
                         mask="0x08000000"
                         name="DMA_3"/>
               <bitfield caption="DMA Channel 3 Interrupt Disable"
                         mask="0x10000000"
                         name="DMA_4"/>
               <bitfield caption="DMA Channel 4 Interrupt Disable"
                         mask="0x20000000"
                         name="DMA_5"/>
               <bitfield caption="DMA Channel 5 Interrupt Disable"
                         mask="0x40000000"
                         name="DMA_6"/>
               <bitfield caption="DMA Channel 6 Interrupt Disable"
                         mask="0x80000000"
                         name="DMA_7"/>
            </register>
            <register caption="Host Global Interrupt Enable Register"
                      name="USBHS_HSTIER"
                      offset="0x0418"
                      rw="W"
                      size="4"
                      atomic-op="set:USBHS_HSTIMR">
               <bitfield caption="Device Connection Interrupt Enable"
                         mask="0x00000001"
                         name="DCONNIES"/>
               <bitfield caption="Device Disconnection Interrupt Enable"
                         mask="0x00000002"
                         name="DDISCIES"/>
               <bitfield caption="USB Reset Sent Interrupt Enable"
                         mask="0x00000004"
                         name="RSTIES"/>
               <bitfield caption="Downstream Resume Sent Interrupt Enable"
                         mask="0x00000008"
                         name="RSMEDIES"/>
               <bitfield caption="Upstream Resume Received Interrupt Enable"
                         mask="0x00000010"
                         name="RXRSMIES"/>
               <bitfield caption="Host Start of Frame Interrupt Enable"
                         mask="0x00000020"
                         name="HSOFIES"/>
               <bitfield caption="Host Wake-Up Interrupt Enable"
                         mask="0x00000040"
                         name="HWUPIES"/>
               <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
               <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
               <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
               <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
               <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
               <bitfield caption="Pipe 5 Interrupt Enable" mask="0x00002000" name="PEP_5"/>
               <bitfield caption="Pipe 6 Interrupt Enable" mask="0x00004000" name="PEP_6"/>
               <bitfield caption="Pipe 7 Interrupt Enable" mask="0x00008000" name="PEP_7"/>
               <bitfield caption="Pipe 8 Interrupt Enable" mask="0x00010000" name="PEP_8"/>
               <bitfield caption="Pipe 9 Interrupt Enable" mask="0x00020000" name="PEP_9"/>
               <bitfield caption="DMA Channel 0 Interrupt Enable"
                         mask="0x02000000"
                         name="DMA_1"/>
               <bitfield caption="DMA Channel 1 Interrupt Enable"
                         mask="0x04000000"
                         name="DMA_2"/>
               <bitfield caption="DMA Channel 2 Interrupt Enable"
                         mask="0x08000000"
                         name="DMA_3"/>
               <bitfield caption="DMA Channel 3 Interrupt Enable"
                         mask="0x10000000"
                         name="DMA_4"/>
               <bitfield caption="DMA Channel 4 Interrupt Enable"
                         mask="0x20000000"
                         name="DMA_5"/>
               <bitfield caption="DMA Channel 5 Interrupt Enable"
                         mask="0x40000000"
                         name="DMA_6"/>
               <bitfield caption="DMA Channel 6 Interrupt Enable"
                         mask="0x80000000"
                         name="DMA_7"/>
            </register>
            <register caption="Host Pipe Register"
                      name="USBHS_HSTPIP"
                      offset="0x0041C"
                      rw="RW"
                      size="4">
               <bitfield caption="Pipe 0 Enable" mask="0x00000001" name="PEN0"/>
               <bitfield caption="Pipe 1 Enable" mask="0x00000002" name="PEN1"/>
               <bitfield caption="Pipe 2 Enable" mask="0x00000004" name="PEN2"/>
               <bitfield caption="Pipe 3 Enable" mask="0x00000008" name="PEN3"/>
               <bitfield caption="Pipe 4 Enable" mask="0x00000010" name="PEN4"/>
               <bitfield caption="Pipe 5 Enable" mask="0x00000020" name="PEN5"/>
               <bitfield caption="Pipe 6 Enable" mask="0x00000040" name="PEN6"/>
               <bitfield caption="Pipe 7 Enable" mask="0x00000080" name="PEN7"/>
               <bitfield caption="Pipe 8 Enable" mask="0x00000100" name="PEN8"/>
               <bitfield caption="Pipe 0 Reset" mask="0x00010000" name="PRST0"/>
               <bitfield caption="Pipe 1 Reset" mask="0x00020000" name="PRST1"/>
               <bitfield caption="Pipe 2 Reset" mask="0x00040000" name="PRST2"/>
               <bitfield caption="Pipe 3 Reset" mask="0x00080000" name="PRST3"/>
               <bitfield caption="Pipe 4 Reset" mask="0x00100000" name="PRST4"/>
               <bitfield caption="Pipe 5 Reset" mask="0x00200000" name="PRST5"/>
               <bitfield caption="Pipe 6 Reset" mask="0x00400000" name="PRST6"/>
               <bitfield caption="Pipe 7 Reset" mask="0x00800000" name="PRST7"/>
               <bitfield caption="Pipe 8 Reset" mask="0x01000000" name="PRST8"/>
            </register>
            <register caption="Host Frame Number Register"
                      name="USBHS_HSTFNUM"
                      offset="0x0420"
                      rw="RW"
                      size="4">
               <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
               <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
               <bitfield caption="Frame Length" mask="0x00FF0000" name="FLENHIGH"/>
            </register>
            <register caption="Host Address 1 Register"
                      name="USBHS_HSTADDR1"
                      offset="0x0424"
                      rw="RW"
                      size="4">
               <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP0"/>
               <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP1"/>
               <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP2"/>
               <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP3"/>
            </register>
