Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Host Address 2 Register"
                      name="USBHS_HSTADDR2"
                      offset="0x0428"
                      rw="RW"
                      size="4">
               <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP4"/>
               <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP5"/>
               <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP6"/>
               <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP7"/>
            </register>
            <register caption="Host Address 3 Register"
                      name="USBHS_HSTADDR3"
                      offset="0x042C"
                      rw="RW"
                      size="4">
               <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP8"/>
               <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP9"/>
            </register>
            <register caption="Host Pipe Configuration Register"
                      name="USBHS_HSTPIPCFG"
                      offset="0x500"
                      rw="RW"
                      size="4"
                      count="10">
               <mode name="DEFAULT" caption="Control Endpoints"/>
               <mode name="CTRL_BULK" caption="Control and Bulk Endpoints"/>
               <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
               <bitfield caption="Pipe Banks"
                         mask="0x0000000C"
                         name="PBK"
                         values="USBHS_HSTPIPCFG__PBK"/>
               <bitfield caption="Pipe Size"
                         mask="0x00000070"
                         name="PSIZE"
                         values="USBHS_HSTPIPCFG__PSIZE"/>
               <bitfield caption="Pipe Token"
                         mask="0x00000300"
                         name="PTOKEN"
                         values="USBHS_HSTPIPCFG__PTOKEN"/>
               <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
               <bitfield caption="Pipe Type"
                         mask="0x00003000"
                         name="PTYPE"
                         values="USBHS_HSTPIPCFG__PTYPE"/>
               <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
               <bitfield modes="CTRL_BULK"
                         caption="Ping Enable"
                         mask="0x00100000"
                         name="PINGEN"/>
               <bitfield modes="DEFAULT"
                         caption="Pipe Interrupt Request Frequency"
                         mask="0xFF000000"
                         name="INTFRQ"/>
               <bitfield modes="CTRL_BULK"
                         caption="bInterval Parameter for the Bulk-Out/Ping Transaction"
                         mask="0xFF000000"
                         name="BINTERVAL"/>
            </register>
            <register caption="Host Pipe Status Register"
                      name="USBHS_HSTPIPISR"
                      offset="0x530"
                      rw="R"
                      size="4"
                      count="10">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
               <bitfield caption="Transmitted OUT Data Interrupt"
                         mask="0x00000002"
                         name="TXOUTI"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt"
                         mask="0x00000004"
                         name="TXSTPI"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt"
                         mask="0x00000004"
                         name="UNDERFI"/>
               <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
               <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
               <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt"
                         mask="0x00000040"
                         name="RXSTALLDI"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt"
                         mask="0x00000040"
                         name="CRCERRI"/>
               <bitfield caption="Short Packet Interrupt"
                         mask="0x00000080"
                         name="SHORTPACKETI"/>
               <bitfield caption="Data Toggle Sequence"
                         mask="0x00000300"
                         name="DTSEQ"
                         values="USBHS_HSTPIPISR__DTSEQ"/>
               <bitfield caption="Number of Busy Banks"
                         mask="0x00003000"
                         name="NBUSYBK"
                         values="USBHS_HSTPIPISR__NBUSYBK"/>
               <bitfield caption="Current Bank"
                         mask="0x0000C000"
                         name="CURRBK"
                         values="USBHS_HSTPIPISR__CURRBK"/>
               <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
               <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
               <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
            </register>
