Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Host Pipe Clear Register"
                      name="USBHS_HSTPIPICR"
                      offset="0x560"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="clear:USBHS_HSTPIPISR">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt Clear"
                         mask="0x00000001"
                         name="RXINIC"/>
               <bitfield caption="Transmitted OUT Data Interrupt Clear"
                         mask="0x00000002"
                         name="TXOUTIC"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt Clear"
                         mask="0x00000004"
                         name="TXSTPIC"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt Clear"
                         mask="0x00000004"
                         name="UNDERFIC"/>
               <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
               <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt Clear"
                         mask="0x00000040"
                         name="RXSTALLDIC"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Clear"
                         mask="0x00000040"
                         name="CRCERRIC"/>
               <bitfield caption="Short Packet Interrupt Clear"
                         mask="0x00000080"
                         name="SHORTPACKETIC"/>
            </register>
            <register caption="Host Pipe Set Register"
                      name="USBHS_HSTPIPIFR"
                      offset="0x590"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="set:USBHS_HSTPIPISR">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt Set"
                         mask="0x00000001"
                         name="RXINIS"/>
               <bitfield caption="Transmitted OUT Data Interrupt Set"
                         mask="0x00000002"
                         name="TXOUTIS"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt Set"
                         mask="0x00000004"
                         name="TXSTPIS"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt Set"
                         mask="0x00000004"
                         name="UNDERFIS"/>
               <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
               <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
               <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt Set"
                         mask="0x00000040"
                         name="RXSTALLDIS"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Set"
                         mask="0x00000040"
                         name="CRCERRIS"/>
               <bitfield caption="Short Packet Interrupt Set"
                         mask="0x00000080"
                         name="SHORTPACKETIS"/>
               <bitfield caption="Number of Busy Banks Set"
                         mask="0x00001000"
                         name="NBUSYBKS"/>
            </register>
            <register caption="Host Pipe Mask Register"
                      name="USBHS_HSTPIPIMR"
                      offset="0x5C0"
                      rw="R"
                      size="4"
                      count="10">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt Enable"
                         mask="0x00000001"
                         name="RXINE"/>
               <bitfield caption="Transmitted OUT Data Interrupt Enable"
                         mask="0x00000002"
                         name="TXOUTE"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt Enable"
                         mask="0x00000004"
                         name="TXSTPE"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt Enable"
                         mask="0x00000004"
                         name="UNDERFIE"/>
               <bitfield caption="Pipe Error Interrupt Enable"
                         mask="0x00000008"
                         name="PERRE"/>
               <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
               <bitfield caption="Overflow Interrupt Enable"
                         mask="0x00000020"
                         name="OVERFIE"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt Enable"
                         mask="0x00000040"
                         name="RXSTALLDE"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Enable"
                         mask="0x00000040"
                         name="CRCERRE"/>
               <bitfield caption="Short Packet Interrupt Enable"
                         mask="0x00000080"
                         name="SHORTPACKETIE"/>
               <bitfield caption="Number of Busy Banks Interrupt Enable"
                         mask="0x00001000"
                         name="NBUSYBKE"/>
               <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
               <bitfield caption="Pipe Interrupts Disable HDMA Request Enable"
                         mask="0x00010000"
                         name="PDISHDMA"/>
               <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
               <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
            </register>
            <register caption="Host Pipe Enable Register"
                      name="USBHS_HSTPIPIER"
                      offset="0x5F0"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="set:USBHS_HSTPIPIMR">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt Enable"
                         mask="0x00000001"
                         name="RXINES"/>
               <bitfield caption="Transmitted OUT Data Interrupt Enable"
                         mask="0x00000002"
                         name="TXOUTES"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt Enable"
                         mask="0x00000004"
                         name="TXSTPES"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt Enable"
                         mask="0x00000004"
                         name="UNDERFIES"/>
               <bitfield caption="Pipe Error Interrupt Enable"
                         mask="0x00000008"
                         name="PERRES"/>
               <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
               <bitfield caption="Overflow Interrupt Enable"
                         mask="0x00000020"
                         name="OVERFIES"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt Enable"
                         mask="0x00000040"
                         name="RXSTALLDES"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Enable"
                         mask="0x00000040"
                         name="CRCERRES"/>
               <bitfield caption="Short Packet Interrupt Enable"
                         mask="0x00000080"
                         name="SHORTPACKETIES"/>
               <bitfield caption="Number of Busy Banks Enable"
                         mask="0x00001000"
                         name="NBUSYBKES"/>
               <bitfield caption="Pipe Interrupts Disable HDMA Request Enable"
                         mask="0x00010000"
                         name="PDISHDMAS"/>
               <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
               <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
            </register>
