Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="USBHS_DEVEPTCFG__EPSIZE">
            <value caption="8 bytes" name="8_BYTE" value="0x0"/>
            <value caption="16 bytes" name="16_BYTE" value="0x1"/>
            <value caption="32 bytes" name="32_BYTE" value="0x2"/>
            <value caption="64 bytes" name="64_BYTE" value="0x3"/>
            <value caption="128 bytes" name="128_BYTE" value="0x4"/>
            <value caption="256 bytes" name="256_BYTE" value="0x5"/>
            <value caption="512 bytes" name="512_BYTE" value="0x6"/>
            <value caption="1024 bytes" name="1024_BYTE" value="0x7"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTCFG__EPDIR">
            <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
            <value caption="The endpoint direction is IN (nor for control endpoints)."
                   name="IN"
                   value="1"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTCFG__EPTYPE">
            <value caption="Control" name="CTRL" value="0x0"/>
            <value caption="Isochronous" name="ISO" value="0x1"/>
            <value caption="Bulk" name="BLK" value="0x2"/>
            <value caption="Interrupt" name="INTRPT" value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTCFG__NBTRANS">
            <value caption="Reserved to endpoint that does not have the high-bandwidth isochronous capability."
                   name="_0_TRANS"
                   value="0x0"/>
            <value caption="Default value: one transaction per microframe."
                   name="_1_TRANS"
                   value="0x1"/>
            <value caption="Two transactions per microframe. This endpoint should be configured as double-bank."
                   name="_2_TRANS"
                   value="0x2"/>
            <value caption="Three transactions per microframe. This endpoint should be configured as triple-bank."
                   name="_3_TRANS"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTISR__DTSEQ">
            <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
            <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
            <value caption="Reserved for high-bandwidth isochronous endpoint"
                   name="DATA2"
                   value="0x2"/>
            <value caption="Reserved for high-bandwidth isochronous endpoint"
                   name="MDATA"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTISR__NBUSYBK">
            <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
            <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
            <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
            <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTISR__CURRBK">
            <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
            <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
            <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTCTRL__SPDCONF">
            <value caption="The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable."
                   name="NORMAL"
                   value="0x0"/>
            <value caption="For a better consumption, if high speed is not needed."
                   name="LOW_POWER"
                   value="0x1"/>
            <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
            <value caption="The host remains in Full-speed mode whatever the peripheral speed capability."
                   name="FORCED_FS"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPCFG__PBK">
            <value caption="Single-bank pipe" name="_1_BANK" value="0x0"/>
            <value caption="Double-bank pipe" name="_2_BANK" value="0x1"/>
            <value caption="Triple-bank pipe" name="_3_BANK" value="0x2"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPCFG__PSIZE">
            <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
            <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
            <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
            <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
            <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
            <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
            <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
            <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPCFG__PTOKEN">
            <value caption="SETUP" name="SETUP" value="0x0"/>
            <value caption="IN" name="IN" value="0x1"/>
            <value caption="OUT" name="OUT" value="0x2"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPCFG__PTYPE">
            <value caption="Control" name="CTRL" value="0x0"/>
            <value caption="Isochronous" name="ISO" value="0x1"/>
            <value caption="Bulk" name="BLK" value="0x2"/>
            <value caption="Interrupt" name="INTRPT" value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
            <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
            <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
            <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
            <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
            <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
            <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
            <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
            <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
            <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
         </value-group>
