Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
         <value-group caption="" name="USBHS_CTRL__UIMOD">
            <value caption="The module is in USB Host mode." name="HOST" value="0"/>
            <value caption="The module is in USB Device mode." name="DEVICE" value="1"/>
         </value-group>
         <value-group caption="" name="USBHS_SR__SPEED">
            <value caption="Full-Speed mode" name="FULL_SPEED" value="0x0"/>
            <value caption="High-Speed mode" name="HIGH_SPEED" value="0x1"/>
            <value caption="Low-Speed mode" name="LOW_SPEED" value="0x2"/>
         </value-group>
      </module>
      <module name="UTMI"
              caption="USB Transmitter Interface Macrocell"
              id="11300"
              version="A">
         <register-group name="UTMI">
            <register caption="OHCI Interrupt Configuration Register"
                      name="UTMI_OHCIICR"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="USB PORTx Reset" mask="0x00000001" name="RES0"/>
               <bitfield caption="OHCI Asynchronous Resume Interrupt Enable"
                         mask="0x00000010"
                         name="ARIE"/>
               <bitfield caption="Reserved" mask="0x00000020" name="APPSTART"/>
               <bitfield caption="USB Device Pull-up Disable"
                         mask="0x00800000"
                         name="UDPPUDIS"/>
            </register>
            <register caption="UTMI Clock Trimming Register"
                      name="UTMI_CKTRIM"
                      offset="0x30"
                      rw="RW"
                      size="4">
               <bitfield caption="UTMI Reference Clock Frequency"
                         mask="0x00000003"
                         name="FREQ"
                         values="UTMI_CKTRIM__FREQ"/>
            </register>
         </register-group>
         <value-group caption="" name="UTMI_CKTRIM__FREQ">
            <value caption="12 MHz reference clock" name="XTAL12" value="0"/>
            <value caption="16 MHz reference clock" name="XTAL16" value="1"/>
         </value-group>
      </module>
      <module name="WDT" caption="Watchdog Timer" id="6080" version="N">
         <register-group name="WDT">
            <register caption="Control Register"
                      name="WDT_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
               <bitfield caption="Password"
                         mask="0xFF000000"
                         name="KEY"
                         values="WDT_CR__KEY"/>
            </register>
            <register caption="Mode Register"
                      name="WDT_MR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
               <bitfield caption="Watchdog Fault Interrupt Enable"
                         mask="0x00001000"
                         name="WDFIEN"/>
               <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
               <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
               <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
               <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
               <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
            </register>
            <register caption="Status Register"
                      name="WDT_SR"
                      offset="0x08"
                      rw="R"
                      size="4">
               <bitfield caption="Watchdog Underflow (cleared on read)"
                         mask="0x00000001"
                         name="WDUNF"/>
               <bitfield caption="Watchdog Error (cleared on read)"
                         mask="0x00000002"
                         name="WDERR"/>
            </register>
         </register-group>
         <value-group caption="" name="WDT_CR__KEY">
            <value caption="Writing any other value in this field aborts the write operation."
                   name="PASSWD"
                   value="0xA5"/>
         </value-group>
      </module>
      <module name="XDMAC"
              caption="Extensible DMA Controller"
              id="11161"
              version="K">
         <register-group name="XDMAC_CHID" size="64">
            <register caption="Channel Interrupt Enable Register"
                      name="XDMAC_CIE"
                      offset="0x00"
                      rw="W"
                      size="4"
                      atomic-op="set:XDMAC_CIM">
               <bitfield caption="End of Block Interrupt Enable Bit"
                         mask="0x00000001"
                         name="BIE"/>
               <bitfield caption="End of Linked List Interrupt Enable Bit"
                         mask="0x00000002"
                         name="LIE"/>
               <bitfield caption="End of Disable Interrupt Enable Bit"
                         mask="0x00000004"
                         name="DIE"/>
               <bitfield caption="End of Flush Interrupt Enable Bit"
                         mask="0x00000008"
                         name="FIE"/>
               <bitfield caption="Read Bus Error Interrupt Enable Bit"
                         mask="0x00000010"
                         name="RBIE"/>
               <bitfield caption="Write Bus Error Interrupt Enable Bit"
                         mask="0x00000020"
                         name="WBIE"/>
               <bitfield caption="Request Overflow Error Interrupt Enable Bit"
                         mask="0x00000040"
                         name="ROIE"/>
            </register>
            <register caption="Channel Interrupt Disable Register"
                      name="XDMAC_CID"
                      offset="0x04"
                      rw="W"
                      size="4"
                      atomic-op="clear:XDMAC_CIM">
               <bitfield caption="End of Block Interrupt Disable Bit"
                         mask="0x00000001"
                         name="BID"/>
               <bitfield caption="End of Linked List Interrupt Disable Bit"
                         mask="0x00000002"
                         name="LID"/>
               <bitfield caption="End of Disable Interrupt Disable Bit"
                         mask="0x00000004"
                         name="DID"/>
               <bitfield caption="End of Flush Interrupt Disable Bit"
                         mask="0x00000008"
                         name="FID"/>
               <bitfield caption="Read Bus Error Interrupt Disable Bit"
                         mask="0x00000010"
                         name="RBEID"/>
               <bitfield caption="Write Bus Error Interrupt Disable Bit"
                         mask="0x00000020"
                         name="WBEID"/>
               <bitfield caption="Request Overflow Error Interrupt Disable Bit"
                         mask="0x00000040"
                         name="ROID"/>
            </register>
            <register caption="Channel Interrupt Mask Register"
                      name="XDMAC_CIM"
                      offset="0x08"
                      rw="R"
                      size="4">
               <bitfield caption="End of Block Interrupt Mask Bit"
                         mask="0x00000001"
                         name="BIM"/>
               <bitfield caption="End of Linked List Interrupt Mask Bit"
                         mask="0x00000002"
                         name="LIM"/>
               <bitfield caption="End of Disable Interrupt Mask Bit"
                         mask="0x00000004"
                         name="DIM"/>
               <bitfield caption="End of Flush Interrupt Mask Bit"
                         mask="0x00000008"
                         name="FIM"/>
               <bitfield caption="Read Bus Error Interrupt Mask Bit"
                         mask="0x00000010"
                         name="RBEIM"/>
               <bitfield caption="Write Bus Error Interrupt Mask Bit"
                         mask="0x00000020"
                         name="WBEIM"/>
               <bitfield caption="Request Overflow Error Interrupt Mask Bit"
                         mask="0x00000040"
                         name="ROIM"/>
            </register>
            <register caption="Channel Interrupt Status Register"
                      name="XDMAC_CIS"
                      offset="0x0C"
                      rw="R"
                      size="4">
               <bitfield caption="End of Block Interrupt Status Bit"
                         mask="0x00000001"
                         name="BIS"/>
               <bitfield caption="End of Linked List Interrupt Status Bit"
                         mask="0x00000002"
                         name="LIS"/>
               <bitfield caption="End of Disable Interrupt Status Bit"
                         mask="0x00000004"
                         name="DIS"/>
               <bitfield caption="End of Flush Interrupt Status Bit"
                         mask="0x00000008"
                         name="FIS"/>
               <bitfield caption="Read Bus Error Interrupt Status Bit"
                         mask="0x00000010"
                         name="RBEIS"/>
               <bitfield caption="Write Bus Error Interrupt Status Bit"
                         mask="0x00000020"
                         name="WBEIS"/>
               <bitfield caption="Request Overflow Error Interrupt Status Bit"
                         mask="0x00000040"
                         name="ROIS"/>
            </register>
