Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register caption="Channel Source Microblock Stride"
                      name="XDMAC_CSUS"
                      offset="0x30"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Source Microblock Stride"
                         mask="0x00FFFFFF"
                         name="SUBS"/>
            </register>
            <register caption="Channel Destination Microblock Stride"
                      name="XDMAC_CDUS"
                      offset="0x34"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Destination Microblock Stride"
                         mask="0x00FFFFFF"
                         name="DUBS"/>
            </register>
         </register-group>
         <register-group name="XDMAC">
            <register caption="Global Type Register"
                      name="XDMAC_GTYPE"
                      offset="0x00"
                      rw="R"
                      size="4">
               <bitfield caption="Number of Channels Minus One"
                         mask="0x0000001F"
                         name="NB_CH"/>
               <bitfield caption="Number of Bytes" mask="0x0000FFE0" name="FIFO_SZ"/>
               <bitfield caption="Number of Peripheral Requests Minus One"
                         mask="0x007F0000"
                         name="NB_REQ"/>
            </register>
            <register caption="Global Configuration Register"
                      name="XDMAC_GCFG"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Configuration Registers Clock Gating Disable"
                         mask="0x00000001"
                         name="CGDISREG"/>
               <bitfield caption="Pipeline Clock Gating Disable"
                         mask="0x00000002"
                         name="CGDISPIPE"/>
               <bitfield caption="FIFO Clock Gating Disable"
                         mask="0x00000004"
                         name="CGDISFIFO"/>
               <bitfield caption="Bus Interface Clock Gating Disable"
                         mask="0x00000008"
                         name="CGDISIF"/>
               <bitfield caption="Boundary X Kilobyte Enable"
                         mask="0x00000100"
                         name="BXKBEN"/>
            </register>
            <register caption="Global Weighted Arbiter Configuration Register"
                      name="XDMAC_GWAC"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Pool Weight 0" mask="0x0000000F" name="PW0"/>
               <bitfield caption="Pool Weight 1" mask="0x000000F0" name="PW1"/>
               <bitfield caption="Pool Weight 2" mask="0x00000F00" name="PW2"/>
               <bitfield caption="Pool Weight 3" mask="0x0000F000" name="PW3"/>
            </register>
            <register caption="Global Interrupt Enable Register"
                      name="XDMAC_GIE"
                      offset="0x0C"
                      rw="W"
                      size="4"
                      atomic-op="set:XDMAC_GIM">
               <bitfield caption="XDMAC Channel 0 Interrupt Enable Bit"
                         mask="0x00000001"
                         name="IE0"/>
               <bitfield caption="XDMAC Channel 1 Interrupt Enable Bit"
                         mask="0x00000002"
                         name="IE1"/>
               <bitfield caption="XDMAC Channel 2 Interrupt Enable Bit"
                         mask="0x00000004"
                         name="IE2"/>
               <bitfield caption="XDMAC Channel 3 Interrupt Enable Bit"
                         mask="0x00000008"
                         name="IE3"/>
               <bitfield caption="XDMAC Channel 4 Interrupt Enable Bit"
                         mask="0x00000010"
                         name="IE4"/>
               <bitfield caption="XDMAC Channel 5 Interrupt Enable Bit"
                         mask="0x00000020"
                         name="IE5"/>
               <bitfield caption="XDMAC Channel 6 Interrupt Enable Bit"
                         mask="0x00000040"
                         name="IE6"/>
               <bitfield caption="XDMAC Channel 7 Interrupt Enable Bit"
                         mask="0x00000080"
                         name="IE7"/>
               <bitfield caption="XDMAC Channel 8 Interrupt Enable Bit"
                         mask="0x00000100"
                         name="IE8"/>
               <bitfield caption="XDMAC Channel 9 Interrupt Enable Bit"
                         mask="0x00000200"
                         name="IE9"/>
               <bitfield caption="XDMAC Channel 10 Interrupt Enable Bit"
                         mask="0x00000400"
                         name="IE10"/>
               <bitfield caption="XDMAC Channel 11 Interrupt Enable Bit"
                         mask="0x00000800"
                         name="IE11"/>
               <bitfield caption="XDMAC Channel 12 Interrupt Enable Bit"
                         mask="0x00001000"
                         name="IE12"/>
               <bitfield caption="XDMAC Channel 13 Interrupt Enable Bit"
                         mask="0x00002000"
                         name="IE13"/>
               <bitfield caption="XDMAC Channel 14 Interrupt Enable Bit"
                         mask="0x00004000"
                         name="IE14"/>
               <bitfield caption="XDMAC Channel 15 Interrupt Enable Bit"
                         mask="0x00008000"
                         name="IE15"/>
               <bitfield caption="XDMAC Channel 16 Interrupt Enable Bit"
                         mask="0x00010000"
                         name="IE16"/>
               <bitfield caption="XDMAC Channel 17 Interrupt Enable Bit"
                         mask="0x00020000"
                         name="IE17"/>
               <bitfield caption="XDMAC Channel 18 Interrupt Enable Bit"
                         mask="0x00040000"
                         name="IE18"/>
               <bitfield caption="XDMAC Channel 19 Interrupt Enable Bit"
                         mask="0x00080000"
                         name="IE19"/>
               <bitfield caption="XDMAC Channel 20 Interrupt Enable Bit"
                         mask="0x00100000"
                         name="IE20"/>
               <bitfield caption="XDMAC Channel 21 Interrupt Enable Bit"
                         mask="0x00200000"
                         name="IE21"/>
               <bitfield caption="XDMAC Channel 22 Interrupt Enable Bit"
                         mask="0x00400000"
                         name="IE22"/>
               <bitfield caption="XDMAC Channel 23 Interrupt Enable Bit"
                         mask="0x00800000"
                         name="IE23"/>
            </register>
            <register caption="Global Interrupt Disable Register"
                      name="XDMAC_GID"
                      offset="0x10"
                      rw="W"
                      size="4"
                      atomic-op="clear:XDMAC_GIM">
               <bitfield caption="XDMAC Channel 0 Interrupt Disable Bit"
                         mask="0x00000001"
                         name="ID0"/>
               <bitfield caption="XDMAC Channel 1 Interrupt Disable Bit"
                         mask="0x00000002"
                         name="ID1"/>
               <bitfield caption="XDMAC Channel 2 Interrupt Disable Bit"
                         mask="0x00000004"
                         name="ID2"/>
               <bitfield caption="XDMAC Channel 3 Interrupt Disable Bit"
                         mask="0x00000008"
                         name="ID3"/>
               <bitfield caption="XDMAC Channel 4 Interrupt Disable Bit"
                         mask="0x00000010"
                         name="ID4"/>
               <bitfield caption="XDMAC Channel 5 Interrupt Disable Bit"
                         mask="0x00000020"
                         name="ID5"/>
               <bitfield caption="XDMAC Channel 6 Interrupt Disable Bit"
                         mask="0x00000040"
                         name="ID6"/>
               <bitfield caption="XDMAC Channel 7 Interrupt Disable Bit"
                         mask="0x00000080"
                         name="ID7"/>
               <bitfield caption="XDMAC Channel 8 Interrupt Disable Bit"
                         mask="0x00000100"
                         name="ID8"/>
               <bitfield caption="XDMAC Channel 9 Interrupt Disable Bit"
                         mask="0x00000200"
                         name="ID9"/>
               <bitfield caption="XDMAC Channel 10 Interrupt Disable Bit"
                         mask="0x00000400"
                         name="ID10"/>
               <bitfield caption="XDMAC Channel 11 Interrupt Disable Bit"
                         mask="0x00000800"
                         name="ID11"/>
               <bitfield caption="XDMAC Channel 12 Interrupt Disable Bit"
                         mask="0x00001000"
                         name="ID12"/>
               <bitfield caption="XDMAC Channel 13 Interrupt Disable Bit"
                         mask="0x00002000"
                         name="ID13"/>
               <bitfield caption="XDMAC Channel 14 Interrupt Disable Bit"
                         mask="0x00004000"
                         name="ID14"/>
               <bitfield caption="XDMAC Channel 15 Interrupt Disable Bit"
                         mask="0x00008000"
                         name="ID15"/>
               <bitfield caption="XDMAC Channel 16 Interrupt Disable Bit"
                         mask="0x00010000"
                         name="ID16"/>
               <bitfield caption="XDMAC Channel 17 Interrupt Disable Bit"
                         mask="0x00020000"
                         name="ID17"/>
               <bitfield caption="XDMAC Channel 18 Interrupt Disable Bit"
                         mask="0x00040000"
                         name="ID18"/>
               <bitfield caption="XDMAC Channel 19 Interrupt Disable Bit"
                         mask="0x00080000"
                         name="ID19"/>
               <bitfield caption="XDMAC Channel 20 Interrupt Disable Bit"
                         mask="0x00100000"
                         name="ID20"/>
               <bitfield caption="XDMAC Channel 21 Interrupt Disable Bit"
                         mask="0x00200000"
                         name="ID21"/>
               <bitfield caption="XDMAC Channel 22 Interrupt Disable Bit"
                         mask="0x00400000"
                         name="ID22"/>
               <bitfield caption="XDMAC Channel 23 Interrupt Disable Bit"
                         mask="0x00800000"
                         name="ID23"/>
            </register>
