Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/atdf/ATSAMV70N19B.atdf
            <register offset="0x00000020"
                      size="4"
                      name="RASR_A2"
                      caption="MPU Alias 2 Region Attribute and Size Register">
                </register>
            <register offset="0x00000024"
                      size="4"
                      name="RBAR_A3"
                      caption="MPU Alias 3 Region Base Address Register">
                </register>
            <register offset="0x00000028"
                      size="4"
                      name="RASR_A3"
                      caption="MPU Alias 3 Region Attribute and Size Register">
                </register>
         </register-group>
      </module>
      <module name="FPU" caption="Floating Point Unit">
         <register-group name="FPU" caption="Floating Point Unit Registers">
            <register offset="0x00000004"
                      size="4"
                      name="FPCCR"
                      initval="0xC0000000"
                      caption="Floating-point Context Control Register">
               <bitfield mask="0x00000001"
                         name="LSPACT"
                         caption="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred."/>
               <bitfield mask="0x00000002"
                         name="USER"
                         caption="Privilege level was user when the floating-point stack frame was allocated."/>
               <bitfield mask="0x00000008"
                         name="THREAD"
                         caption="Mode was Thread Mode when the floating-point stack frame was allocated."/>
               <bitfield mask="0x00000010"
                         name="HFRDY"
                         caption="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated."/>
               <bitfield mask="0x00000020"
                         name="MMRDY"
                         caption="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated."/>
               <bitfield mask="0x00000040"
                         name="BFRDY"
                         caption="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated."/>
               <bitfield mask="0x00000100"
                         name="MONRDY"
                         caption="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated."/>
               <bitfield mask="0x40000000"
                         name="LSPEN"
                         caption="Enable automatic lazy state preservation for floating-point context."/>
               <bitfield mask="0x80000000"
                         name="ASPEN"
                         caption="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit."/>
            </register>
            <register offset="0x00000008"
                      size="4"
                      name="FPCAR"
                      caption="Floating-point Context Address Register">
               <bitfield mask="0xFFFFFFF8"
                         name="ADDRESS"
                         caption="The location of the unpopulated floating-point register space allocated on an exception stack frame."/>
            </register>
            <register offset="0x0000000C"
                      size="4"
                      name="FPDSCR"
                      initval="0x00000000"
                      caption="Floating-point Default Status Control Register">
               <bitfield mask="0x00C00000"
                         name="RMode"
                         caption="Default value for FPSCR.RMode."/>
               <bitfield mask="0x01000000" name="FZ" caption="Default value for FPSCR.FZ."/>
               <bitfield mask="0x02000000" name="DN" caption="Default value for FPSCR.DN."/>
               <bitfield mask="0x04000000" name="AHP" caption="Default value for FPSCR.AHP."/>
            </register>
            <register offset="0x00000010"
                      size="4"
                      name="MVFR0"
                      initval="0x10110021"
                      rw="R"
                      caption="Media and VFP Feature Register 0">
               <bitfield mask="0x0000000F"
                         name="A_SIMD_registers"
                         caption="Indicates the size of the FP register bank"/>
               <bitfield mask="0x000000F0"
                         name="Single_precision"
                         caption="Indicates the hardware support for FP single-precision operations"/>
               <bitfield mask="0x00000F00"
                         name="Double_precision"
                         caption="Indicates the hardware support for FP double-precision operations"/>
               <bitfield mask="0x0000F000"
                         name="FP_excep_trapping"
                         caption="Indicates whether the FP hardware implementation supports exception trapping"/>
               <bitfield mask="0x000F0000"
                         name="Divide"
                         caption="Indicates the hardware support for FP divide operations"/>
               <bitfield mask="0x00F00000"
                         name="Square_root"
                         caption="Indicates the hardware support for FP square root operations"/>
               <bitfield mask="0x0F000000"
                         name="Short_vectors"
                         caption="Indicates the hardware support for FP short vectors"/>
               <bitfield mask="0xF0000000"
                         name="FP_rounding_modes"
                         caption="Indicates the rounding modes supported by the FP floating-point hardware"/>
            </register>
            <register offset="0x00000014"
                      size="4"
                      name="MVFR1"
                      initval="0x11000011"
                      rw="R"
                      caption="Media and VFP Feature Register 1">
               <bitfield mask="0x0000000F"
                         name="FtZ_mode"
                         caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
               <bitfield mask="0x000000F0"
                         name="D_NaN_mode"
                         caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
               <bitfield mask="0x0F000000"
                         name="FP_HPFP"
                         caption="Floating Point Half-Precision and double-precision"/>
               <bitfield mask="0xF0000000"
                         name="FP_fused_MAC"
                         caption="Indicates whether the FP supports fused multiply accumulate operations"/>
            </register>
            <register offset="0x00000018"
                      size="4"
                      name="MVFR2"
                      initval="0x00000040"
                      rw="R"
                      caption="Media and VFP Feature Register 2">
               <bitfield mask="0x000000F0"
                         name="VFP_Misc"
                         caption="Indicates the hardware support for FP miscellaneous features"/>
            </register>
         </register-group>
      </module>
      <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
      <module name="TPIU" caption="Trace Port Interface Unit (ETM)"/>
   </modules>
   <pinouts>
      <pinout name="TFBGA100">
         <pin position="D8" pad="PA0"/>
         <pin position="C10" pad="PA1"/>
         <pin position="D10" pad="PA2"/>
         <pin position="F9" pad="PA3"/>
         <pin position="H10" pad="PA4"/>
         <pin position="H9" pad="PA5"/>
         <pin position="J2" pad="PA7"/>
         <pin position="K2" pad="PA8"/>
         <pin position="J9" pad="PA9"/>
         <pin position="K9" pad="PA10"/>
         <pin position="J8" pad="PA11"/>
         <pin position="K10" pad="PA12"/>
         <pin position="G5" pad="PA13"/>
         <pin position="H6" pad="PA14"/>
         <pin position="J6" pad="PA15"/>
         <pin position="J5" pad="PA16"/>
         <pin position="G1" pad="PA17"/>
         <pin position="G2" pad="PA18"/>
         <pin position="F1" pad="PA19"/>
         <pin position="F2" pad="PA20"/>
         <pin position="J1" pad="PA21"/>
         <pin position="J3" pad="PA22"/>
         <pin position="K5" pad="PA23"/>
         <pin position="K7" pad="PA24"/>
         <pin position="H7" pad="PA25"/>
         <pin position="K8" pad="PA26"/>
         <pin position="H8" pad="PA27"/>
         <pin position="A9" pad="PA28"/>
         <pin position="C7" pad="PA30"/>
         <pin position="A7" pad="PA31"/>
         <pin position="E1" pad="PB0"/>
         <pin position="E2" pad="PB1"/>
         <pin position="H1" pad="PB2"/>
         <pin position="H2" pad="PB3"/>
         <pin position="B9" pad="PB4"/>
         <pin position="C8" pad="PB5"/>
         <pin position="G8" pad="PB6"/>
         <pin position="E9" pad="PB7"/>
         <pin position="A2" pad="PB8"/>
         <pin position="A1" pad="PB9"/>
         <pin position="F8" pad="PB12"/>
         <pin position="B2" pad="PB13"/>
         <pin position="C1" pad="PD0"/>
         <pin position="D2" pad="PD1"/>
         <pin position="E3" pad="PD2"/>
         <pin position="B5" pad="PD3"/>
         <pin position="A5" pad="PD4"/>
         <pin position="D5" pad="PD5"/>
         <pin position="B6" pad="PD6"/>
         <pin position="A6" pad="PD7"/>
         <pin position="B7" pad="PD8"/>
         <pin position="B8" pad="PD9"/>
         <pin position="C9" pad="PD10"/>
         <pin position="D9" pad="PD11"/>
         <pin position="E10" pad="PD12"/>
         <pin position="E8" pad="PD13"/>
         <pin position="F10" pad="PD14"/>
         <pin position="B10" pad="PD15"/>
         <pin position="G9" pad="PD16"/>
         <pin position="J10" pad="PD17"/>
         <pin position="K6" pad="PD18"/>
         <pin position="K4" pad="PD19"/>
         <pin position="K3" pad="PD20"/>
         <pin position="H5" pad="PD21"/>
         <pin position="J4" pad="PD22"/>
         <pin position="G4" pad="PD24"/>
         <pin position="H3" pad="PD25"/>
         <pin position="G3" pad="PD26"/>
         <pin position="H4" pad="PD27"/>
         <pin position="J7" pad="PD28"/>
         <pin position="K1" pad="PD30"/>
         <pin position="B1" pad="PD31"/>
         <pin position="C3" pad="VDDOUT"/>
         <pin position="C2" pad="VDDIN"/>
         <pin position="D3" pad="VREFN"/>
         <pin position="D1" pad="VREFP"/>
         <pin position="G10" pad="NRST"/>
         <pin position="F7" pad="TST"/>
         <pin position="C5" pad="VDDIO"/>
         <pin position="F3" pad="VDDIO"/>
         <pin position="G7" pad="VDDIO"/>
         <pin position="A10" pad="JTAGSEL"/>
         <pin position="C6" pad="VDDCORE"/>
         <pin position="D6" pad="VDDCORE"/>
         <pin position="G6" pad="VDDCORE"/>
         <pin position="D7" pad="VDDPLL"/>
         <pin position="E5" pad="VDDUTMII"/>
         <pin position="A4" pad="HSDM"/>
         <pin position="B4" pad="HSDP"/>
         <pin position="E7" pad="GND"/>
         <pin position="F4" pad="GND"/>
         <pin position="F5" pad="GND"/>
         <pin position="F6" pad="GND"/>
         <pin position="D4" pad="GNDANA"/>
         <pin position="A8" pad="GNDUTMI"/>
         <pin position="C4" pad="GNDPLLUSB"/>
         <pin position="E4" pad="GNDPLL"/>
         <pin position="B3" pad="VDDUTMIC"/>
         <pin position="A3" pad="VBG"/>
         <pin position="E6" pad="VDDPLLUSB"/>
      </pinout>
      <pinout name="LQFP100">
         <pin position="72" pad="PA0"/>
         <pin position="70" pad="PA1"/>
         <pin position="66" pad="PA2"/>
         <pin position="64" pad="PA3"/>
         <pin position="55" pad="PA4"/>
         <pin position="52" pad="PA5"/>
         <pin position="24" pad="PA7"/>
         <pin position="25" pad="PA8"/>
         <pin position="54" pad="PA9"/>
         <pin position="46" pad="PA10"/>
         <pin position="44" pad="PA11"/>
         <pin position="48" pad="PA12"/>
         <pin position="27" pad="PA13"/>
         <pin position="34" pad="PA14"/>
         <pin position="33" pad="PA15"/>
         <pin position="30" pad="PA16"/>
         <pin position="16" pad="PA17"/>
         <pin position="15" pad="PA18"/>
         <pin position="14" pad="PA19"/>
         <pin position="13" pad="PA20"/>
         <pin position="21" pad="PA21"/>
         <pin position="26" pad="PA22"/>
         <pin position="31" pad="PA23"/>
         <pin position="38" pad="PA24"/>
         <pin position="40" pad="PA25"/>
         <pin position="42" pad="PA26"/>
         <pin position="50" pad="PA27"/>
         <pin position="79" pad="PA28"/>
         <pin position="82" pad="PA30"/>
         <pin position="83" pad="PA31"/>
         <pin position="12" pad="PB0"/>
         <pin position="11" pad="PB1"/>
         <pin position="17" pad="PB2"/>
         <pin position="20" pad="PB3"/>
         <pin position="74" pad="PB4"/>
         <pin position="77" pad="PB5"/>
         <pin position="57" pad="PB6"/>
         <pin position="63" pad="PB7"/>
         <pin position="98" pad="PB8"/>
         <pin position="99" pad="PB9"/>
         <pin position="61" pad="PB12"/>
         <pin position="100" pad="PB13"/>
         <pin position="1" pad="PD0"/>
         <pin position="92" pad="PD1"/>
         <pin position="91" pad="PD2"/>
         <pin position="89" pad="PD3"/>
         <pin position="88" pad="PD4"/>
         <pin position="87" pad="PD5"/>
         <pin position="85" pad="PD6"/>
         <pin position="84" pad="PD7"/>
         <pin position="80" pad="PD8"/>
         <pin position="78" pad="PD9"/>
         <pin position="71" pad="PD10"/>
         <pin position="69" pad="PD11"/>
         <pin position="65" pad="PD12"/>
         <pin position="62" pad="PD13"/>
         <pin position="59" pad="PD14"/>
         <pin position="75" pad="PD15"/>
         <pin position="56" pad="PD16"/>
         <pin position="53" pad="PD17"/>
         <pin position="49" pad="PD18"/>
         <pin position="47" pad="PD19"/>
         <pin position="45" pad="PD20"/>
         <pin position="43" pad="PD21"/>
         <pin position="41" pad="PD22"/>
         <pin position="37" pad="PD24"/>
         <pin position="35" pad="PD25"/>
         <pin position="36" pad="PD26"/>
         <pin position="32" pad="PD27"/>
         <pin position="51" pad="PD28"/>
         <pin position="23" pad="PD30"/>
         <pin position="2" pad="PD31"/>
         <pin position="4" pad="VDDOUT"/>
         <pin position="5" pad="VDDIN"/>
         <pin position="6" pad="VREFN"/>
         <pin position="9" pad="VREFP"/>
         <pin position="58" pad="NRST"/>
         <pin position="60" pad="TST"/>
         <pin position="19" pad="VDDIO"/>
         <pin position="28" pad="VDDIO"/>
         <pin position="68" pad="VDDIO"/>
         <pin position="81" pad="VDDIO"/>
         <pin position="73" pad="JTAGSEL"/>
         <pin position="18" pad="VDDCORE"/>
         <pin position="22" pad="VDDCORE"/>
         <pin position="39" pad="VDDCORE"/>
         <pin position="76" pad="VDDCORE"/>
         <pin position="86" pad="VDDPLL"/>
         <pin position="93" pad="VDDUTMII"/>
         <pin position="94" pad="HSDM"/>
         <pin position="95" pad="HSDP"/>
         <pin position="3" pad="GND"/>
         <pin position="7" pad="GND"/>
         <pin position="8" pad="GND"/>
         <pin position="10" pad="GND"/>
         <pin position="29" pad="GND"/>
         <pin position="67" pad="GND"/>
         <pin position="96" pad="VDDUTMIC"/>
         <pin position="97" pad="VBG"/>
         <pin position="90" pad="VDDPLLUSB"/>
      </pinout>
   </pinouts>
</avr-tools-device-file>
